Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __IC16Rbits_t IC16Rbits __asm__ ("IC16R") __attribute__((section("sfrs"), address(0xBF801510)));
#define SCK5R SCK5R
extern volatile uint32_t   SCK5R __attribute__((section("sfrs"), address(0xBF801514)));
typedef struct {
  uint32_t SCK5R:4;
} __SCK5Rbits_t;
extern volatile __SCK5Rbits_t SCK5Rbits __asm__ ("SCK5R") __attribute__((section("sfrs"), address(0xBF801514)));
#define SDI5R SDI5R
extern volatile uint32_t   SDI5R __attribute__((section("sfrs"), address(0xBF801518)));
typedef struct {
  uint32_t SDI5R:4;
} __SDI5Rbits_t;
extern volatile __SDI5Rbits_t SDI5Rbits __asm__ ("SDI5R") __attribute__((section("sfrs"), address(0xBF801518)));
#define SS5R SS5R
extern volatile uint32_t   SS5R __attribute__((section("sfrs"), address(0xBF80151C)));
typedef struct {
  uint32_t SS5R:4;
} __SS5Rbits_t;
extern volatile __SS5Rbits_t SS5Rbits __asm__ ("SS5R") __attribute__((section("sfrs"), address(0xBF80151C)));
#define SCK6R SCK6R
extern volatile uint32_t   SCK6R __attribute__((section("sfrs"), address(0xBF801520)));
typedef struct {
  uint32_t SCK6R:4;
} __SCK6Rbits_t;
extern volatile __SCK6Rbits_t SCK6Rbits __asm__ ("SCK6R") __attribute__((section("sfrs"), address(0xBF801520)));
#define SDI6R SDI6R
extern volatile uint32_t   SDI6R __attribute__((section("sfrs"), address(0xBF801524)));
typedef struct {
  uint32_t SDI6R:4;
} __SDI6Rbits_t;
extern volatile __SDI6Rbits_t SDI6Rbits __asm__ ("SDI6R") __attribute__((section("sfrs"), address(0xBF801524)));
#define SS6R SS6R
extern volatile uint32_t   SS6R __attribute__((section("sfrs"), address(0xBF801528)));
typedef struct {
  uint32_t SS6R:4;
} __SS6Rbits_t;
extern volatile __SS6Rbits_t SS6Rbits __asm__ ("SS6R") __attribute__((section("sfrs"), address(0xBF801528)));
#define C3RXR C3RXR
extern volatile uint32_t   C3RXR __attribute__((section("sfrs"), address(0xBF80152C)));
typedef struct {
  uint32_t C3RXR:4;
} __C3RXRbits_t;
extern volatile __C3RXRbits_t C3RXRbits __asm__ ("C3RXR") __attribute__((section("sfrs"), address(0xBF80152C)));
#define C4RXR C4RXR
extern volatile uint32_t   C4RXR __attribute__((section("sfrs"), address(0xBF801530)));
typedef struct {
  uint32_t C4RXR:4;
} __C4RXRbits_t;
extern volatile __C4RXRbits_t C4RXRbits __asm__ ("C4RXR") __attribute__((section("sfrs"), address(0xBF801530)));
#define QEA3R QEA3R
extern volatile uint32_t   QEA3R __attribute__((section("sfrs"), address(0xBF801534)));
typedef struct {
  uint32_t QEA3R:4;
} __QEA3Rbits_t;
extern volatile __QEA3Rbits_t QEA3Rbits __asm__ ("QEA3R") __attribute__((section("sfrs"), address(0xBF801534)));
#define QEB3R QEB3R
extern volatile uint32_t   QEB3R __attribute__((section("sfrs"), address(0xBF801538)));
typedef struct {
  uint32_t QEB3R:4;
} __QEB3Rbits_t;
extern volatile __QEB3Rbits_t QEB3Rbits __asm__ ("QEB3R") __attribute__((section("sfrs"), address(0xBF801538)));
#define INDX3R INDX3R
extern volatile uint32_t   INDX3R __attribute__((section("sfrs"), address(0xBF80153C)));
typedef struct {
  uint32_t INDX3R:4;
} __INDX3Rbits_t;
extern volatile __INDX3Rbits_t INDX3Rbits __asm__ ("INDX3R") __attribute__((section("sfrs"), address(0xBF80153C)));
#define HOME3R HOME3R
extern volatile uint32_t   HOME3R __attribute__((section("sfrs"), address(0xBF801540)));
typedef struct {
  uint32_t HOME3R:4;
} __HOME3Rbits_t;
extern volatile __HOME3Rbits_t HOME3Rbits __asm__ ("HOME3R") __attribute__((section("sfrs"), address(0xBF801540)));
#define QEA4R QEA4R
extern volatile uint32_t   QEA4R __attribute__((section("sfrs"), address(0xBF801544)));
typedef struct {
  uint32_t QEA4R:4;
} __QEA4Rbits_t;
extern volatile __QEA4Rbits_t QEA4Rbits __asm__ ("QEA4R") __attribute__((section("sfrs"), address(0xBF801544)));
#define QEB4R QEB4R
extern volatile uint32_t   QEB4R __attribute__((section("sfrs"), address(0xBF801548)));
typedef struct {
  uint32_t QEB4R:4;
} __QEB4Rbits_t;
extern volatile __QEB4Rbits_t QEB4Rbits __asm__ ("QEB4R") __attribute__((section("sfrs"), address(0xBF801548)));
#define INDX4R INDX4R
extern volatile uint32_t   INDX4R __attribute__((section("sfrs"), address(0xBF80154C)));
typedef struct {
  uint32_t INDX4R:4;
} __INDX4Rbits_t;
extern volatile __INDX4Rbits_t INDX4Rbits __asm__ ("INDX4R") __attribute__((section("sfrs"), address(0xBF80154C)));
#define HOME4R HOME4R
extern volatile uint32_t   HOME4R __attribute__((section("sfrs"), address(0xBF801550)));
typedef struct {
  uint32_t HOME4R:4;
} __HOME4Rbits_t;
extern volatile __HOME4Rbits_t HOME4Rbits __asm__ ("HOME4R") __attribute__((section("sfrs"), address(0xBF801550)));
#define QEA5R QEA5R
extern volatile uint32_t   QEA5R __attribute__((section("sfrs"), address(0xBF801554)));
typedef struct {
  uint32_t QEA5R:4;
} __QEA5Rbits_t;
extern volatile __QEA5Rbits_t QEA5Rbits __asm__ ("QEA5R") __attribute__((section("sfrs"), address(0xBF801554)));
#define QEB5R QEB5R
extern volatile uint32_t   QEB5R __attribute__((section("sfrs"), address(0xBF801558)));
typedef struct {
  uint32_t QEB5R:4;
} __QEB5Rbits_t;
extern volatile __QEB5Rbits_t QEB5Rbits __asm__ ("QEB5R") __attribute__((section("sfrs"), address(0xBF801558)));
#define INDX5R INDX5R
extern volatile uint32_t   INDX5R __attribute__((section("sfrs"), address(0xBF80155C)));
typedef struct {
  uint32_t INDX5R:4;
} __INDX5Rbits_t;
extern volatile __INDX5Rbits_t INDX5Rbits __asm__ ("INDX5R") __attribute__((section("sfrs"), address(0xBF80155C)));
#define HOME5R HOME5R
extern volatile uint32_t   HOME5R __attribute__((section("sfrs"), address(0xBF801560)));
typedef struct {
  uint32_t HOME5R:4;
} __HOME5Rbits_t;
extern volatile __HOME5Rbits_t HOME5Rbits __asm__ ("HOME5R") __attribute__((section("sfrs"), address(0xBF801560)));
#define QEA6R QEA6R
extern volatile uint32_t   QEA6R __attribute__((section("sfrs"), address(0xBF801564)));
typedef struct {
  uint32_t QEA6R:4;
} __QEA6Rbits_t;
extern volatile __QEA6Rbits_t QEA6Rbits __asm__ ("QEA6R") __attribute__((section("sfrs"), address(0xBF801564)));
#define QEB6R QEB6R
extern volatile uint32_t   QEB6R __attribute__((section("sfrs"), address(0xBF801568)));
typedef struct {
  uint32_t QEB6R:4;
} __QEB6Rbits_t;
extern volatile __QEB6Rbits_t QEB6Rbits __asm__ ("QEB6R") __attribute__((section("sfrs"), address(0xBF801568)));
#define INDX6R INDX6R
extern volatile uint32_t   INDX6R __attribute__((section("sfrs"), address(0xBF80156C)));
typedef struct {
  uint32_t INDX6R:4;
} __INDX6Rbits_t;
extern volatile __INDX6Rbits_t INDX6Rbits __asm__ ("INDX6R") __attribute__((section("sfrs"), address(0xBF80156C)));
#define HOME6R HOME6R
extern volatile uint32_t   HOME6R __attribute__((section("sfrs"), address(0xBF801570)));
typedef struct {
  uint32_t HOME6R:4;
} __HOME6Rbits_t;
extern volatile __HOME6Rbits_t HOME6Rbits __asm__ ("HOME6R") __attribute__((section("sfrs"), address(0xBF801570)));
#define RPA0R RPA0R
extern volatile uint32_t   RPA0R __attribute__((section("sfrs"), address(0xBF801600)));
typedef struct {
  uint32_t RPA0R:5;
} __RPA0Rbits_t;
