Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __IPC55bits_t IPC55bits __asm__ ("IPC55") __attribute__((section("sfrs"), address(0xBF8104B0)));
extern volatile uint32_t        IPC55CLR __attribute__((section("sfrs"),address(0xBF8104B4)));
extern volatile uint32_t        IPC55SET __attribute__((section("sfrs"),address(0xBF8104B8)));
extern volatile uint32_t        IPC55INV __attribute__((section("sfrs"),address(0xBF8104BC)));
#define IPC56 IPC56
extern volatile uint32_t   IPC56 __attribute__((section("sfrs"), address(0xBF8104C0)));
typedef union {
  struct {
    uint32_t SPI5EIS:2;
    uint32_t SPI5EIP:3;
    uint32_t :3;
    uint32_t SPI5RXIS:2;
    uint32_t SPI5RXIP:3;
    uint32_t :3;
    uint32_t SPI5TXIS:2;
    uint32_t SPI5TXIP:3;
    uint32_t :3;
    uint32_t SPI6EIS:2;
    uint32_t SPI6EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC56bits_t;
extern volatile __IPC56bits_t IPC56bits __asm__ ("IPC56") __attribute__((section("sfrs"), address(0xBF8104C0)));
extern volatile uint32_t        IPC56CLR __attribute__((section("sfrs"),address(0xBF8104C4)));
extern volatile uint32_t        IPC56SET __attribute__((section("sfrs"),address(0xBF8104C8)));
extern volatile uint32_t        IPC56INV __attribute__((section("sfrs"),address(0xBF8104CC)));
#define IPC57 IPC57
extern volatile uint32_t   IPC57 __attribute__((section("sfrs"), address(0xBF8104D0)));
typedef union {
  struct {
    uint32_t SPI6RXIS:2;
    uint32_t SPI6RXIP:3;
    uint32_t :3;
    uint32_t SPI6TXIS:2;
    uint32_t SPI6TXIP:3;
    uint32_t :3;
    uint32_t SBIS:2;
    uint32_t SBIP:3;
    uint32_t :3;
    uint32_t PTGSTEPIS:2;
    uint32_t PTGSTEPIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC57bits_t;
extern volatile __IPC57bits_t IPC57bits __asm__ ("IPC57") __attribute__((section("sfrs"), address(0xBF8104D0)));
extern volatile uint32_t        IPC57CLR __attribute__((section("sfrs"),address(0xBF8104D4)));
extern volatile uint32_t        IPC57SET __attribute__((section("sfrs"),address(0xBF8104D8)));
extern volatile uint32_t        IPC57INV __attribute__((section("sfrs"),address(0xBF8104DC)));
#define IPC58 IPC58
extern volatile uint32_t   IPC58 __attribute__((section("sfrs"), address(0xBF8104E0)));
typedef union {
  struct {
    uint32_t PTGWDTIS:2;
    uint32_t PTGWDTIP:3;
    uint32_t :3;
    uint32_t PTG0TR0IS:2;
    uint32_t PTG0TR0IP:3;
    uint32_t :3;
    uint32_t PTG0TR1IS:2;
    uint32_t PTG0TR1IP:3;
    uint32_t :3;
    uint32_t PTG0TR2IS:2;
    uint32_t PTG0TR2IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC58bits_t;
extern volatile __IPC58bits_t IPC58bits __asm__ ("IPC58") __attribute__((section("sfrs"), address(0xBF8104E0)));
extern volatile uint32_t        IPC58CLR __attribute__((section("sfrs"),address(0xBF8104E4)));
extern volatile uint32_t        IPC58SET __attribute__((section("sfrs"),address(0xBF8104E8)));
extern volatile uint32_t        IPC58INV __attribute__((section("sfrs"),address(0xBF8104EC)));
#define IPC59 IPC59
extern volatile uint32_t   IPC59 __attribute__((section("sfrs"), address(0xBF8104F0)));
typedef union {
  struct {
    uint32_t PTG0TR3IS:2;
    uint32_t PTG0TR3IP:3;
    uint32_t :11;
    uint32_t PWM7IS:2;
    uint32_t PWM7IP:3;
    uint32_t :3;
    uint32_t PWM8IS:2;
    uint32_t PWM8IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC59bits_t;
extern volatile __IPC59bits_t IPC59bits __asm__ ("IPC59") __attribute__((section("sfrs"), address(0xBF8104F0)));
extern volatile uint32_t        IPC59CLR __attribute__((section("sfrs"),address(0xBF8104F4)));
extern volatile uint32_t        IPC59SET __attribute__((section("sfrs"),address(0xBF8104F8)));
extern volatile uint32_t        IPC59INV __attribute__((section("sfrs"),address(0xBF8104FC)));
#define IPC60 IPC60
extern volatile uint32_t   IPC60 __attribute__((section("sfrs"), address(0xBF810500)));
typedef union {
  struct {
    uint32_t PWM9IS:2;
    uint32_t PWM9IP:3;
    uint32_t :3;
    uint32_t PWM10IS:2;
    uint32_t PWM10IP:3;
    uint32_t :3;
    uint32_t PWM11IS:2;
    uint32_t PWM11IP:3;
    uint32_t :3;
    uint32_t PWM12IS:2;
    uint32_t PWM12IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC60bits_t;
extern volatile __IPC60bits_t IPC60bits __asm__ ("IPC60") __attribute__((section("sfrs"), address(0xBF810500)));
extern volatile uint32_t        IPC60CLR __attribute__((section("sfrs"),address(0xBF810504)));
extern volatile uint32_t        IPC60SET __attribute__((section("sfrs"),address(0xBF810508)));
extern volatile uint32_t        IPC60INV __attribute__((section("sfrs"),address(0xBF81050C)));
#define IPC61 IPC61
extern volatile uint32_t   IPC61 __attribute__((section("sfrs"), address(0xBF810510)));
typedef union {
  struct {
    uint32_t USB2IS:2;
    uint32_t USB2IP:3;
    uint32_t :3;
    uint32_t AD1DC3IS:2;
    uint32_t AD1DC3IP:3;
    uint32_t :3;
    uint32_t AD1DC4IS:2;
    uint32_t AD1DC4IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC61bits_t;
extern volatile __IPC61bits_t IPC61bits __asm__ ("IPC61") __attribute__((section("sfrs"), address(0xBF810510)));
extern volatile uint32_t        IPC61CLR __attribute__((section("sfrs"),address(0xBF810514)));
extern volatile uint32_t        IPC61SET __attribute__((section("sfrs"),address(0xBF810518)));
extern volatile uint32_t        IPC61INV __attribute__((section("sfrs"),address(0xBF81051C)));
#define IPC62 IPC62
extern volatile uint32_t   IPC62 __attribute__((section("sfrs"), address(0xBF810520)));
typedef struct {
  uint32_t w:32;
} __IPC62bits_t;
extern volatile __IPC62bits_t IPC62bits __asm__ ("IPC62") __attribute__((section("sfrs"), address(0xBF810520)));
extern volatile uint32_t        IPC62CLR __attribute__((section("sfrs"),address(0xBF810524)));
extern volatile uint32_t        IPC62SET __attribute__((section("sfrs"),address(0xBF810528)));
extern volatile uint32_t        IPC62INV __attribute__((section("sfrs"),address(0xBF81052C)));
#define IPC63 IPC63
extern volatile uint32_t   IPC63 __attribute__((section("sfrs"), address(0xBF810530)));
typedef union {
  struct {
    uint32_t :16;
    uint32_t CPCIS:2;
    uint32_t CPCIP:3;
    uint32_t :3;
    uint32_t CFDCIS:2;
    uint32_t CFDCIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC63bits_t;
