Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __OFF115bits_t OFF115bits __asm__ ("OFF115") __attribute__((section("sfrs"), address(0xBF81070C)));
#define OFF116 OFF116
extern volatile uint32_t   OFF116 __attribute__((section("sfrs"), address(0xBF810710)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF116bits_t;
extern volatile __OFF116bits_t OFF116bits __asm__ ("OFF116") __attribute__((section("sfrs"), address(0xBF810710)));
#define OFF117 OFF117
extern volatile uint32_t   OFF117 __attribute__((section("sfrs"), address(0xBF810714)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF117bits_t;
extern volatile __OFF117bits_t OFF117bits __asm__ ("OFF117") __attribute__((section("sfrs"), address(0xBF810714)));
#define OFF118 OFF118
extern volatile uint32_t   OFF118 __attribute__((section("sfrs"), address(0xBF810718)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF118bits_t;
extern volatile __OFF118bits_t OFF118bits __asm__ ("OFF118") __attribute__((section("sfrs"), address(0xBF810718)));
#define OFF119 OFF119
extern volatile uint32_t   OFF119 __attribute__((section("sfrs"), address(0xBF81071C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF119bits_t;
extern volatile __OFF119bits_t OFF119bits __asm__ ("OFF119") __attribute__((section("sfrs"), address(0xBF81071C)));
#define OFF120 OFF120
extern volatile uint32_t   OFF120 __attribute__((section("sfrs"), address(0xBF810720)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF120bits_t;
extern volatile __OFF120bits_t OFF120bits __asm__ ("OFF120") __attribute__((section("sfrs"), address(0xBF810720)));
#define OFF121 OFF121
extern volatile uint32_t   OFF121 __attribute__((section("sfrs"), address(0xBF810724)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF121bits_t;
extern volatile __OFF121bits_t OFF121bits __asm__ ("OFF121") __attribute__((section("sfrs"), address(0xBF810724)));
#define OFF122 OFF122
extern volatile uint32_t   OFF122 __attribute__((section("sfrs"), address(0xBF810728)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF122bits_t;
extern volatile __OFF122bits_t OFF122bits __asm__ ("OFF122") __attribute__((section("sfrs"), address(0xBF810728)));
#define OFF123 OFF123
extern volatile uint32_t   OFF123 __attribute__((section("sfrs"), address(0xBF81072C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF123bits_t;
extern volatile __OFF123bits_t OFF123bits __asm__ ("OFF123") __attribute__((section("sfrs"), address(0xBF81072C)));
#define OFF124 OFF124
extern volatile uint32_t   OFF124 __attribute__((section("sfrs"), address(0xBF810730)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF124bits_t;
extern volatile __OFF124bits_t OFF124bits __asm__ ("OFF124") __attribute__((section("sfrs"), address(0xBF810730)));
#define OFF125 OFF125
extern volatile uint32_t   OFF125 __attribute__((section("sfrs"), address(0xBF810734)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF125bits_t;
extern volatile __OFF125bits_t OFF125bits __asm__ ("OFF125") __attribute__((section("sfrs"), address(0xBF810734)));
#define OFF130 OFF130
extern volatile uint32_t   OFF130 __attribute__((section("sfrs"), address(0xBF810748)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF130bits_t;
extern volatile __OFF130bits_t OFF130bits __asm__ ("OFF130") __attribute__((section("sfrs"), address(0xBF810748)));
#define OFF131 OFF131
extern volatile uint32_t   OFF131 __attribute__((section("sfrs"), address(0xBF81074C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF131bits_t;
extern volatile __OFF131bits_t OFF131bits __asm__ ("OFF131") __attribute__((section("sfrs"), address(0xBF81074C)));
#define OFF132 OFF132
extern volatile uint32_t   OFF132 __attribute__((section("sfrs"), address(0xBF810750)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF132bits_t;
extern volatile __OFF132bits_t OFF132bits __asm__ ("OFF132") __attribute__((section("sfrs"), address(0xBF810750)));
#define OFF133 OFF133
extern volatile uint32_t   OFF133 __attribute__((section("sfrs"), address(0xBF810754)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF133bits_t;
extern volatile __OFF133bits_t OFF133bits __asm__ ("OFF133") __attribute__((section("sfrs"), address(0xBF810754)));
#define OFF154 OFF154
extern volatile uint32_t   OFF154 __attribute__((section("sfrs"), address(0xBF8107A8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF154bits_t;
extern volatile __OFF154bits_t OFF154bits __asm__ ("OFF154") __attribute__((section("sfrs"), address(0xBF8107A8)));
#define OFF155 OFF155
extern volatile uint32_t   OFF155 __attribute__((section("sfrs"), address(0xBF8107AC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF155bits_t;
extern volatile __OFF155bits_t OFF155bits __asm__ ("OFF155") __attribute__((section("sfrs"), address(0xBF8107AC)));
#define OFF156 OFF156
extern volatile uint32_t   OFF156 __attribute__((section("sfrs"), address(0xBF8107B0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF156bits_t;
extern volatile __OFF156bits_t OFF156bits __asm__ ("OFF156") __attribute__((section("sfrs"), address(0xBF8107B0)));
#define OFF157 OFF157
extern volatile uint32_t   OFF157 __attribute__((section("sfrs"), address(0xBF8107B4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF157bits_t;
extern volatile __OFF157bits_t OFF157bits __asm__ ("OFF157") __attribute__((section("sfrs"), address(0xBF8107B4)));
#define OFF158 OFF158
extern volatile uint32_t   OFF158 __attribute__((section("sfrs"), address(0xBF8107B8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF158bits_t;
extern volatile __OFF158bits_t OFF158bits __asm__ ("OFF158") __attribute__((section("sfrs"), address(0xBF8107B8)));
#define OFF159 OFF159
extern volatile uint32_t   OFF159 __attribute__((section("sfrs"), address(0xBF8107BC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF159bits_t;
extern volatile __OFF159bits_t OFF159bits __asm__ ("OFF159") __attribute__((section("sfrs"), address(0xBF8107BC)));
#define OFF160 OFF160
extern volatile uint32_t   OFF160 __attribute__((section("sfrs"), address(0xBF8107C0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF160bits_t;
