Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __OFF160bits_t OFF160bits __asm__ ("OFF160") __attribute__((section("sfrs"), address(0xBF8107C0)));
#define OFF161 OFF161
extern volatile uint32_t   OFF161 __attribute__((section("sfrs"), address(0xBF8107C4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF161bits_t;
extern volatile __OFF161bits_t OFF161bits __asm__ ("OFF161") __attribute__((section("sfrs"), address(0xBF8107C4)));
#define OFF162 OFF162
extern volatile uint32_t   OFF162 __attribute__((section("sfrs"), address(0xBF8107C8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF162bits_t;
extern volatile __OFF162bits_t OFF162bits __asm__ ("OFF162") __attribute__((section("sfrs"), address(0xBF8107C8)));
#define OFF164 OFF164
extern volatile uint32_t   OFF164 __attribute__((section("sfrs"), address(0xBF8107D0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF164bits_t;
extern volatile __OFF164bits_t OFF164bits __asm__ ("OFF164") __attribute__((section("sfrs"), address(0xBF8107D0)));
#define OFF165 OFF165
extern volatile uint32_t   OFF165 __attribute__((section("sfrs"), address(0xBF8107D4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF165bits_t;
extern volatile __OFF165bits_t OFF165bits __asm__ ("OFF165") __attribute__((section("sfrs"), address(0xBF8107D4)));
#define OFF166 OFF166
extern volatile uint32_t   OFF166 __attribute__((section("sfrs"), address(0xBF8107D8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF166bits_t;
extern volatile __OFF166bits_t OFF166bits __asm__ ("OFF166") __attribute__((section("sfrs"), address(0xBF8107D8)));
#define OFF167 OFF167
extern volatile uint32_t   OFF167 __attribute__((section("sfrs"), address(0xBF8107DC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF167bits_t;
extern volatile __OFF167bits_t OFF167bits __asm__ ("OFF167") __attribute__((section("sfrs"), address(0xBF8107DC)));
#define OFF168 OFF168
extern volatile uint32_t   OFF168 __attribute__((section("sfrs"), address(0xBF8107E0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF168bits_t;
extern volatile __OFF168bits_t OFF168bits __asm__ ("OFF168") __attribute__((section("sfrs"), address(0xBF8107E0)));
#define OFF169 OFF169
extern volatile uint32_t   OFF169 __attribute__((section("sfrs"), address(0xBF8107E4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF169bits_t;
extern volatile __OFF169bits_t OFF169bits __asm__ ("OFF169") __attribute__((section("sfrs"), address(0xBF8107E4)));
#define OFF170 OFF170
extern volatile uint32_t   OFF170 __attribute__((section("sfrs"), address(0xBF8107E8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF170bits_t;
extern volatile __OFF170bits_t OFF170bits __asm__ ("OFF170") __attribute__((section("sfrs"), address(0xBF8107E8)));
#define OFF171 OFF171
extern volatile uint32_t   OFF171 __attribute__((section("sfrs"), address(0xBF8107EC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF171bits_t;
extern volatile __OFF171bits_t OFF171bits __asm__ ("OFF171") __attribute__((section("sfrs"), address(0xBF8107EC)));
#define OFF172 OFF172
extern volatile uint32_t   OFF172 __attribute__((section("sfrs"), address(0xBF8107F0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF172bits_t;
extern volatile __OFF172bits_t OFF172bits __asm__ ("OFF172") __attribute__((section("sfrs"), address(0xBF8107F0)));
#define OFF173 OFF173
extern volatile uint32_t   OFF173 __attribute__((section("sfrs"), address(0xBF8107F4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF173bits_t;
extern volatile __OFF173bits_t OFF173bits __asm__ ("OFF173") __attribute__((section("sfrs"), address(0xBF8107F4)));
#define OFF174 OFF174
extern volatile uint32_t   OFF174 __attribute__((section("sfrs"), address(0xBF8107F8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF174bits_t;
extern volatile __OFF174bits_t OFF174bits __asm__ ("OFF174") __attribute__((section("sfrs"), address(0xBF8107F8)));
#define OFF175 OFF175
extern volatile uint32_t   OFF175 __attribute__((section("sfrs"), address(0xBF8107FC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF175bits_t;
extern volatile __OFF175bits_t OFF175bits __asm__ ("OFF175") __attribute__((section("sfrs"), address(0xBF8107FC)));
#define OFF176 OFF176
extern volatile uint32_t   OFF176 __attribute__((section("sfrs"), address(0xBF810800)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF176bits_t;
extern volatile __OFF176bits_t OFF176bits __asm__ ("OFF176") __attribute__((section("sfrs"), address(0xBF810800)));
#define OFF177 OFF177
extern volatile uint32_t   OFF177 __attribute__((section("sfrs"), address(0xBF810804)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF177bits_t;
extern volatile __OFF177bits_t OFF177bits __asm__ ("OFF177") __attribute__((section("sfrs"), address(0xBF810804)));
#define OFF178 OFF178
extern volatile uint32_t   OFF178 __attribute__((section("sfrs"), address(0xBF810808)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF178bits_t;
extern volatile __OFF178bits_t OFF178bits __asm__ ("OFF178") __attribute__((section("sfrs"), address(0xBF810808)));
#define OFF179 OFF179
extern volatile uint32_t   OFF179 __attribute__((section("sfrs"), address(0xBF81080C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF179bits_t;
extern volatile __OFF179bits_t OFF179bits __asm__ ("OFF179") __attribute__((section("sfrs"), address(0xBF81080C)));
#define OFF180 OFF180
extern volatile uint32_t   OFF180 __attribute__((section("sfrs"), address(0xBF810810)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF180bits_t;
extern volatile __OFF180bits_t OFF180bits __asm__ ("OFF180") __attribute__((section("sfrs"), address(0xBF810810)));
#define OFF181 OFF181
extern volatile uint32_t   OFF181 __attribute__((section("sfrs"), address(0xBF810814)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF181bits_t;
extern volatile __OFF181bits_t OFF181bits __asm__ ("OFF181") __attribute__((section("sfrs"), address(0xBF810814)));
#define OFF182 OFF182
extern volatile uint32_t   OFF182 __attribute__((section("sfrs"), address(0xBF810818)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF182bits_t;
extern volatile __OFF182bits_t OFF182bits __asm__ ("OFF182") __attribute__((section("sfrs"), address(0xBF810818)));
#define OFF183 OFF183
extern volatile uint32_t   OFF183 __attribute__((section("sfrs"), address(0xBF81081C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF183bits_t;
extern volatile __OFF183bits_t OFF183bits __asm__ ("OFF183") __attribute__((section("sfrs"), address(0xBF81081C)));
#define OFF184 OFF184
extern volatile uint32_t   OFF184 __attribute__((section("sfrs"), address(0xBF810820)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF184bits_t;
extern volatile __OFF184bits_t OFF184bits __asm__ ("OFF184") __attribute__((section("sfrs"), address(0xBF810820)));
#define OFF185 OFF185
extern volatile uint32_t   OFF185 __attribute__((section("sfrs"), address(0xBF810824)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF185bits_t;
extern volatile __OFF185bits_t OFF185bits __asm__ ("OFF185") __attribute__((section("sfrs"), address(0xBF810824)));
#define OFF186 OFF186
extern volatile uint32_t   OFF186 __attribute__((section("sfrs"), address(0xBF810828)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF186bits_t;
extern volatile __OFF186bits_t OFF186bits __asm__ ("OFF186") __attribute__((section("sfrs"), address(0xBF810828)));
#define OFF187 OFF187
extern volatile uint32_t   OFF187 __attribute__((section("sfrs"), address(0xBF81082C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF187bits_t;
