Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __OFF212bits_t OFF212bits __asm__ ("OFF212") __attribute__((section("sfrs"), address(0xBF810890)));
#define OFF213 OFF213
extern volatile uint32_t   OFF213 __attribute__((section("sfrs"), address(0xBF810894)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF213bits_t;
extern volatile __OFF213bits_t OFF213bits __asm__ ("OFF213") __attribute__((section("sfrs"), address(0xBF810894)));
#define OFF214 OFF214
extern volatile uint32_t   OFF214 __attribute__((section("sfrs"), address(0xBF810898)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF214bits_t;
extern volatile __OFF214bits_t OFF214bits __asm__ ("OFF214") __attribute__((section("sfrs"), address(0xBF810898)));
#define OFF215 OFF215
extern volatile uint32_t   OFF215 __attribute__((section("sfrs"), address(0xBF81089C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF215bits_t;
extern volatile __OFF215bits_t OFF215bits __asm__ ("OFF215") __attribute__((section("sfrs"), address(0xBF81089C)));
#define OFF216 OFF216
extern volatile uint32_t   OFF216 __attribute__((section("sfrs"), address(0xBF8108A0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF216bits_t;
extern volatile __OFF216bits_t OFF216bits __asm__ ("OFF216") __attribute__((section("sfrs"), address(0xBF8108A0)));
#define OFF217 OFF217
extern volatile uint32_t   OFF217 __attribute__((section("sfrs"), address(0xBF8108A4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF217bits_t;
extern volatile __OFF217bits_t OFF217bits __asm__ ("OFF217") __attribute__((section("sfrs"), address(0xBF8108A4)));
#define OFF218 OFF218
extern volatile uint32_t   OFF218 __attribute__((section("sfrs"), address(0xBF8108A8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF218bits_t;
extern volatile __OFF218bits_t OFF218bits __asm__ ("OFF218") __attribute__((section("sfrs"), address(0xBF8108A8)));
#define OFF219 OFF219
extern volatile uint32_t   OFF219 __attribute__((section("sfrs"), address(0xBF8108AC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF219bits_t;
extern volatile __OFF219bits_t OFF219bits __asm__ ("OFF219") __attribute__((section("sfrs"), address(0xBF8108AC)));
#define OFF220 OFF220
extern volatile uint32_t   OFF220 __attribute__((section("sfrs"), address(0xBF8108B0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF220bits_t;
extern volatile __OFF220bits_t OFF220bits __asm__ ("OFF220") __attribute__((section("sfrs"), address(0xBF8108B0)));
#define OFF221 OFF221
extern volatile uint32_t   OFF221 __attribute__((section("sfrs"), address(0xBF8108B4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF221bits_t;
extern volatile __OFF221bits_t OFF221bits __asm__ ("OFF221") __attribute__((section("sfrs"), address(0xBF8108B4)));
#define OFF222 OFF222
extern volatile uint32_t   OFF222 __attribute__((section("sfrs"), address(0xBF8108B8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF222bits_t;
extern volatile __OFF222bits_t OFF222bits __asm__ ("OFF222") __attribute__((section("sfrs"), address(0xBF8108B8)));
#define OFF223 OFF223
extern volatile uint32_t   OFF223 __attribute__((section("sfrs"), address(0xBF8108BC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF223bits_t;
extern volatile __OFF223bits_t OFF223bits __asm__ ("OFF223") __attribute__((section("sfrs"), address(0xBF8108BC)));
#define OFF224 OFF224
extern volatile uint32_t   OFF224 __attribute__((section("sfrs"), address(0xBF8108C0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF224bits_t;
extern volatile __OFF224bits_t OFF224bits __asm__ ("OFF224") __attribute__((section("sfrs"), address(0xBF8108C0)));
#define OFF225 OFF225
extern volatile uint32_t   OFF225 __attribute__((section("sfrs"), address(0xBF8108C4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF225bits_t;
extern volatile __OFF225bits_t OFF225bits __asm__ ("OFF225") __attribute__((section("sfrs"), address(0xBF8108C4)));
#define OFF226 OFF226
extern volatile uint32_t   OFF226 __attribute__((section("sfrs"), address(0xBF8108C8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF226bits_t;
extern volatile __OFF226bits_t OFF226bits __asm__ ("OFF226") __attribute__((section("sfrs"), address(0xBF8108C8)));
#define OFF227 OFF227
extern volatile uint32_t   OFF227 __attribute__((section("sfrs"), address(0xBF8108CC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF227bits_t;
extern volatile __OFF227bits_t OFF227bits __asm__ ("OFF227") __attribute__((section("sfrs"), address(0xBF8108CC)));
#define OFF228 OFF228
extern volatile uint32_t   OFF228 __attribute__((section("sfrs"), address(0xBF8108D0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF228bits_t;
extern volatile __OFF228bits_t OFF228bits __asm__ ("OFF228") __attribute__((section("sfrs"), address(0xBF8108D0)));
#define OFF229 OFF229
extern volatile uint32_t   OFF229 __attribute__((section("sfrs"), address(0xBF8108D4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF229bits_t;
extern volatile __OFF229bits_t OFF229bits __asm__ ("OFF229") __attribute__((section("sfrs"), address(0xBF8108D4)));
#define OFF230 OFF230
extern volatile uint32_t   OFF230 __attribute__((section("sfrs"), address(0xBF8108D8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF230bits_t;
extern volatile __OFF230bits_t OFF230bits __asm__ ("OFF230") __attribute__((section("sfrs"), address(0xBF8108D8)));
#define OFF238 OFF238
extern volatile uint32_t   OFF238 __attribute__((section("sfrs"), address(0xBF8108F8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF238bits_t;
extern volatile __OFF238bits_t OFF238bits __asm__ ("OFF238") __attribute__((section("sfrs"), address(0xBF8108F8)));
#define OFF239 OFF239
extern volatile uint32_t   OFF239 __attribute__((section("sfrs"), address(0xBF8108FC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF239bits_t;
extern volatile __OFF239bits_t OFF239bits __asm__ ("OFF239") __attribute__((section("sfrs"), address(0xBF8108FC)));
#define OFF240 OFF240
extern volatile uint32_t   OFF240 __attribute__((section("sfrs"), address(0xBF810900)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF240bits_t;
extern volatile __OFF240bits_t OFF240bits __asm__ ("OFF240") __attribute__((section("sfrs"), address(0xBF810900)));
#define OFF241 OFF241
extern volatile uint32_t   OFF241 __attribute__((section("sfrs"), address(0xBF810904)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF241bits_t;
