Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __IOCON1bits_t IOCON1bits __asm__ ("IOCON1") __attribute__((section("sfrs"), address(0xBF82A0D0)));
extern volatile uint32_t        IOCON1CLR __attribute__((section("sfrs"),address(0xBF82A0D4)));
extern volatile uint32_t        IOCON1SET __attribute__((section("sfrs"),address(0xBF82A0D8)));
extern volatile uint32_t        IOCON1INV __attribute__((section("sfrs"),address(0xBF82A0DC)));
#define PDC1 PDC1
extern volatile uint32_t   PDC1 __attribute__((section("sfrs"), address(0xBF82A0E0)));
typedef struct {
  uint32_t PDC:16;
} __PDC1bits_t;
extern volatile __PDC1bits_t PDC1bits __asm__ ("PDC1") __attribute__((section("sfrs"), address(0xBF82A0E0)));
extern volatile uint32_t        PDC1CLR __attribute__((section("sfrs"),address(0xBF82A0E4)));
extern volatile uint32_t        PDC1SET __attribute__((section("sfrs"),address(0xBF82A0E8)));
extern volatile uint32_t        PDC1INV __attribute__((section("sfrs"),address(0xBF82A0EC)));
#define SDC1 SDC1
extern volatile uint32_t   SDC1 __attribute__((section("sfrs"), address(0xBF82A0F0)));
typedef struct {
  uint32_t SDC:16;
} __SDC1bits_t;
extern volatile __SDC1bits_t SDC1bits __asm__ ("SDC1") __attribute__((section("sfrs"), address(0xBF82A0F0)));
extern volatile uint32_t        SDC1CLR __attribute__((section("sfrs"),address(0xBF82A0F4)));
extern volatile uint32_t        SDC1SET __attribute__((section("sfrs"),address(0xBF82A0F8)));
extern volatile uint32_t        SDC1INV __attribute__((section("sfrs"),address(0xBF82A0FC)));
#define PHASE1 PHASE1
extern volatile uint32_t   PHASE1 __attribute__((section("sfrs"), address(0xBF82A100)));
typedef struct {
  uint32_t PHASE:16;
} __PHASE1bits_t;
extern volatile __PHASE1bits_t PHASE1bits __asm__ ("PHASE1") __attribute__((section("sfrs"), address(0xBF82A100)));
extern volatile uint32_t        PHASE1CLR __attribute__((section("sfrs"),address(0xBF82A104)));
extern volatile uint32_t        PHASE1SET __attribute__((section("sfrs"),address(0xBF82A108)));
extern volatile uint32_t        PHASE1INV __attribute__((section("sfrs"),address(0xBF82A10C)));
#define DTR1 DTR1
extern volatile uint32_t   DTR1 __attribute__((section("sfrs"), address(0xBF82A110)));
typedef struct {
  uint32_t DTR:16;
} __DTR1bits_t;
extern volatile __DTR1bits_t DTR1bits __asm__ ("DTR1") __attribute__((section("sfrs"), address(0xBF82A110)));
extern volatile uint32_t        DTR1CLR __attribute__((section("sfrs"),address(0xBF82A114)));
extern volatile uint32_t        DTR1SET __attribute__((section("sfrs"),address(0xBF82A118)));
extern volatile uint32_t        DTR1INV __attribute__((section("sfrs"),address(0xBF82A11C)));
#define ALTDTR1 ALTDTR1
extern volatile uint32_t   ALTDTR1 __attribute__((section("sfrs"), address(0xBF82A120)));
typedef struct {
  uint32_t ALTDTR:16;
} __ALTDTR1bits_t;
extern volatile __ALTDTR1bits_t ALTDTR1bits __asm__ ("ALTDTR1") __attribute__((section("sfrs"), address(0xBF82A120)));
extern volatile uint32_t        ALTDTR1CLR __attribute__((section("sfrs"),address(0xBF82A124)));
extern volatile uint32_t        ALTDTR1SET __attribute__((section("sfrs"),address(0xBF82A128)));
extern volatile uint32_t        ALTDTR1INV __attribute__((section("sfrs"),address(0xBF82A12C)));
#define DTCOMP1 DTCOMP1
extern volatile uint32_t   DTCOMP1 __attribute__((section("sfrs"), address(0xBF82A130)));
typedef struct {
  uint32_t COMP:14;
} __DTCOMP1bits_t;
extern volatile __DTCOMP1bits_t DTCOMP1bits __asm__ ("DTCOMP1") __attribute__((section("sfrs"), address(0xBF82A130)));
extern volatile uint32_t        DTCOMP1CLR __attribute__((section("sfrs"),address(0xBF82A134)));
extern volatile uint32_t        DTCOMP1SET __attribute__((section("sfrs"),address(0xBF82A138)));
extern volatile uint32_t        DTCOMP1INV __attribute__((section("sfrs"),address(0xBF82A13C)));
#define TRIG1 TRIG1
extern volatile uint32_t   TRIG1 __attribute__((section("sfrs"), address(0xBF82A140)));
typedef struct {
  uint32_t TRGCMP:16;
} __TRIG1bits_t;
extern volatile __TRIG1bits_t TRIG1bits __asm__ ("TRIG1") __attribute__((section("sfrs"), address(0xBF82A140)));
extern volatile uint32_t        TRIG1CLR __attribute__((section("sfrs"),address(0xBF82A144)));
extern volatile uint32_t        TRIG1SET __attribute__((section("sfrs"),address(0xBF82A148)));
extern volatile uint32_t        TRIG1INV __attribute__((section("sfrs"),address(0xBF82A14C)));
#define TRGCON1 TRGCON1
extern volatile uint32_t   TRGCON1 __attribute__((section("sfrs"), address(0xBF82A150)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON1bits_t;
extern volatile __TRGCON1bits_t TRGCON1bits __asm__ ("TRGCON1") __attribute__((section("sfrs"), address(0xBF82A150)));
extern volatile uint32_t        TRGCON1CLR __attribute__((section("sfrs"),address(0xBF82A154)));
extern volatile uint32_t        TRGCON1SET __attribute__((section("sfrs"),address(0xBF82A158)));
extern volatile uint32_t        TRGCON1INV __attribute__((section("sfrs"),address(0xBF82A15C)));
#define STRIG1 STRIG1
extern volatile uint32_t   STRIG1 __attribute__((section("sfrs"), address(0xBF82A160)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG1bits_t;
extern volatile __STRIG1bits_t STRIG1bits __asm__ ("STRIG1") __attribute__((section("sfrs"), address(0xBF82A160)));
extern volatile uint32_t        STRIG1CLR __attribute__((section("sfrs"),address(0xBF82A164)));
extern volatile uint32_t        STRIG1SET __attribute__((section("sfrs"),address(0xBF82A168)));
extern volatile uint32_t        STRIG1INV __attribute__((section("sfrs"),address(0xBF82A16C)));
#define CAP1 CAP1
extern volatile uint32_t   CAP1 __attribute__((section("sfrs"), address(0xBF82A170)));
typedef struct {
  uint32_t CAP:16;
} __CAP1bits_t;
extern volatile __CAP1bits_t CAP1bits __asm__ ("CAP1") __attribute__((section("sfrs"), address(0xBF82A170)));
extern volatile uint32_t        CAP1CLR __attribute__((section("sfrs"),address(0xBF82A174)));
extern volatile uint32_t        CAP1SET __attribute__((section("sfrs"),address(0xBF82A178)));
extern volatile uint32_t        CAP1INV __attribute__((section("sfrs"),address(0xBF82A17C)));
#define LEBCON1 LEBCON1
extern volatile uint32_t   LEBCON1 __attribute__((section("sfrs"), address(0xBF82A180)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON1bits_t;
