Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __LEBDLY12bits_t LEBDLY12bits __asm__ ("LEBDLY12") __attribute__((section("sfrs"), address(0xBF82AC90)));
extern volatile uint32_t        LEBDLY12CLR __attribute__((section("sfrs"),address(0xBF82AC94)));
extern volatile uint32_t        LEBDLY12SET __attribute__((section("sfrs"),address(0xBF82AC98)));
extern volatile uint32_t        LEBDLY12INV __attribute__((section("sfrs"),address(0xBF82AC9C)));
#define AUXCON12 AUXCON12
extern volatile uint32_t   AUXCON12 __attribute__((section("sfrs"), address(0xBF82ACA0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON12bits_t;
extern volatile __AUXCON12bits_t AUXCON12bits __asm__ ("AUXCON12") __attribute__((section("sfrs"), address(0xBF82ACA0)));
extern volatile uint32_t        AUXCON12CLR __attribute__((section("sfrs"),address(0xBF82ACA4)));
extern volatile uint32_t        AUXCON12SET __attribute__((section("sfrs"),address(0xBF82ACA8)));
extern volatile uint32_t        AUXCON12INV __attribute__((section("sfrs"),address(0xBF82ACAC)));
#define PTMR12 PTMR12
extern volatile uint32_t   PTMR12 __attribute__((section("sfrs"), address(0xBF82ACB0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR12bits_t;
extern volatile __PTMR12bits_t PTMR12bits __asm__ ("PTMR12") __attribute__((section("sfrs"), address(0xBF82ACB0)));
extern volatile uint32_t        PTMR12CLR __attribute__((section("sfrs"),address(0xBF82ACB4)));
extern volatile uint32_t        PTMR12SET __attribute__((section("sfrs"),address(0xBF82ACB8)));
extern volatile uint32_t        PTMR12INV __attribute__((section("sfrs"),address(0xBF82ACBC)));
#define PTGCON PTGCON
extern volatile uint32_t   PTGCON __attribute__((section("sfrs"), address(0xBF82B000)));
typedef struct {
  uint32_t PTGITM:2;
  uint32_t :3;
  uint32_t PTGBUSY:1;
  uint32_t PTGWDTO:1;
  uint32_t PTGSTRT:1;
  uint32_t PTGIVIS:1;
  uint32_t PTGSSEN:1;
  uint32_t PTGSWT:1;
  uint32_t RESERVED:1;
  uint32_t PTGTOGL:1;
  uint32_t PTGSIDL:1;
  uint32_t :1;
  uint32_t PTGON:1;
  uint32_t PTGWDT:3;
  uint32_t :1;
  uint32_t PTGPWD:4;
  uint32_t PTGDIV:5;
  uint32_t PTGCLK:3;
} __PTGCONbits_t;
extern volatile __PTGCONbits_t PTGCONbits __asm__ ("PTGCON") __attribute__((section("sfrs"), address(0xBF82B000)));
extern volatile uint32_t        PTGCONCLR __attribute__((section("sfrs"),address(0xBF82B004)));
extern volatile uint32_t        PTGCONSET __attribute__((section("sfrs"),address(0xBF82B008)));
extern volatile uint32_t        PTGCONINV __attribute__((section("sfrs"),address(0xBF82B00C)));
#define PTGBTE PTGBTE
extern volatile uint32_t   PTGBTE __attribute__((section("sfrs"), address(0xBF82B010)));
typedef struct {
  uint32_t PTGBTE:32;
} __PTGBTEbits_t;
extern volatile __PTGBTEbits_t PTGBTEbits __asm__ ("PTGBTE") __attribute__((section("sfrs"), address(0xBF82B010)));
extern volatile uint32_t        PTGBTECLR __attribute__((section("sfrs"),address(0xBF82B014)));
extern volatile uint32_t        PTGBTESET __attribute__((section("sfrs"),address(0xBF82B018)));
extern volatile uint32_t        PTGBTEINV __attribute__((section("sfrs"),address(0xBF82B01C)));
#define PTGHOLD PTGHOLD
extern volatile uint32_t   PTGHOLD __attribute__((section("sfrs"), address(0xBF82B020)));
typedef struct {
  uint32_t PTGHOLD:16;
} __PTGHOLDbits_t;
extern volatile __PTGHOLDbits_t PTGHOLDbits __asm__ ("PTGHOLD") __attribute__((section("sfrs"), address(0xBF82B020)));
extern volatile uint32_t        PTGHOLDCLR __attribute__((section("sfrs"),address(0xBF82B024)));
extern volatile uint32_t        PTGHOLDSET __attribute__((section("sfrs"),address(0xBF82B028)));
extern volatile uint32_t        PTGHOLDINV __attribute__((section("sfrs"),address(0xBF82B02C)));
#define PTGT0LIM PTGT0LIM
extern volatile uint32_t   PTGT0LIM __attribute__((section("sfrs"), address(0xBF82B030)));
typedef struct {
  uint32_t PTGT0LIM:16;
} __PTGT0LIMbits_t;
extern volatile __PTGT0LIMbits_t PTGT0LIMbits __asm__ ("PTGT0LIM") __attribute__((section("sfrs"), address(0xBF82B030)));
extern volatile uint32_t        PTGT0LIMCLR __attribute__((section("sfrs"),address(0xBF82B034)));
extern volatile uint32_t        PTGT0LIMSET __attribute__((section("sfrs"),address(0xBF82B038)));
extern volatile uint32_t        PTGT0LIMINV __attribute__((section("sfrs"),address(0xBF82B03C)));
#define PTGT1LIM PTGT1LIM
extern volatile uint32_t   PTGT1LIM __attribute__((section("sfrs"), address(0xBF82B040)));
typedef struct {
  uint32_t PTGT1LIM:16;
} __PTGT1LIMbits_t;
extern volatile __PTGT1LIMbits_t PTGT1LIMbits __asm__ ("PTGT1LIM") __attribute__((section("sfrs"), address(0xBF82B040)));
extern volatile uint32_t        PTGT1LIMCLR __attribute__((section("sfrs"),address(0xBF82B044)));
extern volatile uint32_t        PTGT1LIMSET __attribute__((section("sfrs"),address(0xBF82B048)));
extern volatile uint32_t        PTGT1LIMINV __attribute__((section("sfrs"),address(0xBF82B04C)));
#define PTGSDLIM PTGSDLIM
extern volatile uint32_t   PTGSDLIM __attribute__((section("sfrs"), address(0xBF82B050)));
typedef struct {
  uint32_t PTGSDLIM:16;
} __PTGSDLIMbits_t;
extern volatile __PTGSDLIMbits_t PTGSDLIMbits __asm__ ("PTGSDLIM") __attribute__((section("sfrs"), address(0xBF82B050)));
extern volatile uint32_t        PTGSDLIMCLR __attribute__((section("sfrs"),address(0xBF82B054)));
extern volatile uint32_t        PTGSDLIMSET __attribute__((section("sfrs"),address(0xBF82B058)));
extern volatile uint32_t        PTGSDLIMINV __attribute__((section("sfrs"),address(0xBF82B05C)));
#define PTGC0LIM PTGC0LIM
extern volatile uint32_t   PTGC0LIM __attribute__((section("sfrs"), address(0xBF82B060)));
typedef struct {
  uint32_t PTGC0LIM:16;
} __PTGC0LIMbits_t;
extern volatile __PTGC0LIMbits_t PTGC0LIMbits __asm__ ("PTGC0LIM") __attribute__((section("sfrs"), address(0xBF82B060)));
extern volatile uint32_t        PTGC0LIMCLR __attribute__((section("sfrs"),address(0xBF82B064)));
extern volatile uint32_t        PTGC0LIMSET __attribute__((section("sfrs"),address(0xBF82B068)));
extern volatile uint32_t        PTGC0LIMINV __attribute__((section("sfrs"),address(0xBF82B06C)));
#define PTGC1LIM PTGC1LIM
extern volatile uint32_t   PTGC1LIM __attribute__((section("sfrs"), address(0xBF82B070)));
typedef struct {
  uint32_t PTGC1LIM:16;
} __PTGC1LIMbits_t;
extern volatile __PTGC1LIMbits_t PTGC1LIMbits __asm__ ("PTGC1LIM") __attribute__((section("sfrs"), address(0xBF82B070)));
extern volatile uint32_t        PTGC1LIMCLR __attribute__((section("sfrs"),address(0xBF82B074)));
extern volatile uint32_t        PTGC1LIMSET __attribute__((section("sfrs"),address(0xBF82B078)));
extern volatile uint32_t        PTGC1LIMINV __attribute__((section("sfrs"),address(0xBF82B07C)));
#define PTGADJ PTGADJ
extern volatile uint32_t   PTGADJ __attribute__((section("sfrs"), address(0xBF82B080)));
typedef struct {
  uint32_t PTGADJ:16;
} __PTGADJbits_t;
