Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __PTGADJbits_t PTGADJbits __asm__ ("PTGADJ") __attribute__((section("sfrs"), address(0xBF82B080)));
extern volatile uint32_t        PTGADJCLR __attribute__((section("sfrs"),address(0xBF82B084)));
extern volatile uint32_t        PTGADJSET __attribute__((section("sfrs"),address(0xBF82B088)));
extern volatile uint32_t        PTGADJINV __attribute__((section("sfrs"),address(0xBF82B08C)));
#define PTGL0 PTGL0
extern volatile uint32_t   PTGL0 __attribute__((section("sfrs"), address(0xBF82B090)));
typedef struct {
  uint32_t PTGL0:16;
} __PTGL0bits_t;
extern volatile __PTGL0bits_t PTGL0bits __asm__ ("PTGL0") __attribute__((section("sfrs"), address(0xBF82B090)));
extern volatile uint32_t        PTGL0CLR __attribute__((section("sfrs"),address(0xBF82B094)));
extern volatile uint32_t        PTGL0SET __attribute__((section("sfrs"),address(0xBF82B098)));
extern volatile uint32_t        PTGL0INV __attribute__((section("sfrs"),address(0xBF82B09C)));
#define PTGQPTR PTGQPTR
extern volatile uint32_t   PTGQPTR __attribute__((section("sfrs"), address(0xBF82B0A0)));
typedef struct {
  uint32_t PTGQPTR:5;
} __PTGQPTRbits_t;
extern volatile __PTGQPTRbits_t PTGQPTRbits __asm__ ("PTGQPTR") __attribute__((section("sfrs"), address(0xBF82B0A0)));
extern volatile uint32_t        PTGQPTRCLR __attribute__((section("sfrs"),address(0xBF82B0A4)));
extern volatile uint32_t        PTGQPTRSET __attribute__((section("sfrs"),address(0xBF82B0A8)));
extern volatile uint32_t        PTGQPTRINV __attribute__((section("sfrs"),address(0xBF82B0AC)));
#define PTGQUE0 PTGQUE0
extern volatile uint32_t   PTGQUE0 __attribute__((section("sfrs"), address(0xBF82B0C0)));
typedef struct {
  uint32_t STEP0:8;
  uint32_t STEP1:8;
  uint32_t STEP2:8;
  uint32_t STEP3:8;
} __PTGQUE0bits_t;
extern volatile __PTGQUE0bits_t PTGQUE0bits __asm__ ("PTGQUE0") __attribute__((section("sfrs"), address(0xBF82B0C0)));
extern volatile uint32_t        PTGQUE0CLR __attribute__((section("sfrs"),address(0xBF82B0C4)));
extern volatile uint32_t        PTGQUE0SET __attribute__((section("sfrs"),address(0xBF82B0C8)));
extern volatile uint32_t        PTGQUE0INV __attribute__((section("sfrs"),address(0xBF82B0CC)));
#define PTGQUE1 PTGQUE1
extern volatile uint32_t   PTGQUE1 __attribute__((section("sfrs"), address(0xBF82B0D0)));
typedef struct {
  uint32_t STEP4:8;
  uint32_t STEP5:8;
  uint32_t STEP6:8;
  uint32_t STEP7:8;
} __PTGQUE1bits_t;
extern volatile __PTGQUE1bits_t PTGQUE1bits __asm__ ("PTGQUE1") __attribute__((section("sfrs"), address(0xBF82B0D0)));
extern volatile uint32_t        PTGQUE1CLR __attribute__((section("sfrs"),address(0xBF82B0D4)));
extern volatile uint32_t        PTGQUE1SET __attribute__((section("sfrs"),address(0xBF82B0D8)));
extern volatile uint32_t        PTGQUE1INV __attribute__((section("sfrs"),address(0xBF82B0DC)));
#define PTGQUE2 PTGQUE2
extern volatile uint32_t   PTGQUE2 __attribute__((section("sfrs"), address(0xBF82B0E0)));
typedef struct {
  uint32_t STEP8:8;
  uint32_t STEP9:8;
  uint32_t STEP10:8;
  uint32_t STEP11:8;
} __PTGQUE2bits_t;
extern volatile __PTGQUE2bits_t PTGQUE2bits __asm__ ("PTGQUE2") __attribute__((section("sfrs"), address(0xBF82B0E0)));
extern volatile uint32_t        PTGQUE2CLR __attribute__((section("sfrs"),address(0xBF82B0E4)));
extern volatile uint32_t        PTGQUE2SET __attribute__((section("sfrs"),address(0xBF82B0E8)));
extern volatile uint32_t        PTGQUE2INV __attribute__((section("sfrs"),address(0xBF82B0EC)));
#define PTGQUE3 PTGQUE3
extern volatile uint32_t   PTGQUE3 __attribute__((section("sfrs"), address(0xBF82B0F0)));
typedef struct {
  uint32_t STEP12:8;
  uint32_t STEP13:8;
  uint32_t STEP14:8;
  uint32_t STEP15:8;
} __PTGQUE3bits_t;
extern volatile __PTGQUE3bits_t PTGQUE3bits __asm__ ("PTGQUE3") __attribute__((section("sfrs"), address(0xBF82B0F0)));
extern volatile uint32_t        PTGQUE3CLR __attribute__((section("sfrs"),address(0xBF82B0F4)));
extern volatile uint32_t        PTGQUE3SET __attribute__((section("sfrs"),address(0xBF82B0F8)));
extern volatile uint32_t        PTGQUE3INV __attribute__((section("sfrs"),address(0xBF82B0FC)));
#define PTGQUE4 PTGQUE4
extern volatile uint32_t   PTGQUE4 __attribute__((section("sfrs"), address(0xBF82B100)));
typedef struct {
  uint32_t STEP16:8;
  uint32_t STEP17:8;
  uint32_t STEP18:8;
  uint32_t STEP19:8;
} __PTGQUE4bits_t;
extern volatile __PTGQUE4bits_t PTGQUE4bits __asm__ ("PTGQUE4") __attribute__((section("sfrs"), address(0xBF82B100)));
extern volatile uint32_t        PTGQUE4CLR __attribute__((section("sfrs"),address(0xBF82B104)));
extern volatile uint32_t        PTGQUE4SET __attribute__((section("sfrs"),address(0xBF82B108)));
extern volatile uint32_t        PTGQUE4INV __attribute__((section("sfrs"),address(0xBF82B10C)));
#define PTGQUE5 PTGQUE5
extern volatile uint32_t   PTGQUE5 __attribute__((section("sfrs"), address(0xBF82B110)));
typedef struct {
  uint32_t STEP20:8;
  uint32_t STEP21:8;
  uint32_t STEP22:8;
  uint32_t STEP23:8;
} __PTGQUE5bits_t;
extern volatile __PTGQUE5bits_t PTGQUE5bits __asm__ ("PTGQUE5") __attribute__((section("sfrs"), address(0xBF82B110)));
extern volatile uint32_t        PTGQUE5CLR __attribute__((section("sfrs"),address(0xBF82B114)));
extern volatile uint32_t        PTGQUE5SET __attribute__((section("sfrs"),address(0xBF82B118)));
extern volatile uint32_t        PTGQUE5INV __attribute__((section("sfrs"),address(0xBF82B11C)));
#define PTGQUE6 PTGQUE6
extern volatile uint32_t   PTGQUE6 __attribute__((section("sfrs"), address(0xBF82B120)));
typedef struct {
  uint32_t STEP24:8;
  uint32_t STEP25:8;
  uint32_t STEP26:8;
  uint32_t STEP27:8;
} __PTGQUE6bits_t;
extern volatile __PTGQUE6bits_t PTGQUE6bits __asm__ ("PTGQUE6") __attribute__((section("sfrs"), address(0xBF82B120)));
extern volatile uint32_t        PTGQUE6CLR __attribute__((section("sfrs"),address(0xBF82B124)));
extern volatile uint32_t        PTGQUE6SET __attribute__((section("sfrs"),address(0xBF82B128)));
extern volatile uint32_t        PTGQUE6INV __attribute__((section("sfrs"),address(0xBF82B12C)));
#define PTGQUE7 PTGQUE7
extern volatile uint32_t   PTGQUE7 __attribute__((section("sfrs"), address(0xBF82B130)));
typedef struct {
  uint32_t STEP28:8;
  uint32_t STEP29:8;
  uint32_t STEP30:8;
  uint32_t STEP31:8;
} __PTGQUE7bits_t;
extern volatile __PTGQUE7bits_t PTGQUE7bits __asm__ ("PTGQUE7") __attribute__((section("sfrs"), address(0xBF82B130)));
extern volatile uint32_t        PTGQUE7CLR __attribute__((section("sfrs"),address(0xBF82B134)));
extern volatile uint32_t        PTGQUE7SET __attribute__((section("sfrs"),address(0xBF82B138)));
extern volatile uint32_t        PTGQUE7INV __attribute__((section("sfrs"),address(0xBF82B13C)));
#define QEI1CON QEI1CON
extern volatile uint32_t   QEI1CON __attribute__((section("sfrs"), address(0xBF82B200)));
typedef struct {
  uint32_t CCM:2;
  uint32_t GATEN:1;
  uint32_t CNTPOL:1;
  uint32_t INTDIV:3;
  uint32_t :1;
  uint32_t IMV:2;
  uint32_t PIMOD:3;
  uint32_t QEISIDL:1;
  uint32_t :1;
  uint32_t QEIEN:1;
} __QEI1CONbits_t;
extern volatile __QEI1CONbits_t QEI1CONbits __asm__ ("QEI1CON") __attribute__((section("sfrs"), address(0xBF82B200)));
extern volatile uint32_t        QEI1CONCLR __attribute__((section("sfrs"),address(0xBF82B204)));
extern volatile uint32_t        QEI1CONSET __attribute__((section("sfrs"),address(0xBF82B208)));
extern volatile uint32_t        QEI1CONINV __attribute__((section("sfrs"),address(0xBF82B20C)));
#define QEI1IOC QEI1IOC
extern volatile uint32_t   QEI1IOC __attribute__((section("sfrs"), address(0xBF82B210)));
typedef struct {
  uint32_t QEA:1;
  uint32_t QEB:1;
  uint32_t INDEX:1;
  uint32_t HOME:1;
  uint32_t QEAPOL:1;
  uint32_t QEBPOL:1;
  uint32_t IDXPOL:1;
  uint32_t HOMPOL:1;
  uint32_t SWPAB:1;
  uint32_t OUTFNC:2;
  uint32_t QFDIV:3;
  uint32_t FLTREN:1;
  uint32_t QCAPEN:1;
  uint32_t HCAPEN:1;
} __QEI1IOCbits_t;
extern volatile __QEI1IOCbits_t QEI1IOCbits __asm__ ("QEI1IOC") __attribute__((section("sfrs"), address(0xBF82B210)));
extern volatile uint32_t        QEI1IOCCLR __attribute__((section("sfrs"),address(0xBF82B214)));
extern volatile uint32_t        QEI1IOCSET __attribute__((section("sfrs"),address(0xBF82B218)));
extern volatile uint32_t        QEI1IOCINV __attribute__((section("sfrs"),address(0xBF82B21C)));
#define QEI1STAT QEI1STAT
extern volatile uint32_t   QEI1STAT __attribute__((section("sfrs"), address(0xBF82B220)));
typedef struct {
  uint32_t IDXIEN:1;
  uint32_t IDXIRQ:1;
  uint32_t HOMIEN:1;
  uint32_t HOMIRQ:1;
  uint32_t VELOVIEN:1;
  uint32_t VELOVIRQ:1;
  uint32_t PCIIEN:1;
  uint32_t PCIIRQ:1;
  uint32_t POSOVIEN:1;
  uint32_t POSOVIRQ:1;
  uint32_t PCLEQIEN:1;
  uint32_t PCLEQIRQ:1;
  uint32_t PCHEQIEN:1;
  uint32_t PCHEQIRQ:1;
} __QEI1STATbits_t;
