Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __POS2HLDbits_t POS2HLDbits __asm__ ("POS2HLD") __attribute__((section("sfrs"), address(0xBF82B440)));
extern volatile uint32_t        POS2HLDCLR __attribute__((section("sfrs"),address(0xBF82B444)));
extern volatile uint32_t        POS2HLDSET __attribute__((section("sfrs"),address(0xBF82B448)));
extern volatile uint32_t        POS2HLDINV __attribute__((section("sfrs"),address(0xBF82B44C)));
#define VEL2CNT VEL2CNT
extern volatile uint32_t   VEL2CNT __attribute__((section("sfrs"), address(0xBF82B450)));
typedef struct {
  uint32_t VELCNT:32;
} __VEL2CNTbits_t;
extern volatile __VEL2CNTbits_t VEL2CNTbits __asm__ ("VEL2CNT") __attribute__((section("sfrs"), address(0xBF82B450)));
extern volatile uint32_t        VEL2CNTCLR __attribute__((section("sfrs"),address(0xBF82B454)));
extern volatile uint32_t        VEL2CNTSET __attribute__((section("sfrs"),address(0xBF82B458)));
extern volatile uint32_t        VEL2CNTINV __attribute__((section("sfrs"),address(0xBF82B45C)));
#define VEL2HLD VEL2HLD
extern volatile uint32_t   VEL2HLD __attribute__((section("sfrs"), address(0xBF82B460)));
typedef struct {
  uint32_t VELHLD:32;
} __VEL2HLDbits_t;
extern volatile __VEL2HLDbits_t VEL2HLDbits __asm__ ("VEL2HLD") __attribute__((section("sfrs"), address(0xBF82B460)));
extern volatile uint32_t        VEL2HLDCLR __attribute__((section("sfrs"),address(0xBF82B464)));
extern volatile uint32_t        VEL2HLDSET __attribute__((section("sfrs"),address(0xBF82B468)));
extern volatile uint32_t        VEL2HLDINV __attribute__((section("sfrs"),address(0xBF82B46C)));
#define INT2TMR INT2TMR
extern volatile uint32_t   INT2TMR __attribute__((section("sfrs"), address(0xBF82B470)));
typedef struct {
  uint32_t INTTMR:32;
} __INT2TMRbits_t;
extern volatile __INT2TMRbits_t INT2TMRbits __asm__ ("INT2TMR") __attribute__((section("sfrs"), address(0xBF82B470)));
extern volatile uint32_t        INT2TMRCLR __attribute__((section("sfrs"),address(0xBF82B474)));
extern volatile uint32_t        INT2TMRSET __attribute__((section("sfrs"),address(0xBF82B478)));
extern volatile uint32_t        INT2TMRINV __attribute__((section("sfrs"),address(0xBF82B47C)));
#define INT2HLD INT2HLD
extern volatile uint32_t   INT2HLD __attribute__((section("sfrs"), address(0xBF82B480)));
typedef struct {
  uint32_t INTHLD:32;
} __INT2HLDbits_t;
extern volatile __INT2HLDbits_t INT2HLDbits __asm__ ("INT2HLD") __attribute__((section("sfrs"), address(0xBF82B480)));
extern volatile uint32_t        INT2HLDCLR __attribute__((section("sfrs"),address(0xBF82B484)));
extern volatile uint32_t        INT2HLDSET __attribute__((section("sfrs"),address(0xBF82B488)));
extern volatile uint32_t        INT2HLDINV __attribute__((section("sfrs"),address(0xBF82B48C)));
#define INDX2CNT INDX2CNT
extern volatile uint32_t   INDX2CNT __attribute__((section("sfrs"), address(0xBF82B490)));
typedef struct {
  uint32_t INDXCNT:32;
} __INDX2CNTbits_t;
extern volatile __INDX2CNTbits_t INDX2CNTbits __asm__ ("INDX2CNT") __attribute__((section("sfrs"), address(0xBF82B490)));
extern volatile uint32_t        INDX2CNTCLR __attribute__((section("sfrs"),address(0xBF82B494)));
extern volatile uint32_t        INDX2CNTSET __attribute__((section("sfrs"),address(0xBF82B498)));
extern volatile uint32_t        INDX2CNTINV __attribute__((section("sfrs"),address(0xBF82B49C)));
#define INDX2HLD INDX2HLD
extern volatile uint32_t   INDX2HLD __attribute__((section("sfrs"), address(0xBF82B4A0)));
typedef struct {
  uint32_t INDXHLD:32;
} __INDX2HLDbits_t;
extern volatile __INDX2HLDbits_t INDX2HLDbits __asm__ ("INDX2HLD") __attribute__((section("sfrs"), address(0xBF82B4A0)));
extern volatile uint32_t        INDX2HLDCLR __attribute__((section("sfrs"),address(0xBF82B4A4)));
extern volatile uint32_t        INDX2HLDSET __attribute__((section("sfrs"),address(0xBF82B4A8)));
extern volatile uint32_t        INDX2HLDINV __attribute__((section("sfrs"),address(0xBF82B4AC)));
#define QEI2ICC QEI2ICC
extern volatile uint32_t   QEI2ICC __attribute__((section("sfrs"), address(0xBF82B4B0)));
typedef struct {
  uint32_t QEIICC:32;
} __QEI2ICCbits_t;
extern volatile __QEI2ICCbits_t QEI2ICCbits __asm__ ("QEI2ICC") __attribute__((section("sfrs"), address(0xBF82B4B0)));
extern volatile uint32_t        QEI2ICCCLR __attribute__((section("sfrs"),address(0xBF82B4B4)));
extern volatile uint32_t        QEI2ICCSET __attribute__((section("sfrs"),address(0xBF82B4B8)));
extern volatile uint32_t        QEI2ICCINV __attribute__((section("sfrs"),address(0xBF82B4BC)));
#define QEI2CMPL QEI2CMPL
extern volatile uint32_t   QEI2CMPL __attribute__((section("sfrs"), address(0xBF82B4C0)));
typedef struct {
  uint32_t QEICMPL:32;
} __QEI2CMPLbits_t;
extern volatile __QEI2CMPLbits_t QEI2CMPLbits __asm__ ("QEI2CMPL") __attribute__((section("sfrs"), address(0xBF82B4C0)));
extern volatile uint32_t        QEI2CMPLCLR __attribute__((section("sfrs"),address(0xBF82B4C4)));
extern volatile uint32_t        QEI2CMPLSET __attribute__((section("sfrs"),address(0xBF82B4C8)));
extern volatile uint32_t        QEI2CMPLINV __attribute__((section("sfrs"),address(0xBF82B4CC)));
#define QEI3CON QEI3CON
extern volatile uint32_t   QEI3CON __attribute__((section("sfrs"), address(0xBF82B600)));
typedef struct {
  uint32_t CCM:2;
  uint32_t GATEN:1;
  uint32_t CNTPOL:1;
  uint32_t INTDIV:3;
  uint32_t :1;
  uint32_t IMV:2;
  uint32_t PIMOD:3;
  uint32_t QEISIDL:1;
  uint32_t :1;
  uint32_t QEIEN:1;
} __QEI3CONbits_t;
extern volatile __QEI3CONbits_t QEI3CONbits __asm__ ("QEI3CON") __attribute__((section("sfrs"), address(0xBF82B600)));
extern volatile uint32_t        QEI3CONCLR __attribute__((section("sfrs"),address(0xBF82B604)));
extern volatile uint32_t        QEI3CONSET __attribute__((section("sfrs"),address(0xBF82B608)));
extern volatile uint32_t        QEI3CONINV __attribute__((section("sfrs"),address(0xBF82B60C)));
#define QEI3IOC QEI3IOC
extern volatile uint32_t   QEI3IOC __attribute__((section("sfrs"), address(0xBF82B610)));
typedef struct {
  uint32_t QEA:1;
  uint32_t QEB:1;
  uint32_t INDEX:1;
  uint32_t HOME:1;
  uint32_t QEAPOL:1;
  uint32_t QEBPOL:1;
  uint32_t IDXPOL:1;
  uint32_t HOMPOL:1;
  uint32_t SWPAB:1;
  uint32_t OUTFNC:2;
  uint32_t QFDIV:3;
  uint32_t FLTREN:1;
  uint32_t QCAPEN:1;
  uint32_t HCAPEN:1;
} __QEI3IOCbits_t;
