Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __QEI3IOCbits_t QEI3IOCbits __asm__ ("QEI3IOC") __attribute__((section("sfrs"), address(0xBF82B610)));
extern volatile uint32_t        QEI3IOCCLR __attribute__((section("sfrs"),address(0xBF82B614)));
extern volatile uint32_t        QEI3IOCSET __attribute__((section("sfrs"),address(0xBF82B618)));
extern volatile uint32_t        QEI3IOCINV __attribute__((section("sfrs"),address(0xBF82B61C)));
#define QEI3STAT QEI3STAT
extern volatile uint32_t   QEI3STAT __attribute__((section("sfrs"), address(0xBF82B620)));
typedef struct {
  uint32_t IDXIEN:1;
  uint32_t IDXIRQ:1;
  uint32_t HOMIEN:1;
  uint32_t HOMIRQ:1;
  uint32_t VELOVIEN:1;
  uint32_t VELOVIRQ:1;
  uint32_t PCIIEN:1;
  uint32_t PCIIRQ:1;
  uint32_t POSOVIEN:1;
  uint32_t POSOVIRQ:1;
  uint32_t PCLEQIEN:1;
  uint32_t PCLEQIRQ:1;
  uint32_t PCHEQIEN:1;
  uint32_t PCHEQIRQ:1;
} __QEI3STATbits_t;
extern volatile __QEI3STATbits_t QEI3STATbits __asm__ ("QEI3STAT") __attribute__((section("sfrs"), address(0xBF82B620)));
extern volatile uint32_t        QEI3STATCLR __attribute__((section("sfrs"),address(0xBF82B624)));
extern volatile uint32_t        QEI3STATSET __attribute__((section("sfrs"),address(0xBF82B628)));
extern volatile uint32_t        QEI3STATINV __attribute__((section("sfrs"),address(0xBF82B62C)));
#define POS3CNT POS3CNT
extern volatile uint32_t   POS3CNT __attribute__((section("sfrs"), address(0xBF82B630)));
typedef struct {
  uint32_t POSCNT:32;
} __POS3CNTbits_t;
extern volatile __POS3CNTbits_t POS3CNTbits __asm__ ("POS3CNT") __attribute__((section("sfrs"), address(0xBF82B630)));
extern volatile uint32_t        POS3CNTCLR __attribute__((section("sfrs"),address(0xBF82B634)));
extern volatile uint32_t        POS3CNTSET __attribute__((section("sfrs"),address(0xBF82B638)));
extern volatile uint32_t        POS3CNTINV __attribute__((section("sfrs"),address(0xBF82B63C)));
#define POS3HLD POS3HLD
extern volatile uint32_t   POS3HLD __attribute__((section("sfrs"), address(0xBF82B640)));
typedef struct {
  uint32_t POSHLD:32;
} __POS3HLDbits_t;
extern volatile __POS3HLDbits_t POS3HLDbits __asm__ ("POS3HLD") __attribute__((section("sfrs"), address(0xBF82B640)));
extern volatile uint32_t        POS3HLDCLR __attribute__((section("sfrs"),address(0xBF82B644)));
extern volatile uint32_t        POS3HLDSET __attribute__((section("sfrs"),address(0xBF82B648)));
extern volatile uint32_t        POS3HLDINV __attribute__((section("sfrs"),address(0xBF82B64C)));
#define VEL3CNT VEL3CNT
extern volatile uint32_t   VEL3CNT __attribute__((section("sfrs"), address(0xBF82B650)));
typedef struct {
  uint32_t VELCNT:32;
} __VEL3CNTbits_t;
extern volatile __VEL3CNTbits_t VEL3CNTbits __asm__ ("VEL3CNT") __attribute__((section("sfrs"), address(0xBF82B650)));
extern volatile uint32_t        VEL3CNTCLR __attribute__((section("sfrs"),address(0xBF82B654)));
extern volatile uint32_t        VEL3CNTSET __attribute__((section("sfrs"),address(0xBF82B658)));
extern volatile uint32_t        VEL3CNTINV __attribute__((section("sfrs"),address(0xBF82B65C)));
#define VEL3HLD VEL3HLD
extern volatile uint32_t   VEL3HLD __attribute__((section("sfrs"), address(0xBF82B660)));
typedef struct {
  uint32_t VELHLD:32;
} __VEL3HLDbits_t;
extern volatile __VEL3HLDbits_t VEL3HLDbits __asm__ ("VEL3HLD") __attribute__((section("sfrs"), address(0xBF82B660)));
extern volatile uint32_t        VEL3HLDCLR __attribute__((section("sfrs"),address(0xBF82B664)));
extern volatile uint32_t        VEL3HLDSET __attribute__((section("sfrs"),address(0xBF82B668)));
extern volatile uint32_t        VEL3HLDINV __attribute__((section("sfrs"),address(0xBF82B66C)));
#define INT3TMR INT3TMR
extern volatile uint32_t   INT3TMR __attribute__((section("sfrs"), address(0xBF82B670)));
typedef struct {
  uint32_t INTTMR:32;
} __INT3TMRbits_t;
extern volatile __INT3TMRbits_t INT3TMRbits __asm__ ("INT3TMR") __attribute__((section("sfrs"), address(0xBF82B670)));
extern volatile uint32_t        INT3TMRCLR __attribute__((section("sfrs"),address(0xBF82B674)));
extern volatile uint32_t        INT3TMRSET __attribute__((section("sfrs"),address(0xBF82B678)));
extern volatile uint32_t        INT3TMRINV __attribute__((section("sfrs"),address(0xBF82B67C)));
#define INT3HLD INT3HLD
extern volatile uint32_t   INT3HLD __attribute__((section("sfrs"), address(0xBF82B680)));
typedef struct {
  uint32_t INTHLD:32;
} __INT3HLDbits_t;
extern volatile __INT3HLDbits_t INT3HLDbits __asm__ ("INT3HLD") __attribute__((section("sfrs"), address(0xBF82B680)));
extern volatile uint32_t        INT3HLDCLR __attribute__((section("sfrs"),address(0xBF82B684)));
extern volatile uint32_t        INT3HLDSET __attribute__((section("sfrs"),address(0xBF82B688)));
extern volatile uint32_t        INT3HLDINV __attribute__((section("sfrs"),address(0xBF82B68C)));
#define INDX3CNT INDX3CNT
extern volatile uint32_t   INDX3CNT __attribute__((section("sfrs"), address(0xBF82B690)));
typedef struct {
  uint32_t INDXCNT:32;
} __INDX3CNTbits_t;
extern volatile __INDX3CNTbits_t INDX3CNTbits __asm__ ("INDX3CNT") __attribute__((section("sfrs"), address(0xBF82B690)));
extern volatile uint32_t        INDX3CNTCLR __attribute__((section("sfrs"),address(0xBF82B694)));
extern volatile uint32_t        INDX3CNTSET __attribute__((section("sfrs"),address(0xBF82B698)));
extern volatile uint32_t        INDX3CNTINV __attribute__((section("sfrs"),address(0xBF82B69C)));
#define INDX3HLD INDX3HLD
extern volatile uint32_t   INDX3HLD __attribute__((section("sfrs"), address(0xBF82B6A0)));
typedef struct {
  uint32_t INDXHLD:32;
} __INDX3HLDbits_t;
extern volatile __INDX3HLDbits_t INDX3HLDbits __asm__ ("INDX3HLD") __attribute__((section("sfrs"), address(0xBF82B6A0)));
extern volatile uint32_t        INDX3HLDCLR __attribute__((section("sfrs"),address(0xBF82B6A4)));
extern volatile uint32_t        INDX3HLDSET __attribute__((section("sfrs"),address(0xBF82B6A8)));
extern volatile uint32_t        INDX3HLDINV __attribute__((section("sfrs"),address(0xBF82B6AC)));
#define QEI3ICC QEI3ICC
extern volatile uint32_t   QEI3ICC __attribute__((section("sfrs"), address(0xBF82B6B0)));
typedef struct {
  uint32_t QEIICC:32;
} __QEI3ICCbits_t;
