Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __PMAENbits_t PMAENbits __asm__ ("PMAEN") __attribute__((section("sfrs"), address(0xBF82E050)));
extern volatile uint32_t        PMAENCLR __attribute__((section("sfrs"),address(0xBF82E054)));
extern volatile uint32_t        PMAENSET __attribute__((section("sfrs"),address(0xBF82E058)));
extern volatile uint32_t        PMAENINV __attribute__((section("sfrs"),address(0xBF82E05C)));
#define PMSTAT PMSTAT
extern volatile uint32_t   PMSTAT __attribute__((section("sfrs"), address(0xBF82E060)));
typedef union {
  struct {
    uint32_t OB0E:1;
    uint32_t OB1E:1;
    uint32_t OB2E:1;
    uint32_t OB3E:1;
    uint32_t :2;
    uint32_t OBUF:1;
    uint32_t OBE:1;
    uint32_t IB0F:1;
    uint32_t IB1F:1;
    uint32_t IB2F:1;
    uint32_t IB3F:1;
    uint32_t :2;
    uint32_t IBOV:1;
    uint32_t IBF:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMSTATbits_t;
extern volatile __PMSTATbits_t PMSTATbits __asm__ ("PMSTAT") __attribute__((section("sfrs"), address(0xBF82E060)));
extern volatile uint32_t        PMSTATCLR __attribute__((section("sfrs"),address(0xBF82E064)));
extern volatile uint32_t        PMSTATSET __attribute__((section("sfrs"),address(0xBF82E068)));
extern volatile uint32_t        PMSTATINV __attribute__((section("sfrs"),address(0xBF82E06C)));
#define PMWADDR PMWADDR
extern volatile uint32_t   PMWADDR __attribute__((section("sfrs"), address(0xBF82E070)));
typedef union {
  struct {
    uint32_t WADDR:24;
  };
  struct {
    uint32_t :14;
    uint32_t WCS:2;
    uint32_t :6;
    uint32_t WCSA:2;
  };
  struct {
    uint32_t :14;
    uint32_t WCS1:1;
    uint32_t WCS2:1;
    uint32_t :6;
    uint32_t WCS1A:1;
    uint32_t WCS2A:1;
  };
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t :14;
    uint32_t WADDR14:1;
    uint32_t WADDR15:1;
    uint32_t :6;
    uint32_t WADDR22:1;
    uint32_t WADDR23:1;
  };
} __PMWADDRbits_t;
extern volatile __PMWADDRbits_t PMWADDRbits __asm__ ("PMWADDR") __attribute__((section("sfrs"), address(0xBF82E070)));
extern volatile uint32_t        PMWADDRCLR __attribute__((section("sfrs"),address(0xBF82E074)));
extern volatile uint32_t        PMWADDRSET __attribute__((section("sfrs"),address(0xBF82E078)));
extern volatile uint32_t        PMWADDRINV __attribute__((section("sfrs"),address(0xBF82E07C)));
#define PMRADDR PMRADDR
extern volatile uint32_t   PMRADDR __attribute__((section("sfrs"), address(0xBF82E080)));
typedef union {
  struct {
    uint32_t RADDR:14;
    uint32_t RADDR14:1;
    uint32_t RADDR15:1;
  };
  struct {
    uint32_t :14;
    uint32_t RCS:2;
  };
  struct {
    uint32_t :14;
    uint32_t RCS1:1;
    uint32_t RCS2:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMRADDRbits_t;
extern volatile __PMRADDRbits_t PMRADDRbits __asm__ ("PMRADDR") __attribute__((section("sfrs"), address(0xBF82E080)));
extern volatile uint32_t        PMRADDRCLR __attribute__((section("sfrs"),address(0xBF82E084)));
extern volatile uint32_t        PMRADDRSET __attribute__((section("sfrs"),address(0xBF82E088)));
extern volatile uint32_t        PMRADDRINV __attribute__((section("sfrs"),address(0xBF82E08C)));
#define PMRDIN PMRDIN
extern volatile uint32_t   PMRDIN __attribute__((section("sfrs"), address(0xBF82E090)));
typedef union {
  struct {
    uint32_t RDATAIN:32;
  };
  struct {
    uint32_t w:32;
  };
} __PMRDINbits_t;
extern volatile __PMRDINbits_t PMRDINbits __asm__ ("PMRDIN") __attribute__((section("sfrs"), address(0xBF82E090)));
extern volatile uint32_t        PMRDINCLR __attribute__((section("sfrs"),address(0xBF82E094)));
extern volatile uint32_t        PMRDINSET __attribute__((section("sfrs"),address(0xBF82E098)));
extern volatile uint32_t        PMRDININV __attribute__((section("sfrs"),address(0xBF82E09C)));
#define IC10CON IC10CON
extern volatile uint32_t   IC10CON __attribute__((section("sfrs"), address(0xBF843200)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC10CONbits_t;
extern volatile __IC10CONbits_t IC10CONbits __asm__ ("IC10CON") __attribute__((section("sfrs"), address(0xBF843200)));
extern volatile uint32_t        IC10CONCLR __attribute__((section("sfrs"),address(0xBF843204)));
extern volatile uint32_t        IC10CONSET __attribute__((section("sfrs"),address(0xBF843208)));
extern volatile uint32_t        IC10CONINV __attribute__((section("sfrs"),address(0xBF84320C)));
#define IC10BUF IC10BUF
extern volatile uint32_t   IC10BUF __attribute__((section("sfrs"), address(0xBF843210)));
#define IC11CON IC11CON
extern volatile uint32_t   IC11CON __attribute__((section("sfrs"), address(0xBF843400)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC11CONbits_t;
extern volatile __IC11CONbits_t IC11CONbits __asm__ ("IC11CON") __attribute__((section("sfrs"), address(0xBF843400)));
extern volatile uint32_t        IC11CONCLR __attribute__((section("sfrs"),address(0xBF843404)));
extern volatile uint32_t        IC11CONSET __attribute__((section("sfrs"),address(0xBF843408)));
extern volatile uint32_t        IC11CONINV __attribute__((section("sfrs"),address(0xBF84340C)));
#define IC11BUF IC11BUF
extern volatile uint32_t   IC11BUF __attribute__((section("sfrs"), address(0xBF843410)));
#define IC12CON IC12CON
extern volatile uint32_t   IC12CON __attribute__((section("sfrs"), address(0xBF843600)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC12CONbits_t;
extern volatile __IC12CONbits_t IC12CONbits __asm__ ("IC12CON") __attribute__((section("sfrs"), address(0xBF843600)));
extern volatile uint32_t        IC12CONCLR __attribute__((section("sfrs"),address(0xBF843604)));
extern volatile uint32_t        IC12CONSET __attribute__((section("sfrs"),address(0xBF843608)));
extern volatile uint32_t        IC12CONINV __attribute__((section("sfrs"),address(0xBF84360C)));
#define IC12BUF IC12BUF
extern volatile uint32_t   IC12BUF __attribute__((section("sfrs"), address(0xBF843610)));
#define IC13CON IC13CON
extern volatile uint32_t   IC13CON __attribute__((section("sfrs"), address(0xBF843800)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC13CONbits_t;
extern volatile __IC13CONbits_t IC13CONbits __asm__ ("IC13CON") __attribute__((section("sfrs"), address(0xBF843800)));
extern volatile uint32_t        IC13CONCLR __attribute__((section("sfrs"),address(0xBF843804)));
extern volatile uint32_t        IC13CONSET __attribute__((section("sfrs"),address(0xBF843808)));
extern volatile uint32_t        IC13CONINV __attribute__((section("sfrs"),address(0xBF84380C)));
#define IC13BUF IC13BUF
extern volatile uint32_t   IC13BUF __attribute__((section("sfrs"), address(0xBF843810)));
#define IC14CON IC14CON
extern volatile uint32_t   IC14CON __attribute__((section("sfrs"), address(0xBF843A00)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC14CONbits_t;
extern volatile __IC14CONbits_t IC14CONbits __asm__ ("IC14CON") __attribute__((section("sfrs"), address(0xBF843A00)));
extern volatile uint32_t        IC14CONCLR __attribute__((section("sfrs"),address(0xBF843A04)));
extern volatile uint32_t        IC14CONSET __attribute__((section("sfrs"),address(0xBF843A08)));
extern volatile uint32_t        IC14CONINV __attribute__((section("sfrs"),address(0xBF843A0C)));
#define IC14BUF IC14BUF
extern volatile uint32_t   IC14BUF __attribute__((section("sfrs"), address(0xBF843A10)));
#define IC15CON IC15CON
extern volatile uint32_t   IC15CON __attribute__((section("sfrs"), address(0xBF843C00)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC15CONbits_t;
extern volatile __IC15CONbits_t IC15CONbits __asm__ ("IC15CON") __attribute__((section("sfrs"), address(0xBF843C00)));
extern volatile uint32_t        IC15CONCLR __attribute__((section("sfrs"),address(0xBF843C04)));
extern volatile uint32_t        IC15CONSET __attribute__((section("sfrs"),address(0xBF843C08)));
extern volatile uint32_t        IC15CONINV __attribute__((section("sfrs"),address(0xBF843C0C)));
#define IC15BUF IC15BUF
extern volatile uint32_t   IC15BUF __attribute__((section("sfrs"), address(0xBF843C10)));
#define IC16CON IC16CON
extern volatile uint32_t   IC16CON __attribute__((section("sfrs"), address(0xBF843E00)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC16CONbits_t;
