Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __C4RXM1bits_t C4RXM1bits __asm__ ("C4RXM1") __attribute__((section("sfrs"), address(0xBF885090)));
extern volatile uint32_t        C4RXM1CLR __attribute__((section("sfrs"),address(0xBF885094)));
extern volatile uint32_t        C4RXM1SET __attribute__((section("sfrs"),address(0xBF885098)));
extern volatile uint32_t        C4RXM1INV __attribute__((section("sfrs"),address(0xBF88509C)));
#define C4RXM2 C4RXM2
extern volatile uint32_t   C4RXM2 __attribute__((section("sfrs"), address(0xBF8850A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXM2bits_t;
extern volatile __C4RXM2bits_t C4RXM2bits __asm__ ("C4RXM2") __attribute__((section("sfrs"), address(0xBF8850A0)));
extern volatile uint32_t        C4RXM2CLR __attribute__((section("sfrs"),address(0xBF8850A4)));
extern volatile uint32_t        C4RXM2SET __attribute__((section("sfrs"),address(0xBF8850A8)));
extern volatile uint32_t        C4RXM2INV __attribute__((section("sfrs"),address(0xBF8850AC)));
#define C4RXM3 C4RXM3
extern volatile uint32_t   C4RXM3 __attribute__((section("sfrs"), address(0xBF8850B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXM3bits_t;
extern volatile __C4RXM3bits_t C4RXM3bits __asm__ ("C4RXM3") __attribute__((section("sfrs"), address(0xBF8850B0)));
extern volatile uint32_t        C4RXM3CLR __attribute__((section("sfrs"),address(0xBF8850B4)));
extern volatile uint32_t        C4RXM3SET __attribute__((section("sfrs"),address(0xBF8850B8)));
extern volatile uint32_t        C4RXM3INV __attribute__((section("sfrs"),address(0xBF8850BC)));
#define C4FLTCON0 C4FLTCON0
extern volatile uint32_t   C4FLTCON0 __attribute__((section("sfrs"), address(0xBF8850C0)));
typedef union {
  struct {
    uint32_t FSEL0:5;
    uint32_t MSEL0:2;
    uint32_t FLTEN0:1;
    uint32_t FSEL1:5;
    uint32_t MSEL1:2;
    uint32_t FLTEN1:1;
    uint32_t FSEL2:5;
    uint32_t MSEL2:2;
    uint32_t FLTEN2:1;
    uint32_t FSEL3:5;
    uint32_t MSEL3:2;
    uint32_t FLTEN3:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FLTCON0bits_t;
extern volatile __C4FLTCON0bits_t C4FLTCON0bits __asm__ ("C4FLTCON0") __attribute__((section("sfrs"), address(0xBF8850C0)));
extern volatile uint32_t        C4FLTCON0CLR __attribute__((section("sfrs"),address(0xBF8850C4)));
extern volatile uint32_t        C4FLTCON0SET __attribute__((section("sfrs"),address(0xBF8850C8)));
extern volatile uint32_t        C4FLTCON0INV __attribute__((section("sfrs"),address(0xBF8850CC)));
#define C4FLTCON1 C4FLTCON1
extern volatile uint32_t   C4FLTCON1 __attribute__((section("sfrs"), address(0xBF8850D0)));
typedef union {
  struct {
    uint32_t FSEL4:5;
    uint32_t MSEL4:2;
    uint32_t FLTEN4:1;
    uint32_t FSEL5:5;
    uint32_t MSEL5:2;
    uint32_t FLTEN5:1;
    uint32_t FSEL6:5;
    uint32_t MSEL6:2;
    uint32_t FLTEN6:1;
    uint32_t FSEL7:5;
    uint32_t MSEL7:2;
    uint32_t FLTEN7:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FLTCON1bits_t;
extern volatile __C4FLTCON1bits_t C4FLTCON1bits __asm__ ("C4FLTCON1") __attribute__((section("sfrs"), address(0xBF8850D0)));
extern volatile uint32_t        C4FLTCON1CLR __attribute__((section("sfrs"),address(0xBF8850D4)));
extern volatile uint32_t        C4FLTCON1SET __attribute__((section("sfrs"),address(0xBF8850D8)));
extern volatile uint32_t        C4FLTCON1INV __attribute__((section("sfrs"),address(0xBF8850DC)));
#define C4FLTCON2 C4FLTCON2
extern volatile uint32_t   C4FLTCON2 __attribute__((section("sfrs"), address(0xBF8850E0)));
typedef union {
  struct {
    uint32_t FSEL8:5;
    uint32_t MSEL8:2;
    uint32_t FLTEN8:1;
    uint32_t FSEL9:5;
    uint32_t MSEL9:2;
    uint32_t FLTEN9:1;
    uint32_t FSEL10:5;
    uint32_t MSEL10:2;
    uint32_t FLTEN10:1;
    uint32_t FSEL11:5;
    uint32_t MSEL11:2;
    uint32_t FLTEN11:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FLTCON2bits_t;
extern volatile __C4FLTCON2bits_t C4FLTCON2bits __asm__ ("C4FLTCON2") __attribute__((section("sfrs"), address(0xBF8850E0)));
extern volatile uint32_t        C4FLTCON2CLR __attribute__((section("sfrs"),address(0xBF8850E4)));
extern volatile uint32_t        C4FLTCON2SET __attribute__((section("sfrs"),address(0xBF8850E8)));
extern volatile uint32_t        C4FLTCON2INV __attribute__((section("sfrs"),address(0xBF8850EC)));
#define C4FLTCON3 C4FLTCON3
extern volatile uint32_t   C4FLTCON3 __attribute__((section("sfrs"), address(0xBF8850F0)));
typedef union {
  struct {
    uint32_t FSEL12:5;
    uint32_t MSEL12:2;
    uint32_t FLTEN12:1;
    uint32_t FSEL13:5;
    uint32_t MSEL13:2;
    uint32_t FLTEN13:1;
    uint32_t FSEL14:5;
    uint32_t MSEL14:2;
    uint32_t FLTEN14:1;
    uint32_t FSEL15:5;
    uint32_t MSEL15:2;
    uint32_t FLTEN15:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FLTCON3bits_t;
extern volatile __C4FLTCON3bits_t C4FLTCON3bits __asm__ ("C4FLTCON3") __attribute__((section("sfrs"), address(0xBF8850F0)));
extern volatile uint32_t        C4FLTCON3CLR __attribute__((section("sfrs"),address(0xBF8850F4)));
extern volatile uint32_t        C4FLTCON3SET __attribute__((section("sfrs"),address(0xBF8850F8)));
extern volatile uint32_t        C4FLTCON3INV __attribute__((section("sfrs"),address(0xBF8850FC)));
#define C4RXF0 C4RXF0
extern volatile uint32_t   C4RXF0 __attribute__((section("sfrs"), address(0xBF885140)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF0bits_t;
extern volatile __C4RXF0bits_t C4RXF0bits __asm__ ("C4RXF0") __attribute__((section("sfrs"), address(0xBF885140)));
extern volatile uint32_t        C4RXF0CLR __attribute__((section("sfrs"),address(0xBF885144)));
extern volatile uint32_t        C4RXF0SET __attribute__((section("sfrs"),address(0xBF885148)));
extern volatile uint32_t        C4RXF0INV __attribute__((section("sfrs"),address(0xBF88514C)));
#define C4RXF1 C4RXF1
extern volatile uint32_t   C4RXF1 __attribute__((section("sfrs"), address(0xBF885150)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF1bits_t;
extern volatile __C4RXF1bits_t C4RXF1bits __asm__ ("C4RXF1") __attribute__((section("sfrs"), address(0xBF885150)));
extern volatile uint32_t        C4RXF1CLR __attribute__((section("sfrs"),address(0xBF885154)));
extern volatile uint32_t        C4RXF1SET __attribute__((section("sfrs"),address(0xBF885158)));
extern volatile uint32_t        C4RXF1INV __attribute__((section("sfrs"),address(0xBF88515C)));
#define C4RXF2 C4RXF2
extern volatile uint32_t   C4RXF2 __attribute__((section("sfrs"), address(0xBF885160)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF2bits_t;
extern volatile __C4RXF2bits_t C4RXF2bits __asm__ ("C4RXF2") __attribute__((section("sfrs"), address(0xBF885160)));
extern volatile uint32_t        C4RXF2CLR __attribute__((section("sfrs"),address(0xBF885164)));
extern volatile uint32_t        C4RXF2SET __attribute__((section("sfrs"),address(0xBF885168)));
extern volatile uint32_t        C4RXF2INV __attribute__((section("sfrs"),address(0xBF88516C)));
#define C4RXF3 C4RXF3
extern volatile uint32_t   C4RXF3 __attribute__((section("sfrs"), address(0xBF885170)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF3bits_t;
