Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __C4RXF3bits_t C4RXF3bits __asm__ ("C4RXF3") __attribute__((section("sfrs"), address(0xBF885170)));
extern volatile uint32_t        C4RXF3CLR __attribute__((section("sfrs"),address(0xBF885174)));
extern volatile uint32_t        C4RXF3SET __attribute__((section("sfrs"),address(0xBF885178)));
extern volatile uint32_t        C4RXF3INV __attribute__((section("sfrs"),address(0xBF88517C)));
#define C4RXF4 C4RXF4
extern volatile uint32_t   C4RXF4 __attribute__((section("sfrs"), address(0xBF885180)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF4bits_t;
extern volatile __C4RXF4bits_t C4RXF4bits __asm__ ("C4RXF4") __attribute__((section("sfrs"), address(0xBF885180)));
extern volatile uint32_t        C4RXF4CLR __attribute__((section("sfrs"),address(0xBF885184)));
extern volatile uint32_t        C4RXF4SET __attribute__((section("sfrs"),address(0xBF885188)));
extern volatile uint32_t        C4RXF4INV __attribute__((section("sfrs"),address(0xBF88518C)));
#define C4RXF5 C4RXF5
extern volatile uint32_t   C4RXF5 __attribute__((section("sfrs"), address(0xBF885190)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF5bits_t;
extern volatile __C4RXF5bits_t C4RXF5bits __asm__ ("C4RXF5") __attribute__((section("sfrs"), address(0xBF885190)));
extern volatile uint32_t        C4RXF5CLR __attribute__((section("sfrs"),address(0xBF885194)));
extern volatile uint32_t        C4RXF5SET __attribute__((section("sfrs"),address(0xBF885198)));
extern volatile uint32_t        C4RXF5INV __attribute__((section("sfrs"),address(0xBF88519C)));
#define C4RXF6 C4RXF6
extern volatile uint32_t   C4RXF6 __attribute__((section("sfrs"), address(0xBF8851A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF6bits_t;
extern volatile __C4RXF6bits_t C4RXF6bits __asm__ ("C4RXF6") __attribute__((section("sfrs"), address(0xBF8851A0)));
extern volatile uint32_t        C4RXF6CLR __attribute__((section("sfrs"),address(0xBF8851A4)));
extern volatile uint32_t        C4RXF6SET __attribute__((section("sfrs"),address(0xBF8851A8)));
extern volatile uint32_t        C4RXF6INV __attribute__((section("sfrs"),address(0xBF8851AC)));
#define C4RXF7 C4RXF7
extern volatile uint32_t   C4RXF7 __attribute__((section("sfrs"), address(0xBF8851B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF7bits_t;
extern volatile __C4RXF7bits_t C4RXF7bits __asm__ ("C4RXF7") __attribute__((section("sfrs"), address(0xBF8851B0)));
extern volatile uint32_t        C4RXF7CLR __attribute__((section("sfrs"),address(0xBF8851B4)));
extern volatile uint32_t        C4RXF7SET __attribute__((section("sfrs"),address(0xBF8851B8)));
extern volatile uint32_t        C4RXF7INV __attribute__((section("sfrs"),address(0xBF8851BC)));
#define C4RXF8 C4RXF8
extern volatile uint32_t   C4RXF8 __attribute__((section("sfrs"), address(0xBF8851C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF8bits_t;
extern volatile __C4RXF8bits_t C4RXF8bits __asm__ ("C4RXF8") __attribute__((section("sfrs"), address(0xBF8851C0)));
extern volatile uint32_t        C4RXF8CLR __attribute__((section("sfrs"),address(0xBF8851C4)));
extern volatile uint32_t        C4RXF8SET __attribute__((section("sfrs"),address(0xBF8851C8)));
extern volatile uint32_t        C4RXF8INV __attribute__((section("sfrs"),address(0xBF8851CC)));
#define C4RXF9 C4RXF9
extern volatile uint32_t   C4RXF9 __attribute__((section("sfrs"), address(0xBF8851D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF9bits_t;
extern volatile __C4RXF9bits_t C4RXF9bits __asm__ ("C4RXF9") __attribute__((section("sfrs"), address(0xBF8851D0)));
extern volatile uint32_t        C4RXF9CLR __attribute__((section("sfrs"),address(0xBF8851D4)));
extern volatile uint32_t        C4RXF9SET __attribute__((section("sfrs"),address(0xBF8851D8)));
extern volatile uint32_t        C4RXF9INV __attribute__((section("sfrs"),address(0xBF8851DC)));
#define C4RXF10 C4RXF10
extern volatile uint32_t   C4RXF10 __attribute__((section("sfrs"), address(0xBF8851E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF10bits_t;
extern volatile __C4RXF10bits_t C4RXF10bits __asm__ ("C4RXF10") __attribute__((section("sfrs"), address(0xBF8851E0)));
extern volatile uint32_t        C4RXF10CLR __attribute__((section("sfrs"),address(0xBF8851E4)));
extern volatile uint32_t        C4RXF10SET __attribute__((section("sfrs"),address(0xBF8851E8)));
extern volatile uint32_t        C4RXF10INV __attribute__((section("sfrs"),address(0xBF8851EC)));
#define C4RXF11 C4RXF11
extern volatile uint32_t   C4RXF11 __attribute__((section("sfrs"), address(0xBF8851F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF11bits_t;
extern volatile __C4RXF11bits_t C4RXF11bits __asm__ ("C4RXF11") __attribute__((section("sfrs"), address(0xBF8851F0)));
extern volatile uint32_t        C4RXF11CLR __attribute__((section("sfrs"),address(0xBF8851F4)));
extern volatile uint32_t        C4RXF11SET __attribute__((section("sfrs"),address(0xBF8851F8)));
extern volatile uint32_t        C4RXF11INV __attribute__((section("sfrs"),address(0xBF8851FC)));
#define C4RXF12 C4RXF12
extern volatile uint32_t   C4RXF12 __attribute__((section("sfrs"), address(0xBF885200)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF12bits_t;
extern volatile __C4RXF12bits_t C4RXF12bits __asm__ ("C4RXF12") __attribute__((section("sfrs"), address(0xBF885200)));
extern volatile uint32_t        C4RXF12CLR __attribute__((section("sfrs"),address(0xBF885204)));
extern volatile uint32_t        C4RXF12SET __attribute__((section("sfrs"),address(0xBF885208)));
extern volatile uint32_t        C4RXF12INV __attribute__((section("sfrs"),address(0xBF88520C)));
#define C4RXF13 C4RXF13
extern volatile uint32_t   C4RXF13 __attribute__((section("sfrs"), address(0xBF885210)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF13bits_t;
extern volatile __C4RXF13bits_t C4RXF13bits __asm__ ("C4RXF13") __attribute__((section("sfrs"), address(0xBF885210)));
extern volatile uint32_t        C4RXF13CLR __attribute__((section("sfrs"),address(0xBF885214)));
extern volatile uint32_t        C4RXF13SET __attribute__((section("sfrs"),address(0xBF885218)));
extern volatile uint32_t        C4RXF13INV __attribute__((section("sfrs"),address(0xBF88521C)));
#define C4RXF14 C4RXF14
extern volatile uint32_t   C4RXF14 __attribute__((section("sfrs"), address(0xBF885220)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF14bits_t;
