Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __C4FIFOCI3bits_t C4FIFOCI3bits __asm__ ("C4FIFOCI3") __attribute__((section("sfrs"), address(0xBF885440)));
extern volatile uint32_t        C4FIFOCI3CLR __attribute__((section("sfrs"),address(0xBF885444)));
extern volatile uint32_t        C4FIFOCI3SET __attribute__((section("sfrs"),address(0xBF885448)));
extern volatile uint32_t        C4FIFOCI3INV __attribute__((section("sfrs"),address(0xBF88544C)));
#define C4FIFOCON4 C4FIFOCON4
extern volatile uint32_t   C4FIFOCON4 __attribute__((section("sfrs"), address(0xBF885450)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON4bits_t;
extern volatile __C4FIFOCON4bits_t C4FIFOCON4bits __asm__ ("C4FIFOCON4") __attribute__((section("sfrs"), address(0xBF885450)));
extern volatile uint32_t        C4FIFOCON4CLR __attribute__((section("sfrs"),address(0xBF885454)));
extern volatile uint32_t        C4FIFOCON4SET __attribute__((section("sfrs"),address(0xBF885458)));
extern volatile uint32_t        C4FIFOCON4INV __attribute__((section("sfrs"),address(0xBF88545C)));
#define C4FIFOINT4 C4FIFOINT4
extern volatile uint32_t   C4FIFOINT4 __attribute__((section("sfrs"), address(0xBF885460)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT4bits_t;
extern volatile __C4FIFOINT4bits_t C4FIFOINT4bits __asm__ ("C4FIFOINT4") __attribute__((section("sfrs"), address(0xBF885460)));
extern volatile uint32_t        C4FIFOINT4CLR __attribute__((section("sfrs"),address(0xBF885464)));
extern volatile uint32_t        C4FIFOINT4SET __attribute__((section("sfrs"),address(0xBF885468)));
extern volatile uint32_t        C4FIFOINT4INV __attribute__((section("sfrs"),address(0xBF88546C)));
#define C4FIFOUA4 C4FIFOUA4
extern volatile uint32_t   C4FIFOUA4 __attribute__((section("sfrs"), address(0xBF885470)));
extern volatile uint32_t        C4FIFOUA4CLR __attribute__((section("sfrs"),address(0xBF885474)));
extern volatile uint32_t        C4FIFOUA4SET __attribute__((section("sfrs"),address(0xBF885478)));
extern volatile uint32_t        C4FIFOUA4INV __attribute__((section("sfrs"),address(0xBF88547C)));
#define C4FIFOCI4 C4FIFOCI4
extern volatile uint32_t   C4FIFOCI4 __attribute__((section("sfrs"), address(0xBF885480)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI4bits_t;
extern volatile __C4FIFOCI4bits_t C4FIFOCI4bits __asm__ ("C4FIFOCI4") __attribute__((section("sfrs"), address(0xBF885480)));
extern volatile uint32_t        C4FIFOCI4CLR __attribute__((section("sfrs"),address(0xBF885484)));
extern volatile uint32_t        C4FIFOCI4SET __attribute__((section("sfrs"),address(0xBF885488)));
extern volatile uint32_t        C4FIFOCI4INV __attribute__((section("sfrs"),address(0xBF88548C)));
#define C4FIFOCON5 C4FIFOCON5
extern volatile uint32_t   C4FIFOCON5 __attribute__((section("sfrs"), address(0xBF885490)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON5bits_t;
extern volatile __C4FIFOCON5bits_t C4FIFOCON5bits __asm__ ("C4FIFOCON5") __attribute__((section("sfrs"), address(0xBF885490)));
extern volatile uint32_t        C4FIFOCON5CLR __attribute__((section("sfrs"),address(0xBF885494)));
extern volatile uint32_t        C4FIFOCON5SET __attribute__((section("sfrs"),address(0xBF885498)));
extern volatile uint32_t        C4FIFOCON5INV __attribute__((section("sfrs"),address(0xBF88549C)));
#define C4FIFOINT5 C4FIFOINT5
extern volatile uint32_t   C4FIFOINT5 __attribute__((section("sfrs"), address(0xBF8854A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT5bits_t;
extern volatile __C4FIFOINT5bits_t C4FIFOINT5bits __asm__ ("C4FIFOINT5") __attribute__((section("sfrs"), address(0xBF8854A0)));
extern volatile uint32_t        C4FIFOINT5CLR __attribute__((section("sfrs"),address(0xBF8854A4)));
extern volatile uint32_t        C4FIFOINT5SET __attribute__((section("sfrs"),address(0xBF8854A8)));
extern volatile uint32_t        C4FIFOINT5INV __attribute__((section("sfrs"),address(0xBF8854AC)));
#define C4FIFOUA5 C4FIFOUA5
extern volatile uint32_t   C4FIFOUA5 __attribute__((section("sfrs"), address(0xBF8854B0)));
extern volatile uint32_t        C4FIFOUA5CLR __attribute__((section("sfrs"),address(0xBF8854B4)));
extern volatile uint32_t        C4FIFOUA5SET __attribute__((section("sfrs"),address(0xBF8854B8)));
extern volatile uint32_t        C4FIFOUA5INV __attribute__((section("sfrs"),address(0xBF8854BC)));
#define C4FIFOCI5 C4FIFOCI5
extern volatile uint32_t   C4FIFOCI5 __attribute__((section("sfrs"), address(0xBF8854C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI5bits_t;
