Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __C4FIFOCON8bits_t C4FIFOCON8bits __asm__ ("C4FIFOCON8") __attribute__((section("sfrs"), address(0xBF885550)));
extern volatile uint32_t        C4FIFOCON8CLR __attribute__((section("sfrs"),address(0xBF885554)));
extern volatile uint32_t        C4FIFOCON8SET __attribute__((section("sfrs"),address(0xBF885558)));
extern volatile uint32_t        C4FIFOCON8INV __attribute__((section("sfrs"),address(0xBF88555C)));
#define C4FIFOINT8 C4FIFOINT8
extern volatile uint32_t   C4FIFOINT8 __attribute__((section("sfrs"), address(0xBF885560)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT8bits_t;
extern volatile __C4FIFOINT8bits_t C4FIFOINT8bits __asm__ ("C4FIFOINT8") __attribute__((section("sfrs"), address(0xBF885560)));
extern volatile uint32_t        C4FIFOINT8CLR __attribute__((section("sfrs"),address(0xBF885564)));
extern volatile uint32_t        C4FIFOINT8SET __attribute__((section("sfrs"),address(0xBF885568)));
extern volatile uint32_t        C4FIFOINT8INV __attribute__((section("sfrs"),address(0xBF88556C)));
#define C4FIFOUA8 C4FIFOUA8
extern volatile uint32_t   C4FIFOUA8 __attribute__((section("sfrs"), address(0xBF885570)));
extern volatile uint32_t        C4FIFOUA8CLR __attribute__((section("sfrs"),address(0xBF885574)));
extern volatile uint32_t        C4FIFOUA8SET __attribute__((section("sfrs"),address(0xBF885578)));
extern volatile uint32_t        C4FIFOUA8INV __attribute__((section("sfrs"),address(0xBF88557C)));
#define C4FIFOCI8 C4FIFOCI8
extern volatile uint32_t   C4FIFOCI8 __attribute__((section("sfrs"), address(0xBF885580)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI8bits_t;
extern volatile __C4FIFOCI8bits_t C4FIFOCI8bits __asm__ ("C4FIFOCI8") __attribute__((section("sfrs"), address(0xBF885580)));
extern volatile uint32_t        C4FIFOCI8CLR __attribute__((section("sfrs"),address(0xBF885584)));
extern volatile uint32_t        C4FIFOCI8SET __attribute__((section("sfrs"),address(0xBF885588)));
extern volatile uint32_t        C4FIFOCI8INV __attribute__((section("sfrs"),address(0xBF88558C)));
#define C4FIFOCON9 C4FIFOCON9
extern volatile uint32_t   C4FIFOCON9 __attribute__((section("sfrs"), address(0xBF885590)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON9bits_t;
extern volatile __C4FIFOCON9bits_t C4FIFOCON9bits __asm__ ("C4FIFOCON9") __attribute__((section("sfrs"), address(0xBF885590)));
extern volatile uint32_t        C4FIFOCON9CLR __attribute__((section("sfrs"),address(0xBF885594)));
extern volatile uint32_t        C4FIFOCON9SET __attribute__((section("sfrs"),address(0xBF885598)));
extern volatile uint32_t        C4FIFOCON9INV __attribute__((section("sfrs"),address(0xBF88559C)));
#define C4FIFOINT9 C4FIFOINT9
extern volatile uint32_t   C4FIFOINT9 __attribute__((section("sfrs"), address(0xBF8855A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT9bits_t;
extern volatile __C4FIFOINT9bits_t C4FIFOINT9bits __asm__ ("C4FIFOINT9") __attribute__((section("sfrs"), address(0xBF8855A0)));
extern volatile uint32_t        C4FIFOINT9CLR __attribute__((section("sfrs"),address(0xBF8855A4)));
extern volatile uint32_t        C4FIFOINT9SET __attribute__((section("sfrs"),address(0xBF8855A8)));
extern volatile uint32_t        C4FIFOINT9INV __attribute__((section("sfrs"),address(0xBF8855AC)));
#define C4FIFOUA9 C4FIFOUA9
extern volatile uint32_t   C4FIFOUA9 __attribute__((section("sfrs"), address(0xBF8855B0)));
extern volatile uint32_t        C4FIFOUA9CLR __attribute__((section("sfrs"),address(0xBF8855B4)));
extern volatile uint32_t        C4FIFOUA9SET __attribute__((section("sfrs"),address(0xBF8855B8)));
extern volatile uint32_t        C4FIFOUA9INV __attribute__((section("sfrs"),address(0xBF8855BC)));
#define C4FIFOCI9 C4FIFOCI9
extern volatile uint32_t   C4FIFOCI9 __attribute__((section("sfrs"), address(0xBF8855C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI9bits_t;
extern volatile __C4FIFOCI9bits_t C4FIFOCI9bits __asm__ ("C4FIFOCI9") __attribute__((section("sfrs"), address(0xBF8855C0)));
extern volatile uint32_t        C4FIFOCI9CLR __attribute__((section("sfrs"),address(0xBF8855C4)));
extern volatile uint32_t        C4FIFOCI9SET __attribute__((section("sfrs"),address(0xBF8855C8)));
extern volatile uint32_t        C4FIFOCI9INV __attribute__((section("sfrs"),address(0xBF8855CC)));
#define C4FIFOCON10 C4FIFOCON10
extern volatile uint32_t   C4FIFOCON10 __attribute__((section("sfrs"), address(0xBF8855D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON10bits_t;
extern volatile __C4FIFOCON10bits_t C4FIFOCON10bits __asm__ ("C4FIFOCON10") __attribute__((section("sfrs"), address(0xBF8855D0)));
extern volatile uint32_t        C4FIFOCON10CLR __attribute__((section("sfrs"),address(0xBF8855D4)));
extern volatile uint32_t        C4FIFOCON10SET __attribute__((section("sfrs"),address(0xBF8855D8)));
extern volatile uint32_t        C4FIFOCON10INV __attribute__((section("sfrs"),address(0xBF8855DC)));
#define C4FIFOINT10 C4FIFOINT10
extern volatile uint32_t   C4FIFOINT10 __attribute__((section("sfrs"), address(0xBF8855E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT10bits_t;
extern volatile __C4FIFOINT10bits_t C4FIFOINT10bits __asm__ ("C4FIFOINT10") __attribute__((section("sfrs"), address(0xBF8855E0)));
extern volatile uint32_t        C4FIFOINT10CLR __attribute__((section("sfrs"),address(0xBF8855E4)));
extern volatile uint32_t        C4FIFOINT10SET __attribute__((section("sfrs"),address(0xBF8855E8)));
extern volatile uint32_t        C4FIFOINT10INV __attribute__((section("sfrs"),address(0xBF8855EC)));
#define C4FIFOUA10 C4FIFOUA10
extern volatile uint32_t   C4FIFOUA10 __attribute__((section("sfrs"), address(0xBF8855F0)));
extern volatile uint32_t        C4FIFOUA10CLR __attribute__((section("sfrs"),address(0xBF8855F4)));
extern volatile uint32_t        C4FIFOUA10SET __attribute__((section("sfrs"),address(0xBF8855F8)));
extern volatile uint32_t        C4FIFOUA10INV __attribute__((section("sfrs"),address(0xBF8855FC)));
#define C4FIFOCI10 C4FIFOCI10
extern volatile uint32_t   C4FIFOCI10 __attribute__((section("sfrs"), address(0xBF885600)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI10bits_t;
extern volatile __C4FIFOCI10bits_t C4FIFOCI10bits __asm__ ("C4FIFOCI10") __attribute__((section("sfrs"), address(0xBF885600)));
extern volatile uint32_t        C4FIFOCI10CLR __attribute__((section("sfrs"),address(0xBF885604)));
extern volatile uint32_t        C4FIFOCI10SET __attribute__((section("sfrs"),address(0xBF885608)));
extern volatile uint32_t        C4FIFOCI10INV __attribute__((section("sfrs"),address(0xBF88560C)));
#define C4FIFOCON11 C4FIFOCON11
extern volatile uint32_t   C4FIFOCON11 __attribute__((section("sfrs"), address(0xBF885610)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON11bits_t;
extern volatile __C4FIFOCON11bits_t C4FIFOCON11bits __asm__ ("C4FIFOCON11") __attribute__((section("sfrs"), address(0xBF885610)));
extern volatile uint32_t        C4FIFOCON11CLR __attribute__((section("sfrs"),address(0xBF885614)));
extern volatile uint32_t        C4FIFOCON11SET __attribute__((section("sfrs"),address(0xBF885618)));
extern volatile uint32_t        C4FIFOCON11INV __attribute__((section("sfrs"),address(0xBF88561C)));
#define C4FIFOINT11 C4FIFOINT11
extern volatile uint32_t   C4FIFOINT11 __attribute__((section("sfrs"), address(0xBF885620)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT11bits_t;
extern volatile __C4FIFOINT11bits_t C4FIFOINT11bits __asm__ ("C4FIFOINT11") __attribute__((section("sfrs"), address(0xBF885620)));
extern volatile uint32_t        C4FIFOINT11CLR __attribute__((section("sfrs"),address(0xBF885624)));
extern volatile uint32_t        C4FIFOINT11SET __attribute__((section("sfrs"),address(0xBF885628)));
extern volatile uint32_t        C4FIFOINT11INV __attribute__((section("sfrs"),address(0xBF88562C)));
#define C4FIFOUA11 C4FIFOUA11
extern volatile uint32_t   C4FIFOUA11 __attribute__((section("sfrs"), address(0xBF885630)));
extern volatile uint32_t        C4FIFOUA11CLR __attribute__((section("sfrs"),address(0xBF885634)));
extern volatile uint32_t        C4FIFOUA11SET __attribute__((section("sfrs"),address(0xBF885638)));
extern volatile uint32_t        C4FIFOUA11INV __attribute__((section("sfrs"),address(0xBF88563C)));
#define C4FIFOCI11 C4FIFOCI11
extern volatile uint32_t   C4FIFOCI11 __attribute__((section("sfrs"), address(0xBF885640)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI11bits_t;
extern volatile __C4FIFOCI11bits_t C4FIFOCI11bits __asm__ ("C4FIFOCI11") __attribute__((section("sfrs"), address(0xBF885640)));
extern volatile uint32_t        C4FIFOCI11CLR __attribute__((section("sfrs"),address(0xBF885644)));
extern volatile uint32_t        C4FIFOCI11SET __attribute__((section("sfrs"),address(0xBF885648)));
extern volatile uint32_t        C4FIFOCI11INV __attribute__((section("sfrs"),address(0xBF88564C)));
#define C4FIFOCON12 C4FIFOCON12
extern volatile uint32_t   C4FIFOCON12 __attribute__((section("sfrs"), address(0xBF885650)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON12bits_t;
extern volatile __C4FIFOCON12bits_t C4FIFOCON12bits __asm__ ("C4FIFOCON12") __attribute__((section("sfrs"), address(0xBF885650)));
extern volatile uint32_t        C4FIFOCON12CLR __attribute__((section("sfrs"),address(0xBF885654)));
extern volatile uint32_t        C4FIFOCON12SET __attribute__((section("sfrs"),address(0xBF885658)));
extern volatile uint32_t        C4FIFOCON12INV __attribute__((section("sfrs"),address(0xBF88565C)));
#define C4FIFOINT12 C4FIFOINT12
extern volatile uint32_t   C4FIFOINT12 __attribute__((section("sfrs"), address(0xBF885660)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT12bits_t;
extern volatile __C4FIFOINT12bits_t C4FIFOINT12bits __asm__ ("C4FIFOINT12") __attribute__((section("sfrs"), address(0xBF885660)));
extern volatile uint32_t        C4FIFOINT12CLR __attribute__((section("sfrs"),address(0xBF885664)));
extern volatile uint32_t        C4FIFOINT12SET __attribute__((section("sfrs"),address(0xBF885668)));
extern volatile uint32_t        C4FIFOINT12INV __attribute__((section("sfrs"),address(0xBF88566C)));
#define C4FIFOUA12 C4FIFOUA12
extern volatile uint32_t   C4FIFOUA12 __attribute__((section("sfrs"), address(0xBF885670)));
extern volatile uint32_t        C4FIFOUA12CLR __attribute__((section("sfrs"),address(0xBF885674)));
extern volatile uint32_t        C4FIFOUA12SET __attribute__((section("sfrs"),address(0xBF885678)));
extern volatile uint32_t        C4FIFOUA12INV __attribute__((section("sfrs"),address(0xBF88567C)));
#define C4FIFOCI12 C4FIFOCI12
extern volatile uint32_t   C4FIFOCI12 __attribute__((section("sfrs"), address(0xBF885680)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI12bits_t;
extern volatile __C4FIFOCI12bits_t C4FIFOCI12bits __asm__ ("C4FIFOCI12") __attribute__((section("sfrs"), address(0xBF885680)));
extern volatile uint32_t        C4FIFOCI12CLR __attribute__((section("sfrs"),address(0xBF885684)));
extern volatile uint32_t        C4FIFOCI12SET __attribute__((section("sfrs"),address(0xBF885688)));
extern volatile uint32_t        C4FIFOCI12INV __attribute__((section("sfrs"),address(0xBF88568C)));
#define C4FIFOCON13 C4FIFOCON13
extern volatile uint32_t   C4FIFOCON13 __attribute__((section("sfrs"), address(0xBF885690)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON13bits_t;
extern volatile __C4FIFOCON13bits_t C4FIFOCON13bits __asm__ ("C4FIFOCON13") __attribute__((section("sfrs"), address(0xBF885690)));
extern volatile uint32_t        C4FIFOCON13CLR __attribute__((section("sfrs"),address(0xBF885694)));
extern volatile uint32_t        C4FIFOCON13SET __attribute__((section("sfrs"),address(0xBF885698)));
extern volatile uint32_t        C4FIFOCON13INV __attribute__((section("sfrs"),address(0xBF88569C)));
#define C4FIFOINT13 C4FIFOINT13
extern volatile uint32_t   C4FIFOINT13 __attribute__((section("sfrs"), address(0xBF8856A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT13bits_t;
extern volatile __C4FIFOINT13bits_t C4FIFOINT13bits __asm__ ("C4FIFOINT13") __attribute__((section("sfrs"), address(0xBF8856A0)));
extern volatile uint32_t        C4FIFOINT13CLR __attribute__((section("sfrs"),address(0xBF8856A4)));
extern volatile uint32_t        C4FIFOINT13SET __attribute__((section("sfrs"),address(0xBF8856A8)));
extern volatile uint32_t        C4FIFOINT13INV __attribute__((section("sfrs"),address(0xBF8856AC)));
#define C4FIFOUA13 C4FIFOUA13
extern volatile uint32_t   C4FIFOUA13 __attribute__((section("sfrs"), address(0xBF8856B0)));
extern volatile uint32_t        C4FIFOUA13CLR __attribute__((section("sfrs"),address(0xBF8856B4)));
extern volatile uint32_t        C4FIFOUA13SET __attribute__((section("sfrs"),address(0xBF8856B8)));
extern volatile uint32_t        C4FIFOUA13INV __attribute__((section("sfrs"),address(0xBF8856BC)));
#define C4FIFOCI13 C4FIFOCI13
extern volatile uint32_t   C4FIFOCI13 __attribute__((section("sfrs"), address(0xBF8856C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI13bits_t;
