Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
extern volatile __C4FIFOCI13bits_t C4FIFOCI13bits __asm__ ("C4FIFOCI13") __attribute__((section("sfrs"), address(0xBF8856C0)));
extern volatile uint32_t        C4FIFOCI13CLR __attribute__((section("sfrs"),address(0xBF8856C4)));
extern volatile uint32_t        C4FIFOCI13SET __attribute__((section("sfrs"),address(0xBF8856C8)));
extern volatile uint32_t        C4FIFOCI13INV __attribute__((section("sfrs"),address(0xBF8856CC)));
#define C4FIFOCON14 C4FIFOCON14
extern volatile uint32_t   C4FIFOCON14 __attribute__((section("sfrs"), address(0xBF8856D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON14bits_t;
extern volatile __C4FIFOCON14bits_t C4FIFOCON14bits __asm__ ("C4FIFOCON14") __attribute__((section("sfrs"), address(0xBF8856D0)));
extern volatile uint32_t        C4FIFOCON14CLR __attribute__((section("sfrs"),address(0xBF8856D4)));
extern volatile uint32_t        C4FIFOCON14SET __attribute__((section("sfrs"),address(0xBF8856D8)));
extern volatile uint32_t        C4FIFOCON14INV __attribute__((section("sfrs"),address(0xBF8856DC)));
#define C4FIFOINT14 C4FIFOINT14
extern volatile uint32_t   C4FIFOINT14 __attribute__((section("sfrs"), address(0xBF8856E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT14bits_t;
extern volatile __C4FIFOINT14bits_t C4FIFOINT14bits __asm__ ("C4FIFOINT14") __attribute__((section("sfrs"), address(0xBF8856E0)));
extern volatile uint32_t        C4FIFOINT14CLR __attribute__((section("sfrs"),address(0xBF8856E4)));
extern volatile uint32_t        C4FIFOINT14SET __attribute__((section("sfrs"),address(0xBF8856E8)));
extern volatile uint32_t        C4FIFOINT14INV __attribute__((section("sfrs"),address(0xBF8856EC)));
#define C4FIFOUA14 C4FIFOUA14
extern volatile uint32_t   C4FIFOUA14 __attribute__((section("sfrs"), address(0xBF8856F0)));
extern volatile uint32_t        C4FIFOUA14CLR __attribute__((section("sfrs"),address(0xBF8856F4)));
extern volatile uint32_t        C4FIFOUA14SET __attribute__((section("sfrs"),address(0xBF8856F8)));
extern volatile uint32_t        C4FIFOUA14INV __attribute__((section("sfrs"),address(0xBF8856FC)));
#define C4FIFOCI14 C4FIFOCI14
extern volatile uint32_t   C4FIFOCI14 __attribute__((section("sfrs"), address(0xBF885700)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI14bits_t;
extern volatile __C4FIFOCI14bits_t C4FIFOCI14bits __asm__ ("C4FIFOCI14") __attribute__((section("sfrs"), address(0xBF885700)));
extern volatile uint32_t        C4FIFOCI14CLR __attribute__((section("sfrs"),address(0xBF885704)));
extern volatile uint32_t        C4FIFOCI14SET __attribute__((section("sfrs"),address(0xBF885708)));
extern volatile uint32_t        C4FIFOCI14INV __attribute__((section("sfrs"),address(0xBF88570C)));
#define C4FIFOCON15 C4FIFOCON15
extern volatile uint32_t   C4FIFOCON15 __attribute__((section("sfrs"), address(0xBF885710)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON15bits_t;
extern volatile __C4FIFOCON15bits_t C4FIFOCON15bits __asm__ ("C4FIFOCON15") __attribute__((section("sfrs"), address(0xBF885710)));
extern volatile uint32_t        C4FIFOCON15CLR __attribute__((section("sfrs"),address(0xBF885714)));
extern volatile uint32_t        C4FIFOCON15SET __attribute__((section("sfrs"),address(0xBF885718)));
extern volatile uint32_t        C4FIFOCON15INV __attribute__((section("sfrs"),address(0xBF88571C)));
#define C4FIFOINT15 C4FIFOINT15
extern volatile uint32_t   C4FIFOINT15 __attribute__((section("sfrs"), address(0xBF885720)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT15bits_t;
extern volatile __C4FIFOINT15bits_t C4FIFOINT15bits __asm__ ("C4FIFOINT15") __attribute__((section("sfrs"), address(0xBF885720)));
extern volatile uint32_t        C4FIFOINT15CLR __attribute__((section("sfrs"),address(0xBF885724)));
extern volatile uint32_t        C4FIFOINT15SET __attribute__((section("sfrs"),address(0xBF885728)));
extern volatile uint32_t        C4FIFOINT15INV __attribute__((section("sfrs"),address(0xBF88572C)));
#define C4FIFOUA15 C4FIFOUA15
extern volatile uint32_t   C4FIFOUA15 __attribute__((section("sfrs"), address(0xBF885730)));
extern volatile uint32_t        C4FIFOUA15CLR __attribute__((section("sfrs"),address(0xBF885734)));
extern volatile uint32_t        C4FIFOUA15SET __attribute__((section("sfrs"),address(0xBF885738)));
extern volatile uint32_t        C4FIFOUA15INV __attribute__((section("sfrs"),address(0xBF88573C)));
#define C4FIFOCI15 C4FIFOCI15
extern volatile uint32_t   C4FIFOCI15 __attribute__((section("sfrs"), address(0xBF885740)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI15bits_t;
extern volatile __C4FIFOCI15bits_t C4FIFOCI15bits __asm__ ("C4FIFOCI15") __attribute__((section("sfrs"), address(0xBF885740)));
extern volatile uint32_t        C4FIFOCI15CLR __attribute__((section("sfrs"),address(0xBF885744)));
extern volatile uint32_t        C4FIFOCI15SET __attribute__((section("sfrs"),address(0xBF885748)));
extern volatile uint32_t        C4FIFOCI15INV __attribute__((section("sfrs"),address(0xBF88574C)));
#define ADCCON1 ADCCON1
extern volatile uint32_t   ADCCON1 __attribute__((section("sfrs"), address(0xBF887000)));
typedef struct {
  uint32_t DMABL:3;
  uint32_t STRGLVL:1;
  uint32_t IRQVS:3;
  uint32_t :2;
  uint32_t FSPBCLKEN:1;
  uint32_t FSSCLKEN:1;
  uint32_t CVDEN:1;
  uint32_t AICPMPEN:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t STRGSRC:5;
  uint32_t SELRES:2;
  uint32_t FRACT:1;
  uint32_t TRBSLV:3;
  uint32_t TRBMST:3;
  uint32_t TRBERR:1;
  uint32_t TRBEN:1;
} __ADCCON1bits_t;
extern volatile __ADCCON1bits_t ADCCON1bits __asm__ ("ADCCON1") __attribute__((section("sfrs"), address(0xBF887000)));
extern volatile uint32_t        ADCCON1CLR __attribute__((section("sfrs"),address(0xBF887004)));
extern volatile uint32_t        ADCCON1SET __attribute__((section("sfrs"),address(0xBF887008)));
extern volatile uint32_t        ADCCON1INV __attribute__((section("sfrs"),address(0xBF88700C)));
#define ADCCON2 ADCCON2
extern volatile uint32_t   ADCCON2 __attribute__((section("sfrs"), address(0xBF887010)));
typedef struct {
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t ADCEIS:3;
  uint32_t :1;
  uint32_t ADCEIOVR:1;
  uint32_t EOSIEN:1;
  uint32_t REFFLTIEN:1;
  uint32_t BGVRIEN:1;
  uint32_t SAMC:10;
  uint32_t CVDCPL:3;
  uint32_t EOSRDY:1;
  uint32_t REFFLT:1;
  uint32_t BGVRRDY:1;
} __ADCCON2bits_t;
extern volatile __ADCCON2bits_t ADCCON2bits __asm__ ("ADCCON2") __attribute__((section("sfrs"), address(0xBF887010)));
extern volatile uint32_t        ADCCON2CLR __attribute__((section("sfrs"),address(0xBF887014)));
extern volatile uint32_t        ADCCON2SET __attribute__((section("sfrs"),address(0xBF887018)));
extern volatile uint32_t        ADCCON2INV __attribute__((section("sfrs"),address(0xBF88701C)));
#define ADCCON3 ADCCON3
extern volatile uint32_t   ADCCON3 __attribute__((section("sfrs"), address(0xBF887020)));
typedef struct {
  uint32_t ADINSEL:6;
  uint32_t GSWTRG:1;
  uint32_t GLSWTRG:1;
  uint32_t RQCNVRT:1;
  uint32_t SAMP:1;
  uint32_t UPDRDY:1;
  uint32_t UPDIEN:1;
  uint32_t TRGSUSP:1;
  uint32_t VREFSEL:3;
  uint32_t DIGEN0:1;
  uint32_t DIGEN1:1;
  uint32_t DIGEN2:1;
  uint32_t DIGEN3:1;
  uint32_t DIGEN4:1;
  uint32_t DIGEN5:1;
  uint32_t :1;
  uint32_t DIGEN7:1;
  uint32_t CONCLKDIV:6;
  uint32_t ADCSEL:2;
} __ADCCON3bits_t;
extern volatile __ADCCON3bits_t ADCCON3bits __asm__ ("ADCCON3") __attribute__((section("sfrs"), address(0xBF887020)));
extern volatile uint32_t        ADCCON3CLR __attribute__((section("sfrs"),address(0xBF887024)));
extern volatile uint32_t        ADCCON3SET __attribute__((section("sfrs"),address(0xBF887028)));
extern volatile uint32_t        ADCCON3INV __attribute__((section("sfrs"),address(0xBF88702C)));
#define ADCTRGMODE ADCTRGMODE
extern volatile uint32_t   ADCTRGMODE __attribute__((section("sfrs"), address(0xBF887030)));
typedef struct {
  uint32_t SSAMPEN0:1;
  uint32_t SSAMPEN1:1;
  uint32_t SSAMPEN2:1;
  uint32_t SSAMPEN3:1;
  uint32_t SSAMPEN4:1;
  uint32_t SSAMPEN5:1;
  uint32_t :2;
  uint32_t STRGEN0:1;
  uint32_t STRGEN1:1;
  uint32_t STRGEN2:1;
  uint32_t STRGEN3:1;
  uint32_t STRGEN4:1;
  uint32_t STRGEN5:1;
  uint32_t :2;
  uint32_t SH0ALT:2;
  uint32_t SH1ALT:2;
  uint32_t SH2ALT:2;
  uint32_t SH3ALT:2;
  uint32_t SH4ALT:2;
  uint32_t SH5ALT:2;
} __ADCTRGMODEbits_t;
extern volatile __ADCTRGMODEbits_t ADCTRGMODEbits __asm__ ("ADCTRGMODE") __attribute__((section("sfrs"), address(0xBF887030)));
extern volatile uint32_t        ADCTRGMODECLR __attribute__((section("sfrs"),address(0xBF887034)));
extern volatile uint32_t        ADCTRGMODESET __attribute__((section("sfrs"),address(0xBF887038)));
extern volatile uint32_t        ADCTRGMODEINV __attribute__((section("sfrs"),address(0xBF88703C)));
#define ADCIMCON1 ADCIMCON1
extern volatile uint32_t   ADCIMCON1 __attribute__((section("sfrs"), address(0xBF887040)));
typedef struct {
  uint32_t SIGN0:1;
  uint32_t DIFF0:1;
  uint32_t SIGN1:1;
  uint32_t DIFF1:1;
  uint32_t SIGN2:1;
  uint32_t DIFF2:1;
  uint32_t SIGN3:1;
  uint32_t DIFF3:1;
  uint32_t SIGN4:1;
  uint32_t DIFF4:1;
  uint32_t SIGN5:1;
  uint32_t DIFF5:1;
  uint32_t SIGN6:1;
  uint32_t DIFF6:1;
  uint32_t SIGN7:1;
  uint32_t DIFF7:1;
  uint32_t SIGN8:1;
  uint32_t DIFF8:1;
  uint32_t SIGN9:1;
  uint32_t DIFF9:1;
  uint32_t SIGN10:1;
  uint32_t DIFF10:1;
  uint32_t SIGN11:1;
  uint32_t DIFF11:1;
  uint32_t SIGN12:1;
  uint32_t DIFF12:1;
  uint32_t SIGN13:1;
  uint32_t DIFF13:1;
  uint32_t SIGN14:1;
  uint32_t DIFF14:1;
  uint32_t SIGN15:1;
  uint32_t DIFF15:1;
} __ADCIMCON1bits_t;
