Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
  .extern PTGQUE5SET       /* 0xBF82B118 */
  .extern PTGQUE5INV       /* 0xBF82B11C */
  .extern PTGQUE6          /* 0xBF82B120 */
  .extern PTGQUE6CLR       /* 0xBF82B124 */
  .extern PTGQUE6SET       /* 0xBF82B128 */
  .extern PTGQUE6INV       /* 0xBF82B12C */
  .extern PTGQUE7          /* 0xBF82B130 */
  .extern PTGQUE7CLR       /* 0xBF82B134 */
  .extern PTGQUE7SET       /* 0xBF82B138 */
  .extern PTGQUE7INV       /* 0xBF82B13C */
  .extern QEI1CON          /* 0xBF82B200 */
  .extern QEI1CONCLR       /* 0xBF82B204 */
  .extern QEI1CONSET       /* 0xBF82B208 */
  .extern QEI1CONINV       /* 0xBF82B20C */
  .extern QEI1IOC          /* 0xBF82B210 */
  .extern QEI1IOCCLR       /* 0xBF82B214 */
  .extern QEI1IOCSET       /* 0xBF82B218 */
  .extern QEI1IOCINV       /* 0xBF82B21C */
  .extern QEI1STAT         /* 0xBF82B220 */
  .extern QEI1STATCLR      /* 0xBF82B224 */
  .extern QEI1STATSET      /* 0xBF82B228 */
  .extern QEI1STATINV      /* 0xBF82B22C */
  .extern POS1CNT          /* 0xBF82B230 */
  .extern POS1CNTCLR       /* 0xBF82B234 */
  .extern POS1CNTSET       /* 0xBF82B238 */
  .extern POS1CNTINV       /* 0xBF82B23C */
  .extern POS1HLD          /* 0xBF82B240 */
  .extern POS1HLDCLR       /* 0xBF82B244 */
  .extern POS1HLDSET       /* 0xBF82B248 */
  .extern POS1HLDINV       /* 0xBF82B24C */
  .extern VEL1CNT          /* 0xBF82B250 */
  .extern VEL1CNTCLR       /* 0xBF82B254 */
  .extern VEL1CNTSET       /* 0xBF82B258 */
  .extern VEL1CNTINV       /* 0xBF82B25C */
  .extern VEL1HLD          /* 0xBF82B260 */
  .extern VEL1HLDCLR       /* 0xBF82B264 */
  .extern VEL1HLDSET       /* 0xBF82B268 */
  .extern VEL1HLDINV       /* 0xBF82B26C */
  .extern INT1TMR          /* 0xBF82B270 */
  .extern INT1TMRCLR       /* 0xBF82B274 */
  .extern INT1TMRSET       /* 0xBF82B278 */
  .extern INT1TMRINV       /* 0xBF82B27C */
  .extern INT1HLD          /* 0xBF82B280 */
  .extern INT1HLDCLR       /* 0xBF82B284 */
  .extern INT1HLDSET       /* 0xBF82B288 */
  .extern INT1HLDINV       /* 0xBF82B28C */
  .extern INDX1CNT         /* 0xBF82B290 */
  .extern INDX1CNTCLR      /* 0xBF82B294 */
  .extern INDX1CNTSET      /* 0xBF82B298 */
  .extern INDX1CNTINV      /* 0xBF82B29C */
  .extern INDX1HLD         /* 0xBF82B2A0 */
  .extern INDX1HLDCLR      /* 0xBF82B2A4 */
  .extern INDX1HLDSET      /* 0xBF82B2A8 */
  .extern INDX1HLDINV      /* 0xBF82B2AC */
  .extern QEI1ICC          /* 0xBF82B2B0 */
  .extern QEI1ICCCLR       /* 0xBF82B2B4 */
  .extern QEI1ICCSET       /* 0xBF82B2B8 */
  .extern QEI1ICCINV       /* 0xBF82B2BC */
  .extern QEI1CMPL         /* 0xBF82B2C0 */
  .extern QEI1CMPLCLR      /* 0xBF82B2C4 */
  .extern QEI1CMPLSET      /* 0xBF82B2C8 */
  .extern QEI1CMPLINV      /* 0xBF82B2CC */
  .extern QEI2CON          /* 0xBF82B400 */
  .extern QEI2CONCLR       /* 0xBF82B404 */
  .extern QEI2CONSET       /* 0xBF82B408 */
  .extern QEI2CONINV       /* 0xBF82B40C */
  .extern QEI2IOC          /* 0xBF82B410 */
  .extern QEI2IOCCLR       /* 0xBF82B414 */
  .extern QEI2IOCSET       /* 0xBF82B418 */
  .extern QEI2IOCINV       /* 0xBF82B41C */
  .extern QEI2STAT         /* 0xBF82B420 */
  .extern QEI2STATCLR      /* 0xBF82B424 */
  .extern QEI2STATSET      /* 0xBF82B428 */
  .extern QEI2STATINV      /* 0xBF82B42C */
  .extern POS2CNT          /* 0xBF82B430 */
  .extern POS2CNTCLR       /* 0xBF82B434 */
  .extern POS2CNTSET       /* 0xBF82B438 */
  .extern POS2CNTINV       /* 0xBF82B43C */
  .extern POS2HLD          /* 0xBF82B440 */
  .extern POS2HLDCLR       /* 0xBF82B444 */
  .extern POS2HLDSET       /* 0xBF82B448 */
  .extern POS2HLDINV       /* 0xBF82B44C */
  .extern VEL2CNT          /* 0xBF82B450 */
  .extern VEL2CNTCLR       /* 0xBF82B454 */
  .extern VEL2CNTSET       /* 0xBF82B458 */
  .extern VEL2CNTINV       /* 0xBF82B45C */
  .extern VEL2HLD          /* 0xBF82B460 */
  .extern VEL2HLDCLR       /* 0xBF82B464 */
  .extern VEL2HLDSET       /* 0xBF82B468 */
  .extern VEL2HLDINV       /* 0xBF82B46C */
  .extern INT2TMR          /* 0xBF82B470 */
  .extern INT2TMRCLR       /* 0xBF82B474 */
  .extern INT2TMRSET       /* 0xBF82B478 */
  .extern INT2TMRINV       /* 0xBF82B47C */
  .extern INT2HLD          /* 0xBF82B480 */
  .extern INT2HLDCLR       /* 0xBF82B484 */
  .extern INT2HLDSET       /* 0xBF82B488 */
  .extern INT2HLDINV       /* 0xBF82B48C */
  .extern INDX2CNT         /* 0xBF82B490 */
  .extern INDX2CNTCLR      /* 0xBF82B494 */
  .extern INDX2CNTSET      /* 0xBF82B498 */
  .extern INDX2CNTINV      /* 0xBF82B49C */
  .extern INDX2HLD         /* 0xBF82B4A0 */
  .extern INDX2HLDCLR      /* 0xBF82B4A4 */
  .extern INDX2HLDSET      /* 0xBF82B4A8 */
  .extern INDX2HLDINV      /* 0xBF82B4AC */
  .extern QEI2ICC          /* 0xBF82B4B0 */
  .extern QEI2ICCCLR       /* 0xBF82B4B4 */
  .extern QEI2ICCSET       /* 0xBF82B4B8 */
  .extern QEI2ICCINV       /* 0xBF82B4BC */
  .extern QEI2CMPL         /* 0xBF82B4C0 */
  .extern QEI2CMPLCLR      /* 0xBF82B4C4 */
  .extern QEI2CMPLSET      /* 0xBF82B4C8 */
  .extern QEI2CMPLINV      /* 0xBF82B4CC */
  .extern QEI3CON          /* 0xBF82B600 */
  .extern QEI3CONCLR       /* 0xBF82B604 */
  .extern QEI3CONSET       /* 0xBF82B608 */
  .extern QEI3CONINV       /* 0xBF82B60C */
  .extern QEI3IOC          /* 0xBF82B610 */
  .extern QEI3IOCCLR       /* 0xBF82B614 */
  .extern QEI3IOCSET       /* 0xBF82B618 */
  .extern QEI3IOCINV       /* 0xBF82B61C */
  .extern QEI3STAT         /* 0xBF82B620 */
  .extern QEI3STATCLR      /* 0xBF82B624 */
  .extern QEI3STATSET      /* 0xBF82B628 */
  .extern QEI3STATINV      /* 0xBF82B62C */
  .extern POS3CNT          /* 0xBF82B630 */
  .extern POS3CNTCLR       /* 0xBF82B634 */
  .extern POS3CNTSET       /* 0xBF82B638 */
  .extern POS3CNTINV       /* 0xBF82B63C */
  .extern POS3HLD          /* 0xBF82B640 */
  .extern POS3HLDCLR       /* 0xBF82B644 */
  .extern POS3HLDSET       /* 0xBF82B648 */
  .extern POS3HLDINV       /* 0xBF82B64C */
  .extern VEL3CNT          /* 0xBF82B650 */
  .extern VEL3CNTCLR       /* 0xBF82B654 */
  .extern VEL3CNTSET       /* 0xBF82B658 */
  .extern VEL3CNTINV       /* 0xBF82B65C */
  .extern VEL3HLD          /* 0xBF82B660 */
  .extern VEL3HLDCLR       /* 0xBF82B664 */
  .extern VEL3HLDSET       /* 0xBF82B668 */
  .extern VEL3HLDINV       /* 0xBF82B66C */
  .extern INT3TMR          /* 0xBF82B670 */
  .extern INT3TMRCLR       /* 0xBF82B674 */
  .extern INT3TMRSET       /* 0xBF82B678 */
  .extern INT3TMRINV       /* 0xBF82B67C */
  .extern INT3HLD          /* 0xBF82B680 */
  .extern INT3HLDCLR       /* 0xBF82B684 */
  .extern INT3HLDSET       /* 0xBF82B688 */
  .extern INT3HLDINV       /* 0xBF82B68C */
  .extern INDX3CNT         /* 0xBF82B690 */
  .extern INDX3CNTCLR      /* 0xBF82B694 */
  .extern INDX3CNTSET      /* 0xBF82B698 */
  .extern INDX3CNTINV      /* 0xBF82B69C */
  .extern INDX3HLD         /* 0xBF82B6A0 */
  .extern INDX3HLDCLR      /* 0xBF82B6A4 */
  .extern INDX3HLDSET      /* 0xBF82B6A8 */
  .extern INDX3HLDINV      /* 0xBF82B6AC */
  .extern QEI3ICC          /* 0xBF82B6B0 */
  .extern QEI3ICCCLR       /* 0xBF82B6B4 */
  .extern QEI3ICCSET       /* 0xBF82B6B8 */
  .extern QEI3ICCINV       /* 0xBF82B6BC */
  .extern QEI3CMPL         /* 0xBF82B6C0 */
  .extern QEI3CMPLCLR      /* 0xBF82B6C4 */
  .extern QEI3CMPLSET      /* 0xBF82B6C8 */
  .extern QEI3CMPLINV      /* 0xBF82B6CC */
  .extern QEI4CON          /* 0xBF82B800 */
  .extern QEI4CONCLR       /* 0xBF82B804 */
  .extern QEI4CONSET       /* 0xBF82B808 */
  .extern QEI4CONINV       /* 0xBF82B80C */
  .extern QEI4IOC          /* 0xBF82B810 */
  .extern QEI4IOCCLR       /* 0xBF82B814 */
  .extern QEI4IOCSET       /* 0xBF82B818 */
  .extern QEI4IOCINV       /* 0xBF82B81C */
  .extern QEI4STAT         /* 0xBF82B820 */
  .extern QEI4STATCLR      /* 0xBF82B824 */
  .extern QEI4STATSET      /* 0xBF82B828 */
  .extern QEI4STATINV      /* 0xBF82B82C */
  .extern POS4CNT          /* 0xBF82B830 */
  .extern POS4CNTCLR       /* 0xBF82B834 */
  .extern POS4CNTSET       /* 0xBF82B838 */
  .extern POS4CNTINV       /* 0xBF82B83C */
  .extern POS4HLD          /* 0xBF82B840 */
  .extern POS4HLDCLR       /* 0xBF82B844 */
  .extern POS4HLDSET       /* 0xBF82B848 */
  .extern POS4HLDINV       /* 0xBF82B84C */
  .extern VEL4CNT          /* 0xBF82B850 */
  .extern VEL4CNTCLR       /* 0xBF82B854 */
  .extern VEL4CNTSET       /* 0xBF82B858 */
  .extern VEL4CNTINV       /* 0xBF82B85C */
  .extern VEL4HLD          /* 0xBF82B860 */
  .extern VEL4HLDCLR       /* 0xBF82B864 */
  .extern VEL4HLDSET       /* 0xBF82B868 */
  .extern VEL4HLDINV       /* 0xBF82B86C */
  .extern INT4TMR          /* 0xBF82B870 */
  .extern INT4TMRCLR       /* 0xBF82B874 */
  .extern INT4TMRSET       /* 0xBF82B878 */
  .extern INT4TMRINV       /* 0xBF82B87C */
  .extern INT4HLD          /* 0xBF82B880 */
  .extern INT4HLDCLR       /* 0xBF82B884 */
  .extern INT4HLDSET       /* 0xBF82B888 */
  .extern INT4HLDINV       /* 0xBF82B88C */
  .extern INDX4CNT         /* 0xBF82B890 */
  .extern INDX4CNTCLR      /* 0xBF82B894 */
  .extern INDX4CNTSET      /* 0xBF82B898 */
  .extern INDX4CNTINV      /* 0xBF82B89C */
  .extern INDX4HLD         /* 0xBF82B8A0 */
  .extern INDX4HLDCLR      /* 0xBF82B8A4 */
  .extern INDX4HLDSET      /* 0xBF82B8A8 */
  .extern INDX4HLDINV      /* 0xBF82B8AC */
  .extern QEI4ICC          /* 0xBF82B8B0 */
  .extern QEI4ICCCLR       /* 0xBF82B8B4 */
  .extern QEI4ICCSET       /* 0xBF82B8B8 */
  .extern QEI4ICCINV       /* 0xBF82B8BC */
  .extern QEI4CMPL         /* 0xBF82B8C0 */
  .extern QEI4CMPLCLR      /* 0xBF82B8C4 */
  .extern QEI4CMPLSET      /* 0xBF82B8C8 */
  .extern QEI4CMPLINV      /* 0xBF82B8CC */
  .extern QEI5CON          /* 0xBF82BA00 */
  .extern QEI5CONCLR       /* 0xBF82BA04 */
  .extern QEI5CONSET       /* 0xBF82BA08 */
  .extern QEI5CONINV       /* 0xBF82BA0C */
  .extern QEI5IOC          /* 0xBF82BA10 */
  .extern QEI5IOCCLR       /* 0xBF82BA14 */
  .extern QEI5IOCSET       /* 0xBF82BA18 */
  .extern QEI5IOCINV       /* 0xBF82BA1C */
  .extern QEI5STAT         /* 0xBF82BA20 */
  .extern QEI5STATCLR      /* 0xBF82BA24 */
  .extern QEI5STATSET      /* 0xBF82BA28 */
  .extern QEI5STATINV      /* 0xBF82BA2C */
  .extern POS5CNT          /* 0xBF82BA30 */
  .extern POS5CNTCLR       /* 0xBF82BA34 */
  .extern POS5CNTSET       /* 0xBF82BA38 */
  .extern POS5CNTINV       /* 0xBF82BA3C */
  .extern POS5HLD          /* 0xBF82BA40 */
  .extern POS5HLDCLR       /* 0xBF82BA44 */
  .extern POS5HLDSET       /* 0xBF82BA48 */
  .extern POS5HLDINV       /* 0xBF82BA4C */
  .extern VEL5CNT          /* 0xBF82BA50 */
  .extern VEL5CNTCLR       /* 0xBF82BA54 */
  .extern VEL5CNTSET       /* 0xBF82BA58 */
  .extern VEL5CNTINV       /* 0xBF82BA5C */
  .extern VEL5HLD          /* 0xBF82BA60 */
  .extern VEL5HLDCLR       /* 0xBF82BA64 */
  .extern VEL5HLDSET       /* 0xBF82BA68 */
  .extern VEL5HLDINV       /* 0xBF82BA6C */
  .extern INT5TMR          /* 0xBF82BA70 */
  .extern INT5TMRCLR       /* 0xBF82BA74 */
  .extern INT5TMRSET       /* 0xBF82BA78 */
  .extern INT5TMRINV       /* 0xBF82BA7C */
  .extern INT5HLD          /* 0xBF82BA80 */
  .extern INT5HLDCLR       /* 0xBF82BA84 */
  .extern INT5HLDSET       /* 0xBF82BA88 */
  .extern INT5HLDINV       /* 0xBF82BA8C */
  .extern INDX5CNT         /* 0xBF82BA90 */
  .extern INDX5CNTCLR      /* 0xBF82BA94 */
  .extern INDX5CNTSET      /* 0xBF82BA98 */
  .extern INDX5CNTINV      /* 0xBF82BA9C */
  .extern INDX5HLD         /* 0xBF82BAA0 */
  .extern INDX5HLDCLR      /* 0xBF82BAA4 */
  .extern INDX5HLDSET      /* 0xBF82BAA8 */
  .extern INDX5HLDINV      /* 0xBF82BAAC */
  .extern QEI5ICC          /* 0xBF82BAB0 */
  .extern QEI5ICCCLR       /* 0xBF82BAB4 */
  .extern QEI5ICCSET       /* 0xBF82BAB8 */
  .extern QEI5ICCINV       /* 0xBF82BABC */
  .extern QEI5CMPL         /* 0xBF82BAC0 */
  .extern QEI5CMPLCLR      /* 0xBF82BAC4 */
  .extern QEI5CMPLSET      /* 0xBF82BAC8 */
  .extern QEI5CMPLINV      /* 0xBF82BACC */
  .extern QEI6CON          /* 0xBF82BC00 */
  .extern QEI6CONCLR       /* 0xBF82BC04 */
  .extern QEI6CONSET       /* 0xBF82BC08 */
  .extern QEI6CONINV       /* 0xBF82BC0C */
  .extern QEI6IOC          /* 0xBF82BC10 */
  .extern QEI6IOCCLR       /* 0xBF82BC14 */
  .extern QEI6IOCSET       /* 0xBF82BC18 */
  .extern QEI6IOCINV       /* 0xBF82BC1C */
  .extern QEI6STAT         /* 0xBF82BC20 */
  .extern QEI6STATCLR      /* 0xBF82BC24 */
  .extern QEI6STATSET      /* 0xBF82BC28 */
  .extern QEI6STATINV      /* 0xBF82BC2C */
  .extern POS6CNT          /* 0xBF82BC30 */
  .extern POS6CNTCLR       /* 0xBF82BC34 */
  .extern POS6CNTSET       /* 0xBF82BC38 */
  .extern POS6CNTINV       /* 0xBF82BC3C */
  .extern POS6HLD          /* 0xBF82BC40 */
  .extern POS6HLDCLR       /* 0xBF82BC44 */
  .extern POS6HLDSET       /* 0xBF82BC48 */
  .extern POS6HLDINV       /* 0xBF82BC4C */
  .extern VEL6CNT          /* 0xBF82BC50 */
  .extern VEL6CNTCLR       /* 0xBF82BC54 */
  .extern VEL6CNTSET       /* 0xBF82BC58 */
  .extern VEL6CNTINV       /* 0xBF82BC5C */
  .extern VEL6HLD          /* 0xBF82BC60 */
  .extern VEL6HLDCLR       /* 0xBF82BC64 */
  .extern VEL6HLDSET       /* 0xBF82BC68 */
  .extern VEL6HLDINV       /* 0xBF82BC6C */
  .extern INT6TMR          /* 0xBF82BC70 */
  .extern INT6TMRCLR       /* 0xBF82BC74 */
  .extern INT6TMRSET       /* 0xBF82BC78 */
  .extern INT6TMRINV       /* 0xBF82BC7C */
  .extern INT6HLD          /* 0xBF82BC80 */
  .extern INT6HLDCLR       /* 0xBF82BC84 */
  .extern INT6HLDSET       /* 0xBF82BC88 */
  .extern INT6HLDINV       /* 0xBF82BC8C */
  .extern INDX6CNT         /* 0xBF82BC90 */
  .extern INDX6CNTCLR      /* 0xBF82BC94 */
  .extern INDX6CNTSET      /* 0xBF82BC98 */
  .extern INDX6CNTINV      /* 0xBF82BC9C */
  .extern INDX6HLD         /* 0xBF82BCA0 */
  .extern INDX6HLDCLR      /* 0xBF82BCA4 */
  .extern INDX6HLDSET      /* 0xBF82BCA8 */
  .extern INDX6HLDINV      /* 0xBF82BCAC */
  .extern QEI6ICC          /* 0xBF82BCB0 */
  .extern QEI6ICCCLR       /* 0xBF82BCB4 */
  .extern QEI6ICCSET       /* 0xBF82BCB8 */
  .extern QEI6ICCINV       /* 0xBF82BCBC */
  .extern QEI6CMPL         /* 0xBF82BCC0 */
  .extern QEI6CMPLCLR      /* 0xBF82BCC4 */
  .extern QEI6CMPLSET      /* 0xBF82BCC8 */
  .extern QEI6CMPLINV      /* 0xBF82BCCC */
  .extern CMSTAT           /* 0xBF82C000 */
  .extern CMSTATCLR        /* 0xBF82C004 */
  .extern CMSTATSET        /* 0xBF82C008 */
  .extern CMSTATINV        /* 0xBF82C00C */
  .extern CM1CON           /* 0xBF82C010 */
  .extern CM1CONCLR        /* 0xBF82C014 */
  .extern CM1CONSET        /* 0xBF82C018 */
  .extern CM1CONINV        /* 0xBF82C01C */
  .extern CM1MSKCON        /* 0xBF82C020 */
  .extern CM1MSKCONCLR     /* 0xBF82C024 */
  .extern CM1MSKCONSET     /* 0xBF82C028 */
  .extern CM1MSKCONINV     /* 0xBF82C02C */
  .extern CM2CON           /* 0xBF82C030 */
  .extern CM2CONCLR        /* 0xBF82C034 */
  .extern CM2CONSET        /* 0xBF82C038 */
  .extern CM2CONINV        /* 0xBF82C03C */
  .extern CM2MSKCON        /* 0xBF82C040 */
  .extern CM2MSKCONCLR     /* 0xBF82C044 */
  .extern CM2MSKCONSET     /* 0xBF82C048 */
  .extern CM2MSKCONINV     /* 0xBF82C04C */
  .extern CM3CON           /* 0xBF82C050 */
  .extern CM3CONCLR        /* 0xBF82C054 */
  .extern CM3CONSET        /* 0xBF82C058 */
  .extern CM3CONINV        /* 0xBF82C05C */
  .extern CM3MSKCON        /* 0xBF82C060 */
  .extern CM3MSKCONCLR     /* 0xBF82C064 */
  .extern CM3MSKCONSET     /* 0xBF82C068 */
  .extern CM3MSKCONINV     /* 0xBF82C06C */
  .extern CM4CON           /* 0xBF82C070 */
  .extern CM4CONCLR        /* 0xBF82C074 */
  .extern CM4CONSET        /* 0xBF82C078 */
  .extern CM4CONINV        /* 0xBF82C07C */
  .extern CM4MSKCON        /* 0xBF82C080 */
  .extern CM4MSKCONCLR     /* 0xBF82C084 */
  .extern CM4MSKCONSET     /* 0xBF82C088 */
  .extern CM4MSKCONINV     /* 0xBF82C08C */
  .extern CM5CON           /* 0xBF82C090 */
  .extern CM5CONCLR        /* 0xBF82C094 */
  .extern CM5CONSET        /* 0xBF82C098 */
  .extern CM5CONINV        /* 0xBF82C09C */
  .extern CM5MSKCON        /* 0xBF82C0A0 */
  .extern CM5MSKCONCLR     /* 0xBF82C0A4 */
  .extern CM5MSKCONSET     /* 0xBF82C0A8 */
  .extern CM5MSKCONINV     /* 0xBF82C0AC */
  .extern DAC1CON          /* 0xBF82C200 */
  .extern DAC1CONCLR       /* 0xBF82C204 */
  .extern DAC1CONSET       /* 0xBF82C208 */
  .extern DAC1CONINV       /* 0xBF82C20C */
  .extern CTMUCON          /* 0xBF82D000 */
  .extern CTMUCONCLR       /* 0xBF82D004 */
  .extern CTMUCONSET       /* 0xBF82D008 */
  .extern CTMUCONINV       /* 0xBF82D00C */
  .extern PMCON            /* 0xBF82E000 */
  .extern PMCONCLR         /* 0xBF82E004 */
  .extern PMCONSET         /* 0xBF82E008 */
  .extern PMCONINV         /* 0xBF82E00C */
  .extern PMMODE           /* 0xBF82E010 */
  .extern PMMODECLR        /* 0xBF82E014 */
  .extern PMMODESET        /* 0xBF82E018 */
  .extern PMMODEINV        /* 0xBF82E01C */
  .extern PMADDR           /* 0xBF82E020 */
  .extern PMADDRCLR        /* 0xBF82E024 */
  .extern PMADDRSET        /* 0xBF82E028 */
  .extern PMADDRINV        /* 0xBF82E02C */
  .extern PMDOUT           /* 0xBF82E030 */
  .extern PMDOUTCLR        /* 0xBF82E034 */
  .extern PMDOUTSET        /* 0xBF82E038 */
  .extern PMDOUTINV        /* 0xBF82E03C */
  .extern PMDIN            /* 0xBF82E040 */
  .extern PMDINCLR         /* 0xBF82E044 */
  .extern PMDINSET         /* 0xBF82E048 */
  .extern PMDININV         /* 0xBF82E04C */
  .extern PMAEN            /* 0xBF82E050 */
  .extern PMAENCLR         /* 0xBF82E054 */
  .extern PMAENSET         /* 0xBF82E058 */
  .extern PMAENINV         /* 0xBF82E05C */
  .extern PMSTAT           /* 0xBF82E060 */
  .extern PMSTATCLR        /* 0xBF82E064 */
  .extern PMSTATSET        /* 0xBF82E068 */
  .extern PMSTATINV        /* 0xBF82E06C */
  .extern PMWADDR          /* 0xBF82E070 */
  .extern PMWADDRCLR       /* 0xBF82E074 */
  .extern PMWADDRSET       /* 0xBF82E078 */
  .extern PMWADDRINV       /* 0xBF82E07C */
  .extern PMRADDR          /* 0xBF82E080 */
  .extern PMRADDRCLR       /* 0xBF82E084 */
  .extern PMRADDRSET       /* 0xBF82E088 */
  .extern PMRADDRINV       /* 0xBF82E08C */
  .extern PMRDIN           /* 0xBF82E090 */
  .extern PMRDINCLR        /* 0xBF82E094 */
  .extern PMRDINSET        /* 0xBF82E098 */
  .extern PMRDININV        /* 0xBF82E09C */
  .extern IC10CON          /* 0xBF843200 */
  .extern IC10CONCLR       /* 0xBF843204 */
  .extern IC10CONSET       /* 0xBF843208 */
  .extern IC10CONINV       /* 0xBF84320C */
  .extern IC10BUF          /* 0xBF843210 */
  .extern IC11CON          /* 0xBF843400 */
  .extern IC11CONCLR       /* 0xBF843404 */
  .extern IC11CONSET       /* 0xBF843408 */
  .extern IC11CONINV       /* 0xBF84340C */
  .extern IC11BUF          /* 0xBF843410 */
  .extern IC12CON          /* 0xBF843600 */
  .extern IC12CONCLR       /* 0xBF843604 */
  .extern IC12CONSET       /* 0xBF843608 */
  .extern IC12CONINV       /* 0xBF84360C */
  .extern IC12BUF          /* 0xBF843610 */
  .extern IC13CON          /* 0xBF843800 */
  .extern IC13CONCLR       /* 0xBF843804 */
  .extern IC13CONSET       /* 0xBF843808 */
  .extern IC13CONINV       /* 0xBF84380C */
  .extern IC13BUF          /* 0xBF843810 */
  .extern IC14CON          /* 0xBF843A00 */
  .extern IC14CONCLR       /* 0xBF843A04 */
  .extern IC14CONSET       /* 0xBF843A08 */
  .extern IC14CONINV       /* 0xBF843A0C */
  .extern IC14BUF          /* 0xBF843A10 */
  .extern IC15CON          /* 0xBF843C00 */
  .extern IC15CONCLR       /* 0xBF843C04 */
  .extern IC15CONSET       /* 0xBF843C08 */
  .extern IC15CONINV       /* 0xBF843C0C */
  .extern IC15BUF          /* 0xBF843C10 */
  .extern IC16CON          /* 0xBF843E00 */
  .extern IC16CONCLR       /* 0xBF843E04 */
  .extern IC16CONSET       /* 0xBF843E08 */
  .extern IC16CONINV       /* 0xBF843E0C */
  .extern IC16BUF          /* 0xBF843E10 */
  .extern OC10CON          /* 0xBF845200 */
  .extern OC10CONCLR       /* 0xBF845204 */
  .extern OC10CONSET       /* 0xBF845208 */
  .extern OC10CONINV       /* 0xBF84520C */
  .extern OC10R            /* 0xBF845210 */
  .extern OC10RCLR         /* 0xBF845214 */
  .extern OC10RSET         /* 0xBF845218 */
  .extern OC10RINV         /* 0xBF84521C */
  .extern OC10RS           /* 0xBF845220 */
  .extern OC10RSCLR        /* 0xBF845224 */
  .extern OC10RSSET        /* 0xBF845228 */
  .extern OC10RSINV        /* 0xBF84522C */
  .extern OC11CON          /* 0xBF845400 */
  .extern OC11CONCLR       /* 0xBF845404 */
  .extern OC11CONSET       /* 0xBF845408 */
  .extern OC11CONINV       /* 0xBF84540C */
  .extern OC11R            /* 0xBF845410 */
  .extern OC11RCLR         /* 0xBF845414 */
  .extern OC11RSET         /* 0xBF845418 */
  .extern OC11RINV         /* 0xBF84541C */
  .extern OC11RS           /* 0xBF845420 */
  .extern OC11RSCLR        /* 0xBF845424 */
  .extern OC11RSSET        /* 0xBF845428 */
  .extern OC11RSINV        /* 0xBF84542C */
  .extern OC12CON          /* 0xBF845600 */
  .extern OC12CONCLR       /* 0xBF845604 */
  .extern OC12CONSET       /* 0xBF845608 */
  .extern OC12CONINV       /* 0xBF84560C */
  .extern OC12R            /* 0xBF845610 */
  .extern OC12RCLR         /* 0xBF845614 */
  .extern OC12RSET         /* 0xBF845618 */
  .extern OC12RINV         /* 0xBF84561C */
  .extern OC12RS           /* 0xBF845620 */
  .extern OC12RSCLR        /* 0xBF845624 */
  .extern OC12RSSET        /* 0xBF845628 */
  .extern OC12RSINV        /* 0xBF84562C */
  .extern OC13CON          /* 0xBF845800 */
  .extern OC13CONCLR       /* 0xBF845804 */
  .extern OC13CONSET       /* 0xBF845808 */
  .extern OC13CONINV       /* 0xBF84580C */
  .extern OC13R            /* 0xBF845810 */
  .extern OC13RCLR         /* 0xBF845814 */
  .extern OC13RSET         /* 0xBF845818 */
  .extern OC13RINV         /* 0xBF84581C */
  .extern OC13RS           /* 0xBF845820 */
  .extern OC13RSCLR        /* 0xBF845824 */
  .extern OC13RSSET        /* 0xBF845828 */
  .extern OC13RSINV        /* 0xBF84582C */
  .extern OC14CON          /* 0xBF845A00 */
  .extern OC14CONCLR       /* 0xBF845A04 */
  .extern OC14CONSET       /* 0xBF845A08 */
  .extern OC14CONINV       /* 0xBF845A0C */
  .extern OC14R            /* 0xBF845A10 */
  .extern OC14RCLR         /* 0xBF845A14 */
  .extern OC14RSET         /* 0xBF845A18 */
  .extern OC14RINV         /* 0xBF845A1C */
  .extern OC14RS           /* 0xBF845A20 */
  .extern OC14RSCLR        /* 0xBF845A24 */
  .extern OC14RSSET        /* 0xBF845A28 */
  .extern OC14RSINV        /* 0xBF845A2C */
  .extern OC15CON          /* 0xBF845C00 */
  .extern OC15CONCLR       /* 0xBF845C04 */
  .extern OC15CONSET       /* 0xBF845C08 */
  .extern OC15CONINV       /* 0xBF845C0C */
  .extern OC15R            /* 0xBF845C10 */
  .extern OC15RCLR         /* 0xBF845C14 */
  .extern OC15RSET         /* 0xBF845C18 */
  .extern OC15RINV         /* 0xBF845C1C */
  .extern OC15RS           /* 0xBF845C20 */
  .extern OC15RSCLR        /* 0xBF845C24 */
  .extern OC15RSSET        /* 0xBF845C28 */
  .extern OC15RSINV        /* 0xBF845C2C */
  .extern OC16CON          /* 0xBF845E00 */
  .extern OC16CONCLR       /* 0xBF845E04 */
  .extern OC16CONSET       /* 0xBF845E08 */
  .extern OC16CONINV       /* 0xBF845E0C */
  .extern OC16R            /* 0xBF845E10 */
  .extern OC16RCLR         /* 0xBF845E14 */
  .extern OC16RSET         /* 0xBF845E18 */
  .extern OC16RINV         /* 0xBF845E1C */
  .extern OC16RS           /* 0xBF845E20 */
  .extern OC16RSCLR        /* 0xBF845E24 */
  .extern OC16RSSET        /* 0xBF845E28 */
  .extern OC16RSINV        /* 0xBF845E2C */
  .extern I2C3CON          /* 0xBF846400 */
  .extern I2C3CONCLR       /* 0xBF846404 */
  .extern I2C3CONSET       /* 0xBF846408 */
  .extern I2C3CONINV       /* 0xBF84640C */
  .extern I2C3STAT         /* 0xBF846410 */
  .extern I2C3STATCLR      /* 0xBF846414 */
  .extern I2C3STATSET      /* 0xBF846418 */
  .extern I2C3STATINV      /* 0xBF84641C */
  .extern I2C3ADD          /* 0xBF846420 */
  .extern I2C3ADDCLR       /* 0xBF846424 */
  .extern I2C3ADDSET       /* 0xBF846428 */
  .extern I2C3ADDINV       /* 0xBF84642C */
