Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
  .extern C2FIFOCON1SET    /* 0xBF881398 */
  .extern C2FIFOCON1INV    /* 0xBF88139C */
  .extern C2FIFOINT1       /* 0xBF8813A0 */
  .extern C2FIFOINT1CLR    /* 0xBF8813A4 */
  .extern C2FIFOINT1SET    /* 0xBF8813A8 */
  .extern C2FIFOINT1INV    /* 0xBF8813AC */
  .extern C2FIFOUA1        /* 0xBF8813B0 */
  .extern C2FIFOUA1CLR     /* 0xBF8813B4 */
  .extern C2FIFOUA1SET     /* 0xBF8813B8 */
  .extern C2FIFOUA1INV     /* 0xBF8813BC */
  .extern C2FIFOCI1        /* 0xBF8813C0 */
  .extern C2FIFOCI1CLR     /* 0xBF8813C4 */
  .extern C2FIFOCI1SET     /* 0xBF8813C8 */
  .extern C2FIFOCI1INV     /* 0xBF8813CC */
  .extern C2FIFOCON2       /* 0xBF8813D0 */
  .extern C2FIFOCON2CLR    /* 0xBF8813D4 */
  .extern C2FIFOCON2SET    /* 0xBF8813D8 */
  .extern C2FIFOCON2INV    /* 0xBF8813DC */
  .extern C2FIFOINT2       /* 0xBF8813E0 */
  .extern C2FIFOINT2CLR    /* 0xBF8813E4 */
  .extern C2FIFOINT2SET    /* 0xBF8813E8 */
  .extern C2FIFOINT2INV    /* 0xBF8813EC */
  .extern C2FIFOUA2        /* 0xBF8813F0 */
  .extern C2FIFOUA2CLR     /* 0xBF8813F4 */
  .extern C2FIFOUA2SET     /* 0xBF8813F8 */
  .extern C2FIFOUA2INV     /* 0xBF8813FC */
  .extern C2FIFOCI2        /* 0xBF881400 */
  .extern C2FIFOCI2CLR     /* 0xBF881404 */
  .extern C2FIFOCI2SET     /* 0xBF881408 */
  .extern C2FIFOCI2INV     /* 0xBF88140C */
  .extern C2FIFOCON3       /* 0xBF881410 */
  .extern C2FIFOCON3CLR    /* 0xBF881414 */
  .extern C2FIFOCON3SET    /* 0xBF881418 */
  .extern C2FIFOCON3INV    /* 0xBF88141C */
  .extern C2FIFOINT3       /* 0xBF881420 */
  .extern C2FIFOINT3CLR    /* 0xBF881424 */
  .extern C2FIFOINT3SET    /* 0xBF881428 */
  .extern C2FIFOINT3INV    /* 0xBF88142C */
  .extern C2FIFOUA3        /* 0xBF881430 */
  .extern C2FIFOUA3CLR     /* 0xBF881434 */
  .extern C2FIFOUA3SET     /* 0xBF881438 */
  .extern C2FIFOUA3INV     /* 0xBF88143C */
  .extern C2FIFOCI3        /* 0xBF881440 */
  .extern C2FIFOCI3CLR     /* 0xBF881444 */
  .extern C2FIFOCI3SET     /* 0xBF881448 */
  .extern C2FIFOCI3INV     /* 0xBF88144C */
  .extern C2FIFOCON4       /* 0xBF881450 */
  .extern C2FIFOCON4CLR    /* 0xBF881454 */
  .extern C2FIFOCON4SET    /* 0xBF881458 */
  .extern C2FIFOCON4INV    /* 0xBF88145C */
  .extern C2FIFOINT4       /* 0xBF881460 */
  .extern C2FIFOINT4CLR    /* 0xBF881464 */
  .extern C2FIFOINT4SET    /* 0xBF881468 */
  .extern C2FIFOINT4INV    /* 0xBF88146C */
  .extern C2FIFOUA4        /* 0xBF881470 */
  .extern C2FIFOUA4CLR     /* 0xBF881474 */
  .extern C2FIFOUA4SET     /* 0xBF881478 */
  .extern C2FIFOUA4INV     /* 0xBF88147C */
  .extern C2FIFOCI4        /* 0xBF881480 */
  .extern C2FIFOCI4CLR     /* 0xBF881484 */
  .extern C2FIFOCI4SET     /* 0xBF881488 */
  .extern C2FIFOCI4INV     /* 0xBF88148C */
  .extern C2FIFOCON5       /* 0xBF881490 */
  .extern C2FIFOCON5CLR    /* 0xBF881494 */
  .extern C2FIFOCON5SET    /* 0xBF881498 */
  .extern C2FIFOCON5INV    /* 0xBF88149C */
  .extern C2FIFOINT5       /* 0xBF8814A0 */
  .extern C2FIFOINT5CLR    /* 0xBF8814A4 */
  .extern C2FIFOINT5SET    /* 0xBF8814A8 */
  .extern C2FIFOINT5INV    /* 0xBF8814AC */
  .extern C2FIFOUA5        /* 0xBF8814B0 */
  .extern C2FIFOUA5CLR     /* 0xBF8814B4 */
  .extern C2FIFOUA5SET     /* 0xBF8814B8 */
  .extern C2FIFOUA5INV     /* 0xBF8814BC */
  .extern C2FIFOCI5        /* 0xBF8814C0 */
  .extern C2FIFOCI5CLR     /* 0xBF8814C4 */
  .extern C2FIFOCI5SET     /* 0xBF8814C8 */
  .extern C2FIFOCI5INV     /* 0xBF8814CC */
  .extern C2FIFOCON6       /* 0xBF8814D0 */
  .extern C2FIFOCON6CLR    /* 0xBF8814D4 */
  .extern C2FIFOCON6SET    /* 0xBF8814D8 */
  .extern C2FIFOCON6INV    /* 0xBF8814DC */
  .extern C2FIFOINT6       /* 0xBF8814E0 */
  .extern C2FIFOINT6CLR    /* 0xBF8814E4 */
  .extern C2FIFOINT6SET    /* 0xBF8814E8 */
  .extern C2FIFOINT6INV    /* 0xBF8814EC */
  .extern C2FIFOUA6        /* 0xBF8814F0 */
  .extern C2FIFOUA6CLR     /* 0xBF8814F4 */
  .extern C2FIFOUA6SET     /* 0xBF8814F8 */
  .extern C2FIFOUA6INV     /* 0xBF8814FC */
  .extern C2FIFOCI6        /* 0xBF881500 */
  .extern C2FIFOCI6CLR     /* 0xBF881504 */
  .extern C2FIFOCI6SET     /* 0xBF881508 */
  .extern C2FIFOCI6INV     /* 0xBF88150C */
  .extern C2FIFOCON7       /* 0xBF881510 */
  .extern C2FIFOCON7CLR    /* 0xBF881514 */
  .extern C2FIFOCON7SET    /* 0xBF881518 */
  .extern C2FIFOCON7INV    /* 0xBF88151C */
  .extern C2FIFOINT7       /* 0xBF881520 */
  .extern C2FIFOINT7CLR    /* 0xBF881524 */
  .extern C2FIFOINT7SET    /* 0xBF881528 */
  .extern C2FIFOINT7INV    /* 0xBF88152C */
  .extern C2FIFOUA7        /* 0xBF881530 */
  .extern C2FIFOUA7CLR     /* 0xBF881534 */
  .extern C2FIFOUA7SET     /* 0xBF881538 */
  .extern C2FIFOUA7INV     /* 0xBF88153C */
  .extern C2FIFOCI7        /* 0xBF881540 */
  .extern C2FIFOCI7CLR     /* 0xBF881544 */
  .extern C2FIFOCI7SET     /* 0xBF881548 */
  .extern C2FIFOCI7INV     /* 0xBF88154C */
  .extern C2FIFOCON8       /* 0xBF881550 */
  .extern C2FIFOCON8CLR    /* 0xBF881554 */
  .extern C2FIFOCON8SET    /* 0xBF881558 */
  .extern C2FIFOCON8INV    /* 0xBF88155C */
  .extern C2FIFOINT8       /* 0xBF881560 */
  .extern C2FIFOINT8CLR    /* 0xBF881564 */
  .extern C2FIFOINT8SET    /* 0xBF881568 */
  .extern C2FIFOINT8INV    /* 0xBF88156C */
  .extern C2FIFOUA8        /* 0xBF881570 */
  .extern C2FIFOUA8CLR     /* 0xBF881574 */
  .extern C2FIFOUA8SET     /* 0xBF881578 */
  .extern C2FIFOUA8INV     /* 0xBF88157C */
  .extern C2FIFOCI8        /* 0xBF881580 */
  .extern C2FIFOCI8CLR     /* 0xBF881584 */
  .extern C2FIFOCI8SET     /* 0xBF881588 */
  .extern C2FIFOCI8INV     /* 0xBF88158C */
  .extern C2FIFOCON9       /* 0xBF881590 */
  .extern C2FIFOCON9CLR    /* 0xBF881594 */
  .extern C2FIFOCON9SET    /* 0xBF881598 */
  .extern C2FIFOCON9INV    /* 0xBF88159C */
  .extern C2FIFOINT9       /* 0xBF8815A0 */
  .extern C2FIFOINT9CLR    /* 0xBF8815A4 */
  .extern C2FIFOINT9SET    /* 0xBF8815A8 */
  .extern C2FIFOINT9INV    /* 0xBF8815AC */
  .extern C2FIFOUA9        /* 0xBF8815B0 */
  .extern C2FIFOUA9CLR     /* 0xBF8815B4 */
  .extern C2FIFOUA9SET     /* 0xBF8815B8 */
  .extern C2FIFOUA9INV     /* 0xBF8815BC */
  .extern C2FIFOCI9        /* 0xBF8815C0 */
  .extern C2FIFOCI9CLR     /* 0xBF8815C4 */
  .extern C2FIFOCI9SET     /* 0xBF8815C8 */
  .extern C2FIFOCI9INV     /* 0xBF8815CC */
  .extern C2FIFOCON10      /* 0xBF8815D0 */
  .extern C2FIFOCON10CLR   /* 0xBF8815D4 */
  .extern C2FIFOCON10SET   /* 0xBF8815D8 */
  .extern C2FIFOCON10INV   /* 0xBF8815DC */
  .extern C2FIFOINT10      /* 0xBF8815E0 */
  .extern C2FIFOINT10CLR   /* 0xBF8815E4 */
  .extern C2FIFOINT10SET   /* 0xBF8815E8 */
  .extern C2FIFOINT10INV   /* 0xBF8815EC */
  .extern C2FIFOUA10       /* 0xBF8815F0 */
  .extern C2FIFOUA10CLR    /* 0xBF8815F4 */
  .extern C2FIFOUA10SET    /* 0xBF8815F8 */
  .extern C2FIFOUA10INV    /* 0xBF8815FC */
  .extern C2FIFOCI10       /* 0xBF881600 */
  .extern C2FIFOCI10CLR    /* 0xBF881604 */
  .extern C2FIFOCI10SET    /* 0xBF881608 */
  .extern C2FIFOCI10INV    /* 0xBF88160C */
  .extern C2FIFOCON11      /* 0xBF881610 */
  .extern C2FIFOCON11CLR   /* 0xBF881614 */
  .extern C2FIFOCON11SET   /* 0xBF881618 */
  .extern C2FIFOCON11INV   /* 0xBF88161C */
  .extern C2FIFOINT11      /* 0xBF881620 */
  .extern C2FIFOINT11CLR   /* 0xBF881624 */
  .extern C2FIFOINT11SET   /* 0xBF881628 */
  .extern C2FIFOINT11INV   /* 0xBF88162C */
  .extern C2FIFOUA11       /* 0xBF881630 */
  .extern C2FIFOUA11CLR    /* 0xBF881634 */
  .extern C2FIFOUA11SET    /* 0xBF881638 */
  .extern C2FIFOUA11INV    /* 0xBF88163C */
  .extern C2FIFOCI11       /* 0xBF881640 */
  .extern C2FIFOCI11CLR    /* 0xBF881644 */
  .extern C2FIFOCI11SET    /* 0xBF881648 */
  .extern C2FIFOCI11INV    /* 0xBF88164C */
  .extern C2FIFOCON12      /* 0xBF881650 */
  .extern C2FIFOCON12CLR   /* 0xBF881654 */
  .extern C2FIFOCON12SET   /* 0xBF881658 */
  .extern C2FIFOCON12INV   /* 0xBF88165C */
  .extern C2FIFOINT12      /* 0xBF881660 */
  .extern C2FIFOINT12CLR   /* 0xBF881664 */
  .extern C2FIFOINT12SET   /* 0xBF881668 */
  .extern C2FIFOINT12INV   /* 0xBF88166C */
  .extern C2FIFOUA12       /* 0xBF881670 */
  .extern C2FIFOUA12CLR    /* 0xBF881674 */
  .extern C2FIFOUA12SET    /* 0xBF881678 */
  .extern C2FIFOUA12INV    /* 0xBF88167C */
  .extern C2FIFOCI12       /* 0xBF881680 */
  .extern C2FIFOCI12CLR    /* 0xBF881684 */
  .extern C2FIFOCI12SET    /* 0xBF881688 */
  .extern C2FIFOCI12INV    /* 0xBF88168C */
  .extern C2FIFOCON13      /* 0xBF881690 */
  .extern C2FIFOCON13CLR   /* 0xBF881694 */
  .extern C2FIFOCON13SET   /* 0xBF881698 */
  .extern C2FIFOCON13INV   /* 0xBF88169C */
  .extern C2FIFOINT13      /* 0xBF8816A0 */
  .extern C2FIFOINT13CLR   /* 0xBF8816A4 */
  .extern C2FIFOINT13SET   /* 0xBF8816A8 */
  .extern C2FIFOINT13INV   /* 0xBF8816AC */
  .extern C2FIFOUA13       /* 0xBF8816B0 */
  .extern C2FIFOUA13CLR    /* 0xBF8816B4 */
  .extern C2FIFOUA13SET    /* 0xBF8816B8 */
  .extern C2FIFOUA13INV    /* 0xBF8816BC */
  .extern C2FIFOCI13       /* 0xBF8816C0 */
  .extern C2FIFOCI13CLR    /* 0xBF8816C4 */
  .extern C2FIFOCI13SET    /* 0xBF8816C8 */
  .extern C2FIFOCI13INV    /* 0xBF8816CC */
  .extern C2FIFOCON14      /* 0xBF8816D0 */
  .extern C2FIFOCON14CLR   /* 0xBF8816D4 */
  .extern C2FIFOCON14SET   /* 0xBF8816D8 */
  .extern C2FIFOCON14INV   /* 0xBF8816DC */
  .extern C2FIFOINT14      /* 0xBF8816E0 */
  .extern C2FIFOINT14CLR   /* 0xBF8816E4 */
  .extern C2FIFOINT14SET   /* 0xBF8816E8 */
  .extern C2FIFOINT14INV   /* 0xBF8816EC */
  .extern C2FIFOUA14       /* 0xBF8816F0 */
  .extern C2FIFOUA14CLR    /* 0xBF8816F4 */
  .extern C2FIFOUA14SET    /* 0xBF8816F8 */
  .extern C2FIFOUA14INV    /* 0xBF8816FC */
  .extern C2FIFOCI14       /* 0xBF881700 */
  .extern C2FIFOCI14CLR    /* 0xBF881704 */
  .extern C2FIFOCI14SET    /* 0xBF881708 */
  .extern C2FIFOCI14INV    /* 0xBF88170C */
  .extern C2FIFOCON15      /* 0xBF881710 */
  .extern C2FIFOCON15CLR   /* 0xBF881714 */
  .extern C2FIFOCON15SET   /* 0xBF881718 */
  .extern C2FIFOCON15INV   /* 0xBF88171C */
  .extern C2FIFOINT15      /* 0xBF881720 */
  .extern C2FIFOINT15CLR   /* 0xBF881724 */
  .extern C2FIFOINT15SET   /* 0xBF881728 */
  .extern C2FIFOINT15INV   /* 0xBF88172C */
  .extern C2FIFOUA15       /* 0xBF881730 */
  .extern C2FIFOUA15CLR    /* 0xBF881734 */
  .extern C2FIFOUA15SET    /* 0xBF881738 */
  .extern C2FIFOUA15INV    /* 0xBF88173C */
  .extern C2FIFOCI15       /* 0xBF881740 */
  .extern C2FIFOCI15CLR    /* 0xBF881744 */
  .extern C2FIFOCI15SET    /* 0xBF881748 */
  .extern C2FIFOCI15INV    /* 0xBF88174C */
  .extern C3CON            /* 0xBF884000 */
  .extern C3CONCLR         /* 0xBF884004 */
  .extern C3CONSET         /* 0xBF884008 */
  .extern C3CONINV         /* 0xBF88400C */
  .extern C3CFG            /* 0xBF884010 */
  .extern C3CFGCLR         /* 0xBF884014 */
  .extern C3CFGSET         /* 0xBF884018 */
  .extern C3CFGINV         /* 0xBF88401C */
  .extern C3INT            /* 0xBF884020 */
  .extern C3INTCLR         /* 0xBF884024 */
  .extern C3INTSET         /* 0xBF884028 */
  .extern C3INTINV         /* 0xBF88402C */
  .extern C3VEC            /* 0xBF884030 */
  .extern C3VECCLR         /* 0xBF884034 */
  .extern C3VECSET         /* 0xBF884038 */
  .extern C3VECINV         /* 0xBF88403C */
  .extern C3TREC           /* 0xBF884040 */
  .extern C3TRECCLR        /* 0xBF884044 */
  .extern C3TRECSET        /* 0xBF884048 */
  .extern C3TRECINV        /* 0xBF88404C */
  .extern C3FSTAT          /* 0xBF884050 */
  .extern C3FSTATCLR       /* 0xBF884054 */
  .extern C3FSTATSET       /* 0xBF884058 */
  .extern C3FSTATINV       /* 0xBF88405C */
  .extern C3RXOVF          /* 0xBF884060 */
  .extern C3RXOVFCLR       /* 0xBF884064 */
  .extern C3RXOVFSET       /* 0xBF884068 */
  .extern C3RXOVFINV       /* 0xBF88406C */
  .extern C3TMR            /* 0xBF884070 */
  .extern C3TMRCLR         /* 0xBF884074 */
  .extern C3TMRSET         /* 0xBF884078 */
  .extern C3TMRINV         /* 0xBF88407C */
  .extern C3RXM0           /* 0xBF884080 */
  .extern C3RXM0CLR        /* 0xBF884084 */
  .extern C3RXM0SET        /* 0xBF884088 */
  .extern C3RXM0INV        /* 0xBF88408C */
  .extern C3RXM1           /* 0xBF884090 */
  .extern C3RXM1CLR        /* 0xBF884094 */
  .extern C3RXM1SET        /* 0xBF884098 */
  .extern C3RXM1INV        /* 0xBF88409C */
  .extern C3RXM2           /* 0xBF8840A0 */
  .extern C3RXM2CLR        /* 0xBF8840A4 */
  .extern C3RXM2SET        /* 0xBF8840A8 */
  .extern C3RXM2INV        /* 0xBF8840AC */
  .extern C3RXM3           /* 0xBF8840B0 */
  .extern C3RXM3CLR        /* 0xBF8840B4 */
  .extern C3RXM3SET        /* 0xBF8840B8 */
  .extern C3RXM3INV        /* 0xBF8840BC */
  .extern C3FLTCON0        /* 0xBF8840C0 */
  .extern C3FLTCON0CLR     /* 0xBF8840C4 */
  .extern C3FLTCON0SET     /* 0xBF8840C8 */
  .extern C3FLTCON0INV     /* 0xBF8840CC */
  .extern C3FLTCON1        /* 0xBF8840D0 */
  .extern C3FLTCON1CLR     /* 0xBF8840D4 */
  .extern C3FLTCON1SET     /* 0xBF8840D8 */
  .extern C3FLTCON1INV     /* 0xBF8840DC */
  .extern C3FLTCON2        /* 0xBF8840E0 */
  .extern C3FLTCON2CLR     /* 0xBF8840E4 */
  .extern C3FLTCON2SET     /* 0xBF8840E8 */
  .extern C3FLTCON2INV     /* 0xBF8840EC */
  .extern C3FLTCON3        /* 0xBF8840F0 */
  .extern C3FLTCON3CLR     /* 0xBF8840F4 */
  .extern C3FLTCON3SET     /* 0xBF8840F8 */
  .extern C3FLTCON3INV     /* 0xBF8840FC */
  .extern C3RXF0           /* 0xBF884140 */
  .extern C3RXF0CLR        /* 0xBF884144 */
  .extern C3RXF0SET        /* 0xBF884148 */
  .extern C3RXF0INV        /* 0xBF88414C */
  .extern C3RXF1           /* 0xBF884150 */
  .extern C3RXF1CLR        /* 0xBF884154 */
  .extern C3RXF1SET        /* 0xBF884158 */
  .extern C3RXF1INV        /* 0xBF88415C */
  .extern C3RXF2           /* 0xBF884160 */
  .extern C3RXF2CLR        /* 0xBF884164 */
  .extern C3RXF2SET        /* 0xBF884168 */
  .extern C3RXF2INV        /* 0xBF88416C */
  .extern C3RXF3           /* 0xBF884170 */
  .extern C3RXF3CLR        /* 0xBF884174 */
  .extern C3RXF3SET        /* 0xBF884178 */
  .extern C3RXF3INV        /* 0xBF88417C */
  .extern C3RXF4           /* 0xBF884180 */
  .extern C3RXF4CLR        /* 0xBF884184 */
  .extern C3RXF4SET        /* 0xBF884188 */
  .extern C3RXF4INV        /* 0xBF88418C */
  .extern C3RXF5           /* 0xBF884190 */
  .extern C3RXF5CLR        /* 0xBF884194 */
  .extern C3RXF5SET        /* 0xBF884198 */
  .extern C3RXF5INV        /* 0xBF88419C */
  .extern C3RXF6           /* 0xBF8841A0 */
  .extern C3RXF6CLR        /* 0xBF8841A4 */
  .extern C3RXF6SET        /* 0xBF8841A8 */
  .extern C3RXF6INV        /* 0xBF8841AC */
  .extern C3RXF7           /* 0xBF8841B0 */
  .extern C3RXF7CLR        /* 0xBF8841B4 */
  .extern C3RXF7SET        /* 0xBF8841B8 */
  .extern C3RXF7INV        /* 0xBF8841BC */
  .extern C3RXF8           /* 0xBF8841C0 */
  .extern C3RXF8CLR        /* 0xBF8841C4 */
  .extern C3RXF8SET        /* 0xBF8841C8 */
  .extern C3RXF8INV        /* 0xBF8841CC */
  .extern C3RXF9           /* 0xBF8841D0 */
  .extern C3RXF9CLR        /* 0xBF8841D4 */
  .extern C3RXF9SET        /* 0xBF8841D8 */
  .extern C3RXF9INV        /* 0xBF8841DC */
  .extern C3RXF10          /* 0xBF8841E0 */
  .extern C3RXF10CLR       /* 0xBF8841E4 */
  .extern C3RXF10SET       /* 0xBF8841E8 */
  .extern C3RXF10INV       /* 0xBF8841EC */
  .extern C3RXF11          /* 0xBF8841F0 */
  .extern C3RXF11CLR       /* 0xBF8841F4 */
  .extern C3RXF11SET       /* 0xBF8841F8 */
  .extern C3RXF11INV       /* 0xBF8841FC */
  .extern C3RXF12          /* 0xBF884200 */
  .extern C3RXF12CLR       /* 0xBF884204 */
  .extern C3RXF12SET       /* 0xBF884208 */
  .extern C3RXF12INV       /* 0xBF88420C */
  .extern C3RXF13          /* 0xBF884210 */
  .extern C3RXF13CLR       /* 0xBF884214 */
  .extern C3RXF13SET       /* 0xBF884218 */
  .extern C3RXF13INV       /* 0xBF88421C */
  .extern C3RXF14          /* 0xBF884220 */
  .extern C3RXF14CLR       /* 0xBF884224 */
  .extern C3RXF14SET       /* 0xBF884228 */
  .extern C3RXF14INV       /* 0xBF88422C */
  .extern C3RXF15          /* 0xBF884230 */
  .extern C3RXF15CLR       /* 0xBF884234 */
  .extern C3RXF15SET       /* 0xBF884238 */
  .extern C3RXF15INV       /* 0xBF88423C */
  .extern C3FIFOBA         /* 0xBF884340 */
  .extern C3FIFOBACLR      /* 0xBF884344 */
  .extern C3FIFOBASET      /* 0xBF884348 */
  .extern C3FIFOBAINV      /* 0xBF88434C */
  .extern C3FIFOCON0       /* 0xBF884350 */
  .extern C3FIFOCON0CLR    /* 0xBF884354 */
  .extern C3FIFOCON0SET    /* 0xBF884358 */
  .extern C3FIFOCON0INV    /* 0xBF88435C */
  .extern C3FIFOINT0       /* 0xBF884360 */
  .extern C3FIFOINT0CLR    /* 0xBF884364 */
  .extern C3FIFOINT0SET    /* 0xBF884368 */
  .extern C3FIFOINT0INV    /* 0xBF88436C */
  .extern C3FIFOUA0        /* 0xBF884370 */
  .extern C3FIFOUA0CLR     /* 0xBF884374 */
  .extern C3FIFOUA0SET     /* 0xBF884378 */
  .extern C3FIFOUA0INV     /* 0xBF88437C */
  .extern C3FIFOCI0        /* 0xBF884380 */
  .extern C3FIFOCI0CLR     /* 0xBF884384 */
  .extern C3FIFOCI0SET     /* 0xBF884388 */
  .extern C3FIFOCI0INV     /* 0xBF88438C */
  .extern C3FIFOCON1       /* 0xBF884390 */
  .extern C3FIFOCON1CLR    /* 0xBF884394 */
  .extern C3FIFOCON1SET    /* 0xBF884398 */
  .extern C3FIFOCON1INV    /* 0xBF88439C */
  .extern C3FIFOINT1       /* 0xBF8843A0 */
  .extern C3FIFOINT1CLR    /* 0xBF8843A4 */
  .extern C3FIFOINT1SET    /* 0xBF8843A8 */
  .extern C3FIFOINT1INV    /* 0xBF8843AC */
  .extern C3FIFOUA1        /* 0xBF8843B0 */
  .extern C3FIFOUA1CLR     /* 0xBF8843B4 */
  .extern C3FIFOUA1SET     /* 0xBF8843B8 */
  .extern C3FIFOUA1INV     /* 0xBF8843BC */
  .extern C3FIFOCI1        /* 0xBF8843C0 */
  .extern C3FIFOCI1CLR     /* 0xBF8843C4 */
  .extern C3FIFOCI1SET     /* 0xBF8843C8 */
  .extern C3FIFOCI1INV     /* 0xBF8843CC */
  .extern C3FIFOCON2       /* 0xBF8843D0 */
  .extern C3FIFOCON2CLR    /* 0xBF8843D4 */
  .extern C3FIFOCON2SET    /* 0xBF8843D8 */
  .extern C3FIFOCON2INV    /* 0xBF8843DC */
  .extern C3FIFOINT2       /* 0xBF8843E0 */
  .extern C3FIFOINT2CLR    /* 0xBF8843E4 */
  .extern C3FIFOINT2SET    /* 0xBF8843E8 */
  .extern C3FIFOINT2INV    /* 0xBF8843EC */
  .extern C3FIFOUA2        /* 0xBF8843F0 */
  .extern C3FIFOUA2CLR     /* 0xBF8843F4 */
  .extern C3FIFOUA2SET     /* 0xBF8843F8 */
  .extern C3FIFOUA2INV     /* 0xBF8843FC */
  .extern C3FIFOCI2        /* 0xBF884400 */
  .extern C3FIFOCI2CLR     /* 0xBF884404 */
  .extern C3FIFOCI2SET     /* 0xBF884408 */
  .extern C3FIFOCI2INV     /* 0xBF88440C */
  .extern C3FIFOCON3       /* 0xBF884410 */
  .extern C3FIFOCON3CLR    /* 0xBF884414 */
  .extern C3FIFOCON3SET    /* 0xBF884418 */
  .extern C3FIFOCON3INV    /* 0xBF88441C */
  .extern C3FIFOINT3       /* 0xBF884420 */
  .extern C3FIFOINT3CLR    /* 0xBF884424 */
  .extern C3FIFOINT3SET    /* 0xBF884428 */
  .extern C3FIFOINT3INV    /* 0xBF88442C */
  .extern C3FIFOUA3        /* 0xBF884430 */
  .extern C3FIFOUA3CLR     /* 0xBF884434 */
  .extern C3FIFOUA3SET     /* 0xBF884438 */
  .extern C3FIFOUA3INV     /* 0xBF88443C */
  .extern C3FIFOCI3        /* 0xBF884440 */
  .extern C3FIFOCI3CLR     /* 0xBF884444 */
  .extern C3FIFOCI3SET     /* 0xBF884448 */
  .extern C3FIFOCI3INV     /* 0xBF88444C */
  .extern C3FIFOCON4       /* 0xBF884450 */
  .extern C3FIFOCON4CLR    /* 0xBF884454 */
  .extern C3FIFOCON4SET    /* 0xBF884458 */
  .extern C3FIFOCON4INV    /* 0xBF88445C */
  .extern C3FIFOINT4       /* 0xBF884460 */
  .extern C3FIFOINT4CLR    /* 0xBF884464 */
  .extern C3FIFOINT4SET    /* 0xBF884468 */
  .extern C3FIFOINT4INV    /* 0xBF88446C */
  .extern C3FIFOUA4        /* 0xBF884470 */
  .extern C3FIFOUA4CLR     /* 0xBF884474 */
  .extern C3FIFOUA4SET     /* 0xBF884478 */
  .extern C3FIFOUA4INV     /* 0xBF88447C */
  .extern C3FIFOCI4        /* 0xBF884480 */
  .extern C3FIFOCI4CLR     /* 0xBF884484 */
  .extern C3FIFOCI4SET     /* 0xBF884488 */
  .extern C3FIFOCI4INV     /* 0xBF88448C */
  .extern C3FIFOCON5       /* 0xBF884490 */
  .extern C3FIFOCON5CLR    /* 0xBF884494 */
  .extern C3FIFOCON5SET    /* 0xBF884498 */
  .extern C3FIFOCON5INV    /* 0xBF88449C */
  .extern C3FIFOINT5       /* 0xBF8844A0 */
  .extern C3FIFOINT5CLR    /* 0xBF8844A4 */
  .extern C3FIFOINT5SET    /* 0xBF8844A8 */
  .extern C3FIFOINT5INV    /* 0xBF8844AC */
  .extern C3FIFOUA5        /* 0xBF8844B0 */
  .extern C3FIFOUA5CLR     /* 0xBF8844B4 */
  .extern C3FIFOUA5SET     /* 0xBF8844B8 */
  .extern C3FIFOUA5INV     /* 0xBF8844BC */
  .extern C3FIFOCI5        /* 0xBF8844C0 */
  .extern C3FIFOCI5CLR     /* 0xBF8844C4 */
  .extern C3FIFOCI5SET     /* 0xBF8844C8 */
  .extern C3FIFOCI5INV     /* 0xBF8844CC */
  .extern C3FIFOCON6       /* 0xBF8844D0 */
  .extern C3FIFOCON6CLR    /* 0xBF8844D4 */
  .extern C3FIFOCON6SET    /* 0xBF8844D8 */
  .extern C3FIFOCON6INV    /* 0xBF8844DC */
  .extern C3FIFOINT6       /* 0xBF8844E0 */
  .extern C3FIFOINT6CLR    /* 0xBF8844E4 */
  .extern C3FIFOINT6SET    /* 0xBF8844E8 */
  .extern C3FIFOINT6INV    /* 0xBF8844EC */
  .extern C3FIFOUA6        /* 0xBF8844F0 */
  .extern C3FIFOUA6CLR     /* 0xBF8844F4 */
  .extern C3FIFOUA6SET     /* 0xBF8844F8 */
  .extern C3FIFOUA6INV     /* 0xBF8844FC */
  .extern C3FIFOCI6        /* 0xBF884500 */
  .extern C3FIFOCI6CLR     /* 0xBF884504 */
  .extern C3FIFOCI6SET     /* 0xBF884508 */
  .extern C3FIFOCI6INV     /* 0xBF88450C */
  .extern C3FIFOCON7       /* 0xBF884510 */
  .extern C3FIFOCON7CLR    /* 0xBF884514 */
  .extern C3FIFOCON7SET    /* 0xBF884518 */
  .extern C3FIFOCON7INV    /* 0xBF88451C */
  .extern C3FIFOINT7       /* 0xBF884520 */
  .extern C3FIFOINT7CLR    /* 0xBF884524 */
  .extern C3FIFOINT7SET    /* 0xBF884528 */
  .extern C3FIFOINT7INV    /* 0xBF88452C */
  .extern C3FIFOUA7        /* 0xBF884530 */
  .extern C3FIFOUA7CLR     /* 0xBF884534 */
  .extern C3FIFOUA7SET     /* 0xBF884538 */
  .extern C3FIFOUA7INV     /* 0xBF88453C */
  .extern C3FIFOCI7        /* 0xBF884540 */
  .extern C3FIFOCI7CLR     /* 0xBF884544 */
  .extern C3FIFOCI7SET     /* 0xBF884548 */
  .extern C3FIFOCI7INV     /* 0xBF88454C */
  .extern C3FIFOCON8       /* 0xBF884550 */
  .extern C3FIFOCON8CLR    /* 0xBF884554 */
  .extern C3FIFOCON8SET    /* 0xBF884558 */
  .extern C3FIFOCON8INV    /* 0xBF88455C */
  .extern C3FIFOINT8       /* 0xBF884560 */
  .extern C3FIFOINT8CLR    /* 0xBF884564 */
  .extern C3FIFOINT8SET    /* 0xBF884568 */
  .extern C3FIFOINT8INV    /* 0xBF88456C */
  .extern C3FIFOUA8        /* 0xBF884570 */
  .extern C3FIFOUA8CLR     /* 0xBF884574 */
  .extern C3FIFOUA8SET     /* 0xBF884578 */
  .extern C3FIFOUA8INV     /* 0xBF88457C */
  .extern C3FIFOCI8        /* 0xBF884580 */
  .extern C3FIFOCI8CLR     /* 0xBF884584 */
  .extern C3FIFOCI8SET     /* 0xBF884588 */
  .extern C3FIFOCI8INV     /* 0xBF88458C */
  .extern C3FIFOCON9       /* 0xBF884590 */
  .extern C3FIFOCON9CLR    /* 0xBF884594 */
  .extern C3FIFOCON9SET    /* 0xBF884598 */
  .extern C3FIFOCON9INV    /* 0xBF88459C */
  .extern C3FIFOINT9       /* 0xBF8845A0 */
  .extern C3FIFOINT9CLR    /* 0xBF8845A4 */
  .extern C3FIFOINT9SET    /* 0xBF8845A8 */
  .extern C3FIFOINT9INV    /* 0xBF8845AC */
  .extern C3FIFOUA9        /* 0xBF8845B0 */
  .extern C3FIFOUA9CLR     /* 0xBF8845B4 */
  .extern C3FIFOUA9SET     /* 0xBF8845B8 */
  .extern C3FIFOUA9INV     /* 0xBF8845BC */
  .extern C3FIFOCI9        /* 0xBF8845C0 */
  .extern C3FIFOCI9CLR     /* 0xBF8845C4 */
  .extern C3FIFOCI9SET     /* 0xBF8845C8 */
  .extern C3FIFOCI9INV     /* 0xBF8845CC */
  .extern C3FIFOCON10      /* 0xBF8845D0 */
  .extern C3FIFOCON10CLR   /* 0xBF8845D4 */
  .extern C3FIFOCON10SET   /* 0xBF8845D8 */
  .extern C3FIFOCON10INV   /* 0xBF8845DC */
  .extern C3FIFOINT10      /* 0xBF8845E0 */
  .extern C3FIFOINT10CLR   /* 0xBF8845E4 */
  .extern C3FIFOINT10SET   /* 0xBF8845E8 */
  .extern C3FIFOINT10INV   /* 0xBF8845EC */
  .extern C3FIFOUA10       /* 0xBF8845F0 */
  .extern C3FIFOUA10CLR    /* 0xBF8845F4 */
  .extern C3FIFOUA10SET    /* 0xBF8845F8 */
  .extern C3FIFOUA10INV    /* 0xBF8845FC */
  .extern C3FIFOCI10       /* 0xBF884600 */
  .extern C3FIFOCI10CLR    /* 0xBF884604 */
  .extern C3FIFOCI10SET    /* 0xBF884608 */
