Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
#define _PMD6_REFO3MD_POSITION                   0x0000000A
#define _PMD6_REFO3MD_MASK                       0x00000400
#define _PMD6_REFO3MD_LENGTH                     0x00000001

#define _PMD6_REFO4MD_POSITION                   0x0000000B
#define _PMD6_REFO4MD_MASK                       0x00000800
#define _PMD6_REFO4MD_LENGTH                     0x00000001

#define _PMD6_PMPMD_POSITION                     0x00000010
#define _PMD6_PMPMD_MASK                         0x00010000
#define _PMD6_PMPMD_LENGTH                       0x00000001

#define _PMD6_QEI5MD_POSITION                    0x00000012
#define _PMD6_QEI5MD_MASK                        0x00040000
#define _PMD6_QEI5MD_LENGTH                      0x00000001

#define _PMD6_QEI6MD_POSITION                    0x00000013
#define _PMD6_QEI6MD_MASK                        0x00080000
#define _PMD6_QEI6MD_LENGTH                      0x00000001

#define _PMD6_QEI1MD_POSITION                    0x00000018
#define _PMD6_QEI1MD_MASK                        0x01000000
#define _PMD6_QEI1MD_LENGTH                      0x00000001

#define _PMD6_QEI2MD_POSITION                    0x00000019
#define _PMD6_QEI2MD_MASK                        0x02000000
#define _PMD6_QEI2MD_LENGTH                      0x00000001

#define _PMD6_QEI3MD_POSITION                    0x0000001A
#define _PMD6_QEI3MD_MASK                        0x04000000
#define _PMD6_QEI3MD_LENGTH                      0x00000001

#define _PMD6_QEI4MD_POSITION                    0x0000001B
#define _PMD6_QEI4MD_MASK                        0x08000000
#define _PMD6_QEI4MD_LENGTH                      0x00000001

#define _PMD7_DMAMD_POSITION                     0x00000004
#define _PMD7_DMAMD_MASK                         0x00000010
#define _PMD7_DMAMD_LENGTH                       0x00000001

#define _CFGPG_CPUPG_POSITION                    0x00000000
#define _CFGPG_CPUPG_MASK                        0x00000003
#define _CFGPG_CPUPG_LENGTH                      0x00000002

#define _CFGPG_DMAPG_POSITION                    0x00000004
#define _CFGPG_DMAPG_MASK                        0x00000030
#define _CFGPG_DMAPG_LENGTH                      0x00000002

#define _CFGPG_USB1PG_POSITION                   0x00000008
#define _CFGPG_USB1PG_MASK                       0x00000300
#define _CFGPG_USB1PG_LENGTH                     0x00000002

#define _CFGPG_USB2PG_POSITION                   0x0000000A
#define _CFGPG_USB2PG_MASK                       0x00000C00
#define _CFGPG_USB2PG_LENGTH                     0x00000002

#define _CFGPG_CAN1PG_POSITION                   0x0000000C
#define _CFGPG_CAN1PG_MASK                       0x00003000
#define _CFGPG_CAN1PG_LENGTH                     0x00000002

#define _CFGPG_CAN2PG_POSITION                   0x0000000E
#define _CFGPG_CAN2PG_MASK                       0x0000C000
#define _CFGPG_CAN2PG_LENGTH                     0x00000002

#define _CFGPG_CAN3PG_POSITION                   0x00000010
#define _CFGPG_CAN3PG_MASK                       0x00030000
#define _CFGPG_CAN3PG_LENGTH                     0x00000002

#define _CFGPG_CAN4PG_POSITION                   0x00000012
#define _CFGPG_CAN4PG_MASK                       0x000C0000
#define _CFGPG_CAN4PG_LENGTH                     0x00000002

#define _CFGPG_FCPG_POSITION                     0x00000016
#define _CFGPG_FCPG_MASK                         0x00C00000
#define _CFGPG_FCPG_LENGTH                       0x00000002

#define _CFGPG_ADCPG_POSITION                    0x00000018
#define _CFGPG_ADCPG_MASK                        0x03000000
#define _CFGPG_ADCPG_LENGTH                      0x00000002

#define _CFGCON2_EEWS_POSITION                   0x00000000
#define _CFGCON2_EEWS_MASK                       0x000000FF
#define _CFGCON2_EEWS_LENGTH                     0x00000008

#define _CFGCON2_ENPGA1_POSITION                 0x00000010
#define _CFGCON2_ENPGA1_MASK                     0x00010000
#define _CFGCON2_ENPGA1_LENGTH                   0x00000001

#define _CFGCON2_ENPGA2_POSITION                 0x00000011
#define _CFGCON2_ENPGA2_MASK                     0x00020000
#define _CFGCON2_ENPGA2_LENGTH                   0x00000001

#define _CFGCON2_ENPGA3_POSITION                 0x00000012
#define _CFGCON2_ENPGA3_MASK                     0x00040000
#define _CFGCON2_ENPGA3_LENGTH                   0x00000001

#define _CFGCON2_ENPGA5_POSITION                 0x00000014
#define _CFGCON2_ENPGA5_MASK                     0x00100000
#define _CFGCON2_ENPGA5_LENGTH                   0x00000001

#define _CHECON_PFMWS_POSITION                   0x00000000
#define _CHECON_PFMWS_MASK                       0x00000007
#define _CHECON_PFMWS_LENGTH                     0x00000003

#define _CHECON_PREFEN_POSITION                  0x00000004
#define _CHECON_PREFEN_MASK                      0x00000030
#define _CHECON_PREFEN_LENGTH                    0x00000002

#define _CHECON_PFMAWSEN_POSITION                0x00000008
#define _CHECON_PFMAWSEN_MASK                    0x00000100
#define _CHECON_PFMAWSEN_LENGTH                  0x00000001

#define _CHECON_CHEPERFEN_POSITION               0x0000000C
#define _CHECON_CHEPERFEN_MASK                   0x00001000
#define _CHECON_CHEPERFEN_LENGTH                 0x00000001

#define _CHECON_ICHECOH_POSITION                 0x00000010
#define _CHECON_ICHECOH_MASK                     0x00010000
#define _CHECON_ICHECOH_LENGTH                   0x00000001

#define _CHECON_DCHECOH_POSITION                 0x00000011
#define _CHECON_DCHECOH_MASK                     0x00020000
#define _CHECON_DCHECOH_LENGTH                   0x00000001

#define _CHECON_PERCHECOH_POSITION               0x00000012
#define _CHECON_PERCHECOH_MASK                   0x00040000
#define _CHECON_PERCHECOH_LENGTH                 0x00000001

#define _CHECON_ICHEINV_POSITION                 0x00000014
#define _CHECON_ICHEINV_MASK                     0x00100000
#define _CHECON_ICHEINV_LENGTH                   0x00000001

#define _CHECON_DCHEINV_POSITION                 0x00000015
#define _CHECON_DCHEINV_MASK                     0x00200000
#define _CHECON_DCHEINV_LENGTH                   0x00000001

