Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
#define _OCFBR_OCFBR_POSITION                    0x00000000
#define _OCFBR_OCFBR_MASK                        0x0000000F
#define _OCFBR_OCFBR_LENGTH                      0x00000004

#define _U1RXR_U1RXR_POSITION                    0x00000000
#define _U1RXR_U1RXR_MASK                        0x0000000F
#define _U1RXR_U1RXR_LENGTH                      0x00000004

#define _U1CTSR_U1CTSR_POSITION                  0x00000000
#define _U1CTSR_U1CTSR_MASK                      0x0000000F
#define _U1CTSR_U1CTSR_LENGTH                    0x00000004

#define _U2RXR_U2RXR_POSITION                    0x00000000
#define _U2RXR_U2RXR_MASK                        0x0000000F
#define _U2RXR_U2RXR_LENGTH                      0x00000004

#define _U2CTSR_U2CTSR_POSITION                  0x00000000
#define _U2CTSR_U2CTSR_MASK                      0x0000000F
#define _U2CTSR_U2CTSR_LENGTH                    0x00000004

#define _U3RXR_U3RXR_POSITION                    0x00000000
#define _U3RXR_U3RXR_MASK                        0x0000000F
#define _U3RXR_U3RXR_LENGTH                      0x00000004

#define _U3CTSR_U3CTSR_POSITION                  0x00000000
#define _U3CTSR_U3CTSR_MASK                      0x0000000F
#define _U3CTSR_U3CTSR_LENGTH                    0x00000004

#define _U4RXR_U4RXR_POSITION                    0x00000000
#define _U4RXR_U4RXR_MASK                        0x0000000F
#define _U4RXR_U4RXR_LENGTH                      0x00000004

#define _U4CTSR_U4CTSR_POSITION                  0x00000000
#define _U4CTSR_U4CTSR_MASK                      0x0000000F
#define _U4CTSR_U4CTSR_LENGTH                    0x00000004

#define _U5RXR_U5RXR_POSITION                    0x00000000
#define _U5RXR_U5RXR_MASK                        0x0000000F
#define _U5RXR_U5RXR_LENGTH                      0x00000004

#define _U5CTSR_U5CTSR_POSITION                  0x00000000
#define _U5CTSR_U5CTSR_MASK                      0x0000000F
#define _U5CTSR_U5CTSR_LENGTH                    0x00000004

#define _U6RXR_U6RXR_POSITION                    0x00000000
#define _U6RXR_U6RXR_MASK                        0x0000000F
#define _U6RXR_U6RXR_LENGTH                      0x00000004

#define _U6CTSR_U6CTSR_POSITION                  0x00000000
#define _U6CTSR_U6CTSR_MASK                      0x0000000F
#define _U6CTSR_U6CTSR_LENGTH                    0x00000004

#define _SDI1R_SDI1R_POSITION                    0x00000000
#define _SDI1R_SDI1R_MASK                        0x0000000F
#define _SDI1R_SDI1R_LENGTH                      0x00000004

#define _SS1R_SS1R_POSITION                      0x00000000
#define _SS1R_SS1R_MASK                          0x0000000F
#define _SS1R_SS1R_LENGTH                        0x00000004

#define _SDI2R_SDI2R_POSITION                    0x00000000
#define _SDI2R_SDI2R_MASK                        0x0000000F
#define _SDI2R_SDI2R_LENGTH                      0x00000004

#define _SS2R_SS2R_POSITION                      0x00000000
#define _SS2R_SS2R_MASK                          0x0000000F
#define _SS2R_SS2R_LENGTH                        0x00000004

#define _SCK3R_SCK3R_POSITION                    0x00000000
#define _SCK3R_SCK3R_MASK                        0x0000000F
#define _SCK3R_SCK3R_LENGTH                      0x00000004

#define _SDI3R_SDI3R_POSITION                    0x00000000
#define _SDI3R_SDI3R_MASK                        0x0000000F
#define _SDI3R_SDI3R_LENGTH                      0x00000004

#define _SS3R_SS3R_POSITION                      0x00000000
#define _SS3R_SS3R_MASK                          0x0000000F
#define _SS3R_SS3R_LENGTH                        0x00000004

#define _SCK4R_SCK4R_POSITION                    0x00000000
#define _SCK4R_SCK4R_MASK                        0x0000000F
#define _SCK4R_SCK4R_LENGTH                      0x00000004

#define _SDI4R_SDI4R_POSITION                    0x00000000
#define _SDI4R_SDI4R_MASK                        0x0000000F
#define _SDI4R_SDI4R_LENGTH                      0x00000004

#define _SS4R_SS4R_POSITION                      0x00000000
#define _SS4R_SS4R_MASK                          0x0000000F
#define _SS4R_SS4R_LENGTH                        0x00000004

#define _C1RXR_C1RXR_POSITION                    0x00000000
#define _C1RXR_C1RXR_MASK                        0x0000000F
#define _C1RXR_C1RXR_LENGTH                      0x00000004

#define _C2RXR_C2RXR_POSITION                    0x00000000
#define _C2RXR_C2RXR_MASK                        0x0000000F
#define _C2RXR_C2RXR_LENGTH                      0x00000004

#define _REFIR_REFIR_POSITION                    0x00000000
#define _REFIR_REFIR_MASK                        0x0000000F
#define _REFIR_REFIR_LENGTH                      0x00000004

#define _QEA1R_QEA1R_POSITION                    0x00000000
#define _QEA1R_QEA1R_MASK                        0x0000000F
#define _QEA1R_QEA1R_LENGTH                      0x00000004

#define _QEB1R_QEB1R_POSITION                    0x00000000
#define _QEB1R_QEB1R_MASK                        0x0000000F
#define _QEB1R_QEB1R_LENGTH                      0x00000004

#define _INDX1R_INDX1R_POSITION                  0x00000000
#define _INDX1R_INDX1R_MASK                      0x0000000F
#define _INDX1R_INDX1R_LENGTH                    0x00000004

#define _HOME1R_HOME1R_POSITION                  0x00000000
#define _HOME1R_HOME1R_MASK                      0x0000000F
#define _HOME1R_HOME1R_LENGTH                    0x00000004

#define _QEA2R_QEA2R_POSITION                    0x00000000
#define _QEA2R_QEA2R_MASK                        0x0000000F
#define _QEA2R_QEA2R_LENGTH                      0x00000004

#define _QEB2R_QEB2R_POSITION                    0x00000000
#define _QEB2R_QEB2R_MASK                        0x0000000F
#define _QEB2R_QEB2R_LENGTH                      0x00000004

#define _INDX2R_INDX2R_POSITION                  0x00000000
#define _INDX2R_INDX2R_MASK                      0x0000000F
#define _INDX2R_INDX2R_LENGTH                    0x00000004

#define _HOME2R_HOME2R_POSITION                  0x00000000
#define _HOME2R_HOME2R_MASK                      0x0000000F
#define _HOME2R_HOME2R_LENGTH                    0x00000004

