Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
#define _IFS7_PTGWDTIF_POSITION                  0x00000008
#define _IFS7_PTGWDTIF_MASK                      0x00000100
#define _IFS7_PTGWDTIF_LENGTH                    0x00000001

#define _IFS7_PTG0TR0_POSITION                   0x00000009
#define _IFS7_PTG0TR0_MASK                       0x00000200
#define _IFS7_PTG0TR0_LENGTH                     0x00000001

#define _IFS7_PTG0TR1_POSITION                   0x0000000A
#define _IFS7_PTG0TR1_MASK                       0x00000400
#define _IFS7_PTG0TR1_LENGTH                     0x00000001

#define _IFS7_PTG0TR2_POSITION                   0x0000000B
#define _IFS7_PTG0TR2_MASK                       0x00000800
#define _IFS7_PTG0TR2_LENGTH                     0x00000001

#define _IFS7_PTG0TR3_POSITION                   0x0000000C
#define _IFS7_PTG0TR3_MASK                       0x00001000
#define _IFS7_PTG0TR3_LENGTH                     0x00000001

#define _IFS7_PWM7IF_POSITION                    0x0000000E
#define _IFS7_PWM7IF_MASK                        0x00004000
#define _IFS7_PWM7IF_LENGTH                      0x00000001

#define _IFS7_PWM8IF_POSITION                    0x0000000F
#define _IFS7_PWM8IF_MASK                        0x00008000
#define _IFS7_PWM8IF_LENGTH                      0x00000001

#define _IFS7_PWM9IF_POSITION                    0x00000010
#define _IFS7_PWM9IF_MASK                        0x00010000
#define _IFS7_PWM9IF_LENGTH                      0x00000001

#define _IFS7_PWM10IF_POSITION                   0x00000011
#define _IFS7_PWM10IF_MASK                       0x00020000
#define _IFS7_PWM10IF_LENGTH                     0x00000001

#define _IFS7_PWM11IF_POSITION                   0x00000012
#define _IFS7_PWM11IF_MASK                       0x00040000
#define _IFS7_PWM11IF_LENGTH                     0x00000001

#define _IFS7_PWM12IF_POSITION                   0x00000013
#define _IFS7_PWM12IF_MASK                       0x00080000
#define _IFS7_PWM12IF_LENGTH                     0x00000001

#define _IFS7_USB2IF_POSITION                    0x00000014
#define _IFS7_USB2IF_MASK                        0x00100000
#define _IFS7_USB2IF_LENGTH                      0x00000001

#define _IFS7_AD1DC3IF_POSITION                  0x00000015
#define _IFS7_AD1DC3IF_MASK                      0x00200000
#define _IFS7_AD1DC3IF_LENGTH                    0x00000001

#define _IFS7_AD1DC4IF_POSITION                  0x00000016
#define _IFS7_AD1DC4IF_MASK                      0x00400000
#define _IFS7_AD1DC4IF_LENGTH                    0x00000001

#define _IFS7_CPCIF_POSITION                     0x0000001E
#define _IFS7_CPCIF_MASK                         0x40000000
#define _IFS7_CPCIF_LENGTH                       0x00000001

#define _IFS7_CFDCIF_POSITION                    0x0000001F
#define _IFS7_CFDCIF_MASK                        0x80000000
#define _IFS7_CFDCIF_LENGTH                      0x00000001

#define _IFS7_w_POSITION                         0x00000000
#define _IFS7_w_MASK                             0xFFFFFFFF
#define _IFS7_w_LENGTH                           0x00000020

#define _IEC0_CTIE_POSITION                      0x00000000
#define _IEC0_CTIE_MASK                          0x00000001
#define _IEC0_CTIE_LENGTH                        0x00000001

#define _IEC0_CS0IE_POSITION                     0x00000001
#define _IEC0_CS0IE_MASK                         0x00000002
#define _IEC0_CS0IE_LENGTH                       0x00000001

#define _IEC0_CS1IE_POSITION                     0x00000002
#define _IEC0_CS1IE_MASK                         0x00000004
#define _IEC0_CS1IE_LENGTH                       0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000003
#define _IEC0_INT0IE_MASK                        0x00000008
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_T1IE_POSITION                      0x00000004
#define _IEC0_T1IE_MASK                          0x00000010
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_IC1EIE_POSITION                    0x00000005
#define _IEC0_IC1EIE_MASK                        0x00000020
#define _IEC0_IC1EIE_LENGTH                      0x00000001

#define _IEC0_IC1IE_POSITION                     0x00000006
#define _IEC0_IC1IE_MASK                         0x00000040
#define _IEC0_IC1IE_LENGTH                       0x00000001

#define _IEC0_OC1IE_POSITION                     0x00000007
#define _IEC0_OC1IE_MASK                         0x00000080
#define _IEC0_OC1IE_LENGTH                       0x00000001

#define _IEC0_INT1IE_POSITION                    0x00000008
#define _IEC0_INT1IE_MASK                        0x00000100
#define _IEC0_INT1IE_LENGTH                      0x00000001

#define _IEC0_T2IE_POSITION                      0x00000009
#define _IEC0_T2IE_MASK                          0x00000200
#define _IEC0_T2IE_LENGTH                        0x00000001

#define _IEC0_IC2EIE_POSITION                    0x0000000A
#define _IEC0_IC2EIE_MASK                        0x00000400
#define _IEC0_IC2EIE_LENGTH                      0x00000001

#define _IEC0_IC2IE_POSITION                     0x0000000B
#define _IEC0_IC2IE_MASK                         0x00000800
#define _IEC0_IC2IE_LENGTH                       0x00000001

#define _IEC0_OC2IE_POSITION                     0x0000000C
#define _IEC0_OC2IE_MASK                         0x00001000
#define _IEC0_OC2IE_LENGTH                       0x00000001

#define _IEC0_INT2IE_POSITION                    0x0000000D
#define _IEC0_INT2IE_MASK                        0x00002000
#define _IEC0_INT2IE_LENGTH                      0x00000001

#define _IEC0_T3IE_POSITION                      0x0000000E
#define _IEC0_T3IE_MASK                          0x00004000
#define _IEC0_T3IE_LENGTH                        0x00000001

#define _IEC0_IC3EIE_POSITION                    0x0000000F
#define _IEC0_IC3EIE_MASK                        0x00008000
#define _IEC0_IC3EIE_LENGTH                      0x00000001

#define _IEC0_IC3IE_POSITION                     0x00000010
#define _IEC0_IC3IE_MASK                         0x00010000
#define _IEC0_IC3IE_LENGTH                       0x00000001

#define _IEC0_OC3IE_POSITION                     0x00000011
#define _IEC0_OC3IE_MASK                         0x00020000
#define _IEC0_OC3IE_LENGTH                       0x00000001

