Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
#define _OFF180_VOFF_POSITION                    0x00000001
#define _OFF180_VOFF_MASK                        0x0003FFFE
#define _OFF180_VOFF_LENGTH                      0x00000011

#define _OFF181_VOFF_POSITION                    0x00000001
#define _OFF181_VOFF_MASK                        0x0003FFFE
#define _OFF181_VOFF_LENGTH                      0x00000011

#define _OFF182_VOFF_POSITION                    0x00000001
#define _OFF182_VOFF_MASK                        0x0003FFFE
#define _OFF182_VOFF_LENGTH                      0x00000011

#define _OFF183_VOFF_POSITION                    0x00000001
#define _OFF183_VOFF_MASK                        0x0003FFFE
#define _OFF183_VOFF_LENGTH                      0x00000011

#define _OFF184_VOFF_POSITION                    0x00000001
#define _OFF184_VOFF_MASK                        0x0003FFFE
#define _OFF184_VOFF_LENGTH                      0x00000011

#define _OFF185_VOFF_POSITION                    0x00000001
#define _OFF185_VOFF_MASK                        0x0003FFFE
#define _OFF185_VOFF_LENGTH                      0x00000011

#define _OFF186_VOFF_POSITION                    0x00000001
#define _OFF186_VOFF_MASK                        0x0003FFFE
#define _OFF186_VOFF_LENGTH                      0x00000011

#define _OFF187_VOFF_POSITION                    0x00000001
#define _OFF187_VOFF_MASK                        0x0003FFFE
#define _OFF187_VOFF_LENGTH                      0x00000011

#define _OFF188_VOFF_POSITION                    0x00000001
#define _OFF188_VOFF_MASK                        0x0003FFFE
#define _OFF188_VOFF_LENGTH                      0x00000011

#define _OFF189_VOFF_POSITION                    0x00000001
#define _OFF189_VOFF_MASK                        0x0003FFFE
#define _OFF189_VOFF_LENGTH                      0x00000011

#define _OFF190_VOFF_POSITION                    0x00000001
#define _OFF190_VOFF_MASK                        0x0003FFFE
#define _OFF190_VOFF_LENGTH                      0x00000011

#define _OFF191_VOFF_POSITION                    0x00000001
#define _OFF191_VOFF_MASK                        0x0003FFFE
#define _OFF191_VOFF_LENGTH                      0x00000011

#define _OFF192_VOFF_POSITION                    0x00000001
#define _OFF192_VOFF_MASK                        0x0003FFFE
#define _OFF192_VOFF_LENGTH                      0x00000011

#define _OFF194_VOFF_POSITION                    0x00000001
#define _OFF194_VOFF_MASK                        0x0003FFFE
#define _OFF194_VOFF_LENGTH                      0x00000011

#define _OFF195_VOFF_POSITION                    0x00000001
#define _OFF195_VOFF_MASK                        0x0003FFFE
#define _OFF195_VOFF_LENGTH                      0x00000011

#define _OFF196_VOFF_POSITION                    0x00000001
#define _OFF196_VOFF_MASK                        0x0003FFFE
#define _OFF196_VOFF_LENGTH                      0x00000011

#define _OFF197_VOFF_POSITION                    0x00000001
#define _OFF197_VOFF_MASK                        0x0003FFFE
#define _OFF197_VOFF_LENGTH                      0x00000011

#define _OFF198_VOFF_POSITION                    0x00000001
#define _OFF198_VOFF_MASK                        0x0003FFFE
#define _OFF198_VOFF_LENGTH                      0x00000011

#define _OFF199_VOFF_POSITION                    0x00000001
#define _OFF199_VOFF_MASK                        0x0003FFFE
#define _OFF199_VOFF_LENGTH                      0x00000011

#define _OFF200_VOFF_POSITION                    0x00000001
#define _OFF200_VOFF_MASK                        0x0003FFFE
#define _OFF200_VOFF_LENGTH                      0x00000011

#define _OFF201_VOFF_POSITION                    0x00000001
#define _OFF201_VOFF_MASK                        0x0003FFFE
#define _OFF201_VOFF_LENGTH                      0x00000011

#define _OFF202_VOFF_POSITION                    0x00000001
#define _OFF202_VOFF_MASK                        0x0003FFFE
#define _OFF202_VOFF_LENGTH                      0x00000011

#define _OFF203_VOFF_POSITION                    0x00000001
#define _OFF203_VOFF_MASK                        0x0003FFFE
#define _OFF203_VOFF_LENGTH                      0x00000011

#define _OFF204_VOFF_POSITION                    0x00000001
#define _OFF204_VOFF_MASK                        0x0003FFFE
#define _OFF204_VOFF_LENGTH                      0x00000011

#define _OFF205_VOFF_POSITION                    0x00000001
#define _OFF205_VOFF_MASK                        0x0003FFFE
#define _OFF205_VOFF_LENGTH                      0x00000011

#define _OFF206_VOFF_POSITION                    0x00000001
#define _OFF206_VOFF_MASK                        0x0003FFFE
#define _OFF206_VOFF_LENGTH                      0x00000011

#define _OFF207_VOFF_POSITION                    0x00000001
#define _OFF207_VOFF_MASK                        0x0003FFFE
#define _OFF207_VOFF_LENGTH                      0x00000011

#define _OFF208_VOFF_POSITION                    0x00000001
#define _OFF208_VOFF_MASK                        0x0003FFFE
#define _OFF208_VOFF_LENGTH                      0x00000011

#define _OFF209_VOFF_POSITION                    0x00000001
#define _OFF209_VOFF_MASK                        0x0003FFFE
#define _OFF209_VOFF_LENGTH                      0x00000011

#define _OFF210_VOFF_POSITION                    0x00000001
#define _OFF210_VOFF_MASK                        0x0003FFFE
#define _OFF210_VOFF_LENGTH                      0x00000011

#define _OFF211_VOFF_POSITION                    0x00000001
#define _OFF211_VOFF_MASK                        0x0003FFFE
#define _OFF211_VOFF_LENGTH                      0x00000011

#define _OFF212_VOFF_POSITION                    0x00000001
#define _OFF212_VOFF_MASK                        0x0003FFFE
#define _OFF212_VOFF_LENGTH                      0x00000011

#define _OFF213_VOFF_POSITION                    0x00000001
#define _OFF213_VOFF_MASK                        0x0003FFFE
#define _OFF213_VOFF_LENGTH                      0x00000011

#define _OFF214_VOFF_POSITION                    0x00000001
#define _OFF214_VOFF_MASK                        0x0003FFFE
#define _OFF214_VOFF_LENGTH                      0x00000011

#define _OFF215_VOFF_POSITION                    0x00000001
#define _OFF215_VOFF_MASK                        0x0003FFFE
#define _OFF215_VOFF_LENGTH                      0x00000011

