Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
#define _PWMCON1_PWMLIF_POSITION                 0x0000001C
#define _PWMCON1_PWMLIF_MASK                     0x10000000
#define _PWMCON1_PWMLIF_LENGTH                   0x00000001

#define _PWMCON1_TRGIF_POSITION                  0x0000001D
#define _PWMCON1_TRGIF_MASK                      0x20000000
#define _PWMCON1_TRGIF_LENGTH                    0x00000001

#define _PWMCON1_CLIF_POSITION                   0x0000001E
#define _PWMCON1_CLIF_MASK                       0x40000000
#define _PWMCON1_CLIF_LENGTH                     0x00000001

#define _PWMCON1_FLTIF_POSITION                  0x0000001F
#define _PWMCON1_FLTIF_MASK                      0x80000000
#define _PWMCON1_FLTIF_LENGTH                    0x00000001

#define _IOCON1_OSYNC_POSITION                   0x00000000
#define _IOCON1_OSYNC_MASK                       0x00000001
#define _IOCON1_OSYNC_LENGTH                     0x00000001

#define _IOCON1_SWAP_POSITION                    0x00000001
#define _IOCON1_SWAP_MASK                        0x00000002
#define _IOCON1_SWAP_LENGTH                      0x00000001

#define _IOCON1_CLDAT_POSITION                   0x00000002
#define _IOCON1_CLDAT_MASK                       0x0000000C
#define _IOCON1_CLDAT_LENGTH                     0x00000002

#define _IOCON1_FLTDAT_POSITION                  0x00000004
#define _IOCON1_FLTDAT_MASK                      0x00000030
#define _IOCON1_FLTDAT_LENGTH                    0x00000002

#define _IOCON1_OVRDAT_POSITION                  0x00000006
#define _IOCON1_OVRDAT_MASK                      0x000000C0
#define _IOCON1_OVRDAT_LENGTH                    0x00000002

#define _IOCON1_OVRENL_POSITION                  0x00000008
#define _IOCON1_OVRENL_MASK                      0x00000100
#define _IOCON1_OVRENL_LENGTH                    0x00000001

#define _IOCON1_OVRENH_POSITION                  0x00000009
#define _IOCON1_OVRENH_MASK                      0x00000200
#define _IOCON1_OVRENH_LENGTH                    0x00000001

#define _IOCON1_PMOD_POSITION                    0x0000000A
#define _IOCON1_PMOD_MASK                        0x00000C00
#define _IOCON1_PMOD_LENGTH                      0x00000002

#define _IOCON1_POLL_POSITION                    0x0000000C
#define _IOCON1_POLL_MASK                        0x00001000
#define _IOCON1_POLL_LENGTH                      0x00000001

#define _IOCON1_POLH_POSITION                    0x0000000D
#define _IOCON1_POLH_MASK                        0x00002000
#define _IOCON1_POLH_LENGTH                      0x00000001

#define _IOCON1_PENL_POSITION                    0x0000000E
#define _IOCON1_PENL_MASK                        0x00004000
#define _IOCON1_PENL_LENGTH                      0x00000001

#define _IOCON1_PENH_POSITION                    0x0000000F
#define _IOCON1_PENH_MASK                        0x00008000
#define _IOCON1_PENH_LENGTH                      0x00000001

#define _IOCON1_FLTMOD_POSITION                  0x00000010
#define _IOCON1_FLTMOD_MASK                      0x00030000
#define _IOCON1_FLTMOD_LENGTH                    0x00000002

#define _IOCON1_FLTPOL_POSITION                  0x00000012
#define _IOCON1_FLTPOL_MASK                      0x00040000
#define _IOCON1_FLTPOL_LENGTH                    0x00000001

#define _IOCON1_FLTSRC_POSITION                  0x00000013
#define _IOCON1_FLTSRC_MASK                      0x00780000
#define _IOCON1_FLTSRC_LENGTH                    0x00000004

#define _IOCON1_CLMOD_POSITION                   0x00000018
#define _IOCON1_CLMOD_MASK                       0x01000000
#define _IOCON1_CLMOD_LENGTH                     0x00000001

#define _IOCON1_CLPOL_POSITION                   0x00000019
#define _IOCON1_CLPOL_MASK                       0x02000000
#define _IOCON1_CLPOL_LENGTH                     0x00000001

#define _IOCON1_CLSRC_POSITION                   0x0000001A
#define _IOCON1_CLSRC_MASK                       0x3C000000
#define _IOCON1_CLSRC_LENGTH                     0x00000004

#define _PDC1_PDC_POSITION                       0x00000000
#define _PDC1_PDC_MASK                           0x0000FFFF
#define _PDC1_PDC_LENGTH                         0x00000010

#define _SDC1_SDC_POSITION                       0x00000000
#define _SDC1_SDC_MASK                           0x0000FFFF
#define _SDC1_SDC_LENGTH                         0x00000010

#define _PHASE1_PHASE_POSITION                   0x00000000
#define _PHASE1_PHASE_MASK                       0x0000FFFF
#define _PHASE1_PHASE_LENGTH                     0x00000010

#define _DTR1_DTR_POSITION                       0x00000000
#define _DTR1_DTR_MASK                           0x0000FFFF
#define _DTR1_DTR_LENGTH                         0x00000010

#define _ALTDTR1_ALTDTR_POSITION                 0x00000000
#define _ALTDTR1_ALTDTR_MASK                     0x0000FFFF
#define _ALTDTR1_ALTDTR_LENGTH                   0x00000010

#define _DTCOMP1_COMP_POSITION                   0x00000000
#define _DTCOMP1_COMP_MASK                       0x00003FFF
#define _DTCOMP1_COMP_LENGTH                     0x0000000E

#define _TRIG1_TRGCMP_POSITION                   0x00000000
#define _TRIG1_TRGCMP_MASK                       0x0000FFFF
#define _TRIG1_TRGCMP_LENGTH                     0x00000010

#define _TRGCON1_STRGIS_POSITION                 0x00000006
#define _TRGCON1_STRGIS_MASK                     0x00000040
#define _TRGCON1_STRGIS_LENGTH                   0x00000001

#define _TRGCON1_DTM_POSITION                    0x00000007
#define _TRGCON1_DTM_MASK                        0x00000080
#define _TRGCON1_DTM_LENGTH                      0x00000001

#define _TRGCON1_STRGSEL_POSITION                0x00000008
#define _TRGCON1_STRGSEL_MASK                    0x00000300
#define _TRGCON1_STRGSEL_LENGTH                  0x00000002

#define _TRGCON1_TRGSEL_POSITION                 0x0000000A
#define _TRGCON1_TRGSEL_MASK                     0x00000C00
#define _TRGCON1_TRGSEL_LENGTH                   0x00000002

#define _TRGCON1_TRGDIV_POSITION                 0x0000000C
#define _TRGCON1_TRGDIV_MASK                     0x0000F000
#define _TRGCON1_TRGDIV_LENGTH                   0x00000004

#define _STRIG1_STRGCMP_POSITION                 0x00000000
#define _STRIG1_STRGCMP_MASK                     0x0000FFFF
#define _STRIG1_STRGCMP_LENGTH                   0x00000010

#define _CAP1_CAP_POSITION                       0x00000000
#define _CAP1_CAP_MASK                           0x0000FFFF
#define _CAP1_CAP_LENGTH                         0x00000010

#define _LEBCON1_CLLEBEN_POSITION                0x0000000A
#define _LEBCON1_CLLEBEN_MASK                    0x00000400
#define _LEBCON1_CLLEBEN_LENGTH                  0x00000001

