Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
#define _C1FIFOINT6_TXHALFIE_POSITION            0x00000019
#define _C1FIFOINT6_TXHALFIE_MASK                0x02000000
#define _C1FIFOINT6_TXHALFIE_LENGTH              0x00000001

#define _C1FIFOINT6_TXNFULLIE_POSITION           0x0000001A
#define _C1FIFOINT6_TXNFULLIE_MASK               0x04000000
#define _C1FIFOINT6_TXNFULLIE_LENGTH             0x00000001

#define _C1FIFOINT6_w_POSITION                   0x00000000
#define _C1FIFOINT6_w_MASK                       0xFFFFFFFF
#define _C1FIFOINT6_w_LENGTH                     0x00000020

#define _C1FIFOCI6_CFIFOCI_POSITION              0x00000000
#define _C1FIFOCI6_CFIFOCI_MASK                  0x0000001F
#define _C1FIFOCI6_CFIFOCI_LENGTH                0x00000005

#define _C1FIFOCI6_w_POSITION                    0x00000000
#define _C1FIFOCI6_w_MASK                        0xFFFFFFFF
#define _C1FIFOCI6_w_LENGTH                      0x00000020

#define _C1FIFOCON7_TXPRI_POSITION               0x00000000
#define _C1FIFOCON7_TXPRI_MASK                   0x00000003
#define _C1FIFOCON7_TXPRI_LENGTH                 0x00000002

#define _C1FIFOCON7_RTREN_POSITION               0x00000002
#define _C1FIFOCON7_RTREN_MASK                   0x00000004
#define _C1FIFOCON7_RTREN_LENGTH                 0x00000001

#define _C1FIFOCON7_TXREQ_POSITION               0x00000003
#define _C1FIFOCON7_TXREQ_MASK                   0x00000008
#define _C1FIFOCON7_TXREQ_LENGTH                 0x00000001

#define _C1FIFOCON7_TXERR_POSITION               0x00000004
#define _C1FIFOCON7_TXERR_MASK                   0x00000010
#define _C1FIFOCON7_TXERR_LENGTH                 0x00000001

#define _C1FIFOCON7_TXLARB_POSITION              0x00000005
#define _C1FIFOCON7_TXLARB_MASK                  0x00000020
#define _C1FIFOCON7_TXLARB_LENGTH                0x00000001

#define _C1FIFOCON7_TXABAT_POSITION              0x00000006
#define _C1FIFOCON7_TXABAT_MASK                  0x00000040
#define _C1FIFOCON7_TXABAT_LENGTH                0x00000001

#define _C1FIFOCON7_TXEN_POSITION                0x00000007
#define _C1FIFOCON7_TXEN_MASK                    0x00000080
#define _C1FIFOCON7_TXEN_LENGTH                  0x00000001

#define _C1FIFOCON7_DONLY_POSITION               0x0000000C
#define _C1FIFOCON7_DONLY_MASK                   0x00001000
#define _C1FIFOCON7_DONLY_LENGTH                 0x00000001

#define _C1FIFOCON7_UINC_POSITION                0x0000000D
#define _C1FIFOCON7_UINC_MASK                    0x00002000
#define _C1FIFOCON7_UINC_LENGTH                  0x00000001

#define _C1FIFOCON7_FRESET_POSITION              0x0000000E
#define _C1FIFOCON7_FRESET_MASK                  0x00004000
#define _C1FIFOCON7_FRESET_LENGTH                0x00000001

#define _C1FIFOCON7_FSIZE_POSITION               0x00000010
#define _C1FIFOCON7_FSIZE_MASK                   0x001F0000
#define _C1FIFOCON7_FSIZE_LENGTH                 0x00000005

#define _C1FIFOCON7_w_POSITION                   0x00000000
#define _C1FIFOCON7_w_MASK                       0xFFFFFFFF
#define _C1FIFOCON7_w_LENGTH                     0x00000020

#define _C1FIFOINT7_RXNEMPTYIF_POSITION          0x00000000
#define _C1FIFOINT7_RXNEMPTYIF_MASK              0x00000001
#define _C1FIFOINT7_RXNEMPTYIF_LENGTH            0x00000001

#define _C1FIFOINT7_RXHALFIF_POSITION            0x00000001
#define _C1FIFOINT7_RXHALFIF_MASK                0x00000002
#define _C1FIFOINT7_RXHALFIF_LENGTH              0x00000001

#define _C1FIFOINT7_RXFULLIF_POSITION            0x00000002
#define _C1FIFOINT7_RXFULLIF_MASK                0x00000004
#define _C1FIFOINT7_RXFULLIF_LENGTH              0x00000001

#define _C1FIFOINT7_RXOVFLIF_POSITION            0x00000003
#define _C1FIFOINT7_RXOVFLIF_MASK                0x00000008
#define _C1FIFOINT7_RXOVFLIF_LENGTH              0x00000001

#define _C1FIFOINT7_TXEMPTYIF_POSITION           0x00000008
#define _C1FIFOINT7_TXEMPTYIF_MASK               0x00000100
#define _C1FIFOINT7_TXEMPTYIF_LENGTH             0x00000001

#define _C1FIFOINT7_TXHALFIF_POSITION            0x00000009
#define _C1FIFOINT7_TXHALFIF_MASK                0x00000200
#define _C1FIFOINT7_TXHALFIF_LENGTH              0x00000001

#define _C1FIFOINT7_TXNFULLIF_POSITION           0x0000000A
#define _C1FIFOINT7_TXNFULLIF_MASK               0x00000400
#define _C1FIFOINT7_TXNFULLIF_LENGTH             0x00000001

#define _C1FIFOINT7_RXNEMPTYIE_POSITION          0x00000010
#define _C1FIFOINT7_RXNEMPTYIE_MASK              0x00010000
#define _C1FIFOINT7_RXNEMPTYIE_LENGTH            0x00000001

#define _C1FIFOINT7_RXHALFIE_POSITION            0x00000011
#define _C1FIFOINT7_RXHALFIE_MASK                0x00020000
#define _C1FIFOINT7_RXHALFIE_LENGTH              0x00000001

#define _C1FIFOINT7_RXFULLIE_POSITION            0x00000012
#define _C1FIFOINT7_RXFULLIE_MASK                0x00040000
#define _C1FIFOINT7_RXFULLIE_LENGTH              0x00000001

#define _C1FIFOINT7_RXOVFLIE_POSITION            0x00000013
#define _C1FIFOINT7_RXOVFLIE_MASK                0x00080000
#define _C1FIFOINT7_RXOVFLIE_LENGTH              0x00000001

#define _C1FIFOINT7_TXEMPTYIE_POSITION           0x00000018
#define _C1FIFOINT7_TXEMPTYIE_MASK               0x01000000
#define _C1FIFOINT7_TXEMPTYIE_LENGTH             0x00000001

#define _C1FIFOINT7_TXHALFIE_POSITION            0x00000019
#define _C1FIFOINT7_TXHALFIE_MASK                0x02000000
#define _C1FIFOINT7_TXHALFIE_LENGTH              0x00000001

#define _C1FIFOINT7_TXNFULLIE_POSITION           0x0000001A
#define _C1FIFOINT7_TXNFULLIE_MASK               0x04000000
#define _C1FIFOINT7_TXNFULLIE_LENGTH             0x00000001

#define _C1FIFOINT7_w_POSITION                   0x00000000
#define _C1FIFOINT7_w_MASK                       0xFFFFFFFF
#define _C1FIFOINT7_w_LENGTH                     0x00000020

#define _C1FIFOCI7_CFIFOCI_POSITION              0x00000000
#define _C1FIFOCI7_CFIFOCI_MASK                  0x0000001F
#define _C1FIFOCI7_CFIFOCI_LENGTH                0x00000005

#define _C1FIFOCI7_w_POSITION                    0x00000000
#define _C1FIFOCI7_w_MASK                        0xFFFFFFFF
#define _C1FIFOCI7_w_LENGTH                      0x00000020

