Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
#define _ADCCSS1_CSS4_POSITION                   0x00000004
#define _ADCCSS1_CSS4_MASK                       0x00000010
#define _ADCCSS1_CSS4_LENGTH                     0x00000001

#define _ADCCSS1_CSS5_POSITION                   0x00000005
#define _ADCCSS1_CSS5_MASK                       0x00000020
#define _ADCCSS1_CSS5_LENGTH                     0x00000001

#define _ADCCSS1_CSS6_POSITION                   0x00000006
#define _ADCCSS1_CSS6_MASK                       0x00000040
#define _ADCCSS1_CSS6_LENGTH                     0x00000001

#define _ADCCSS1_CSS7_POSITION                   0x00000007
#define _ADCCSS1_CSS7_MASK                       0x00000080
#define _ADCCSS1_CSS7_LENGTH                     0x00000001

#define _ADCCSS1_CSS8_POSITION                   0x00000008
#define _ADCCSS1_CSS8_MASK                       0x00000100
#define _ADCCSS1_CSS8_LENGTH                     0x00000001

#define _ADCCSS1_CSS9_POSITION                   0x00000009
#define _ADCCSS1_CSS9_MASK                       0x00000200
#define _ADCCSS1_CSS9_LENGTH                     0x00000001

#define _ADCCSS1_CSS10_POSITION                  0x0000000A
#define _ADCCSS1_CSS10_MASK                      0x00000400
#define _ADCCSS1_CSS10_LENGTH                    0x00000001

#define _ADCCSS1_CSS11_POSITION                  0x0000000B
#define _ADCCSS1_CSS11_MASK                      0x00000800
#define _ADCCSS1_CSS11_LENGTH                    0x00000001

#define _ADCCSS1_CSS12_POSITION                  0x0000000C
#define _ADCCSS1_CSS12_MASK                      0x00001000
#define _ADCCSS1_CSS12_LENGTH                    0x00000001

#define _ADCCSS1_CSS13_POSITION                  0x0000000D
#define _ADCCSS1_CSS13_MASK                      0x00002000
#define _ADCCSS1_CSS13_LENGTH                    0x00000001

#define _ADCCSS1_CSS14_POSITION                  0x0000000E
#define _ADCCSS1_CSS14_MASK                      0x00004000
#define _ADCCSS1_CSS14_LENGTH                    0x00000001

#define _ADCCSS1_CSS15_POSITION                  0x0000000F
#define _ADCCSS1_CSS15_MASK                      0x00008000
#define _ADCCSS1_CSS15_LENGTH                    0x00000001

#define _ADCCSS1_CSS16_POSITION                  0x00000010
#define _ADCCSS1_CSS16_MASK                      0x00010000
#define _ADCCSS1_CSS16_LENGTH                    0x00000001

#define _ADCCSS1_CSS17_POSITION                  0x00000011
#define _ADCCSS1_CSS17_MASK                      0x00020000
#define _ADCCSS1_CSS17_LENGTH                    0x00000001

#define _ADCCSS1_CSS18_POSITION                  0x00000012
#define _ADCCSS1_CSS18_MASK                      0x00040000
#define _ADCCSS1_CSS18_LENGTH                    0x00000001

#define _ADCCSS1_CSS19_POSITION                  0x00000013
#define _ADCCSS1_CSS19_MASK                      0x00080000
#define _ADCCSS1_CSS19_LENGTH                    0x00000001

#define _ADCCSS1_CSS24_POSITION                  0x00000018
#define _ADCCSS1_CSS24_MASK                      0x01000000
#define _ADCCSS1_CSS24_LENGTH                    0x00000001

#define _ADCCSS1_CSS25_POSITION                  0x00000019
#define _ADCCSS1_CSS25_MASK                      0x02000000
#define _ADCCSS1_CSS25_LENGTH                    0x00000001

#define _ADCCSS1_CSS26_POSITION                  0x0000001A
#define _ADCCSS1_CSS26_MASK                      0x04000000
#define _ADCCSS1_CSS26_LENGTH                    0x00000001

#define _ADCCSS1_CSS27_POSITION                  0x0000001B
#define _ADCCSS1_CSS27_MASK                      0x08000000
#define _ADCCSS1_CSS27_LENGTH                    0x00000001

#define _ADCCSS2_CSS48_POSITION                  0x00000010
#define _ADCCSS2_CSS48_MASK                      0x00010000
#define _ADCCSS2_CSS48_LENGTH                    0x00000001

#define _ADCCSS2_CSS49_POSITION                  0x00000011
#define _ADCCSS2_CSS49_MASK                      0x00020000
#define _ADCCSS2_CSS49_LENGTH                    0x00000001

#define _ADCCSS2_CSS50_POSITION                  0x00000012
#define _ADCCSS2_CSS50_MASK                      0x00040000
#define _ADCCSS2_CSS50_LENGTH                    0x00000001

#define _ADCCSS2_CSS51_POSITION                  0x00000013
#define _ADCCSS2_CSS51_MASK                      0x00080000
#define _ADCCSS2_CSS51_LENGTH                    0x00000001

#define _ADCCSS2_CSS52_POSITION                  0x00000014
#define _ADCCSS2_CSS52_MASK                      0x00100000
#define _ADCCSS2_CSS52_LENGTH                    0x00000001

#define _ADCCSS2_CSS53_POSITION                  0x00000015
#define _ADCCSS2_CSS53_MASK                      0x00200000
#define _ADCCSS2_CSS53_LENGTH                    0x00000001

#define _ADCDSTAT1_ARDY0_POSITION                0x00000000
#define _ADCDSTAT1_ARDY0_MASK                    0x00000001
#define _ADCDSTAT1_ARDY0_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY1_POSITION                0x00000001
#define _ADCDSTAT1_ARDY1_MASK                    0x00000002
#define _ADCDSTAT1_ARDY1_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY2_POSITION                0x00000002
#define _ADCDSTAT1_ARDY2_MASK                    0x00000004
#define _ADCDSTAT1_ARDY2_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY3_POSITION                0x00000003
#define _ADCDSTAT1_ARDY3_MASK                    0x00000008
#define _ADCDSTAT1_ARDY3_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY4_POSITION                0x00000004
#define _ADCDSTAT1_ARDY4_MASK                    0x00000010
#define _ADCDSTAT1_ARDY4_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY5_POSITION                0x00000005
#define _ADCDSTAT1_ARDY5_MASK                    0x00000020
#define _ADCDSTAT1_ARDY5_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY6_POSITION                0x00000006
#define _ADCDSTAT1_ARDY6_MASK                    0x00000040
#define _ADCDSTAT1_ARDY6_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY7_POSITION                0x00000007
#define _ADCDSTAT1_ARDY7_MASK                    0x00000080
#define _ADCDSTAT1_ARDY7_LENGTH                  0x00000001

