Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
#define _ADCSYSCFG0_AN17_POSITION                0x00000011
#define _ADCSYSCFG0_AN17_MASK                    0x00020000
#define _ADCSYSCFG0_AN17_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN18_POSITION                0x00000012
#define _ADCSYSCFG0_AN18_MASK                    0x00040000
#define _ADCSYSCFG0_AN18_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN19_POSITION                0x00000013
#define _ADCSYSCFG0_AN19_MASK                    0x00080000
#define _ADCSYSCFG0_AN19_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN24_POSITION                0x00000018
#define _ADCSYSCFG0_AN24_MASK                    0x01000000
#define _ADCSYSCFG0_AN24_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN25_POSITION                0x00000019
#define _ADCSYSCFG0_AN25_MASK                    0x02000000
#define _ADCSYSCFG0_AN25_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN26_POSITION                0x0000001A
#define _ADCSYSCFG0_AN26_MASK                    0x04000000
#define _ADCSYSCFG0_AN26_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN27_POSITION                0x0000001B
#define _ADCSYSCFG0_AN27_MASK                    0x08000000
#define _ADCSYSCFG0_AN27_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN48_POSITION                0x00000010
#define _ADCSYSCFG1_AN48_MASK                    0x00010000
#define _ADCSYSCFG1_AN48_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN49_POSITION                0x00000011
#define _ADCSYSCFG1_AN49_MASK                    0x00020000
#define _ADCSYSCFG1_AN49_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN50_POSITION                0x00000012
#define _ADCSYSCFG1_AN50_MASK                    0x00040000
#define _ADCSYSCFG1_AN50_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN51_POSITION                0x00000013
#define _ADCSYSCFG1_AN51_MASK                    0x00080000
#define _ADCSYSCFG1_AN51_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN52_POSITION                0x00000014
#define _ADCSYSCFG1_AN52_MASK                    0x00100000
#define _ADCSYSCFG1_AN52_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN53_POSITION                0x00000015
#define _ADCSYSCFG1_AN53_MASK                    0x00200000
#define _ADCSYSCFG1_AN53_LENGTH                  0x00000001

#define _U1OTGIR_VBUSVDIF_POSITION               0x00000000
#define _U1OTGIR_VBUSVDIF_MASK                   0x00000001
#define _U1OTGIR_VBUSVDIF_LENGTH                 0x00000001

#define _U1OTGIR_SESENDIF_POSITION               0x00000002
#define _U1OTGIR_SESENDIF_MASK                   0x00000004
#define _U1OTGIR_SESENDIF_LENGTH                 0x00000001

#define _U1OTGIR_SESVDIF_POSITION                0x00000003
#define _U1OTGIR_SESVDIF_MASK                    0x00000008
#define _U1OTGIR_SESVDIF_LENGTH                  0x00000001

#define _U1OTGIR_ACTVIF_POSITION                 0x00000004
#define _U1OTGIR_ACTVIF_MASK                     0x00000010
#define _U1OTGIR_ACTVIF_LENGTH                   0x00000001

#define _U1OTGIR_LSTATEIF_POSITION               0x00000005
#define _U1OTGIR_LSTATEIF_MASK                   0x00000020
#define _U1OTGIR_LSTATEIF_LENGTH                 0x00000001

#define _U1OTGIR_T1MSECIF_POSITION               0x00000006
#define _U1OTGIR_T1MSECIF_MASK                   0x00000040
#define _U1OTGIR_T1MSECIF_LENGTH                 0x00000001

#define _U1OTGIR_IDIF_POSITION                   0x00000007
#define _U1OTGIR_IDIF_MASK                       0x00000080
#define _U1OTGIR_IDIF_LENGTH                     0x00000001

#define _U1OTGIE_VBUSVDIE_POSITION               0x00000000
#define _U1OTGIE_VBUSVDIE_MASK                   0x00000001
#define _U1OTGIE_VBUSVDIE_LENGTH                 0x00000001

#define _U1OTGIE_SESENDIE_POSITION               0x00000002
#define _U1OTGIE_SESENDIE_MASK                   0x00000004
#define _U1OTGIE_SESENDIE_LENGTH                 0x00000001

#define _U1OTGIE_SESVDIE_POSITION                0x00000003
#define _U1OTGIE_SESVDIE_MASK                    0x00000008
#define _U1OTGIE_SESVDIE_LENGTH                  0x00000001

#define _U1OTGIE_ACTVIE_POSITION                 0x00000004
#define _U1OTGIE_ACTVIE_MASK                     0x00000010
#define _U1OTGIE_ACTVIE_LENGTH                   0x00000001

#define _U1OTGIE_LSTATEIE_POSITION               0x00000005
#define _U1OTGIE_LSTATEIE_MASK                   0x00000020
#define _U1OTGIE_LSTATEIE_LENGTH                 0x00000001

#define _U1OTGIE_T1MSECIE_POSITION               0x00000006
#define _U1OTGIE_T1MSECIE_MASK                   0x00000040
#define _U1OTGIE_T1MSECIE_LENGTH                 0x00000001

#define _U1OTGIE_IDIE_POSITION                   0x00000007
#define _U1OTGIE_IDIE_MASK                       0x00000080
#define _U1OTGIE_IDIE_LENGTH                     0x00000001

#define _U1OTGSTAT_VBUSVD_POSITION               0x00000000
#define _U1OTGSTAT_VBUSVD_MASK                   0x00000001
#define _U1OTGSTAT_VBUSVD_LENGTH                 0x00000001

#define _U1OTGSTAT_SESEND_POSITION               0x00000002
#define _U1OTGSTAT_SESEND_MASK                   0x00000004
#define _U1OTGSTAT_SESEND_LENGTH                 0x00000001

#define _U1OTGSTAT_SESVD_POSITION                0x00000003
#define _U1OTGSTAT_SESVD_MASK                    0x00000008
#define _U1OTGSTAT_SESVD_LENGTH                  0x00000001

#define _U1OTGSTAT_LSTATE_POSITION               0x00000005
#define _U1OTGSTAT_LSTATE_MASK                   0x00000020
#define _U1OTGSTAT_LSTATE_LENGTH                 0x00000001

#define _U1OTGSTAT_ID_POSITION                   0x00000007
#define _U1OTGSTAT_ID_MASK                       0x00000080
#define _U1OTGSTAT_ID_LENGTH                     0x00000001

#define _U1OTGCON_VBUSDIS_POSITION               0x00000000
#define _U1OTGCON_VBUSDIS_MASK                   0x00000001
#define _U1OTGCON_VBUSDIS_LENGTH                 0x00000001

#define _U1OTGCON_VBUSCHG_POSITION               0x00000001
#define _U1OTGCON_VBUSCHG_MASK                   0x00000002
#define _U1OTGCON_VBUSCHG_LENGTH                 0x00000001

