Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk1024mcf064.h
#define _ALRMDATE_DAY10_POSITION                 0x0000000C
#define _ALRMDATE_DAY10_MASK                     0x0000F000
#define _ALRMDATE_DAY10_LENGTH                   0x00000004

#define _ALRMDATE_MONTH01_POSITION               0x00000010
#define _ALRMDATE_MONTH01_MASK                   0x000F0000
#define _ALRMDATE_MONTH01_LENGTH                 0x00000004

#define _ALRMDATE_MONTH10_POSITION               0x00000014
#define _ALRMDATE_MONTH10_MASK                   0x00F00000
#define _ALRMDATE_MONTH10_LENGTH                 0x00000004

#define _ALRMDATE_w_POSITION                     0x00000000
#define _ALRMDATE_w_MASK                         0xFFFFFFFF
#define _ALRMDATE_w_LENGTH                       0x00000020

#define _DSCON_RELEASE_POSITION                  0x00000000
#define _DSCON_RELEASE_MASK                      0x00000001
#define _DSCON_RELEASE_LENGTH                    0x00000001

#define _DSCON_DSBOR_POSITION                    0x00000001
#define _DSCON_DSBOR_MASK                        0x00000002
#define _DSCON_DSBOR_LENGTH                      0x00000001

#define _DSCON_RTCCWDIS_POSITION                 0x00000008
#define _DSCON_RTCCWDIS_MASK                     0x00000100
#define _DSCON_RTCCWDIS_LENGTH                   0x00000001

#define _DSCON_RTCDIS_POSITION                   0x0000000C
#define _DSCON_RTCDIS_MASK                       0x00001000
#define _DSCON_RTCDIS_LENGTH                     0x00000001

#define _DSCON_DSGPREN_POSITION                  0x0000000D
#define _DSCON_DSGPREN_MASK                      0x00002000
#define _DSCON_DSGPREN_LENGTH                    0x00000001

#define _DSCON_DSEN_POSITION                     0x0000000F
#define _DSCON_DSEN_MASK                         0x00008000
#define _DSCON_DSEN_LENGTH                       0x00000001

#define _DSCON_w_POSITION                        0x00000000
#define _DSCON_w_MASK                            0xFFFFFFFF
#define _DSCON_w_LENGTH                          0x00000020

#define _DSWAKE_DSMCLR_POSITION                  0x00000002
#define _DSWAKE_DSMCLR_MASK                      0x00000004
#define _DSWAKE_DSMCLR_LENGTH                    0x00000001

#define _DSWAKE_DSRTC_POSITION                   0x00000003
#define _DSWAKE_DSRTC_MASK                       0x00000008
#define _DSWAKE_DSRTC_LENGTH                     0x00000001

#define _DSWAKE_DSWDT_POSITION                   0x00000004
#define _DSWAKE_DSWDT_MASK                       0x00000010
#define _DSWAKE_DSWDT_LENGTH                     0x00000001

#define _DSWAKE_DSFLT_POSITION                   0x00000007
#define _DSWAKE_DSFLT_MASK                       0x00000080
#define _DSWAKE_DSFLT_LENGTH                     0x00000001

#define _DSWAKE_DSINT0_POSITION                  0x00000008
#define _DSWAKE_DSINT0_MASK                      0x00000100
#define _DSWAKE_DSINT0_LENGTH                    0x00000001

#define _DSWAKE_w_POSITION                       0x00000000
#define _DSWAKE_w_MASK                           0xFFFFFFFF
#define _DSWAKE_w_LENGTH                         0x00000020

#define _DSGPR0_DSGPR_POSITION                   0x00000000
#define _DSGPR0_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR0_DSGPR_LENGTH                     0x00000020

#define _DSGPR1_DSGPR_POSITION                   0x00000000
#define _DSGPR1_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR1_DSGPR_LENGTH                     0x00000020

#define _DSGPR2_DSGPR_POSITION                   0x00000000
#define _DSGPR2_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR2_DSGPR_LENGTH                     0x00000020

#define _DSGPR3_DSGPR_POSITION                   0x00000000
#define _DSGPR3_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR3_DSGPR_LENGTH                     0x00000020

#define _DSGPR4_DSGPR_POSITION                   0x00000000
#define _DSGPR4_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR4_DSGPR_LENGTH                     0x00000020

#define _DSGPR5_DSGPR_POSITION                   0x00000000
#define _DSGPR5_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR5_DSGPR_LENGTH                     0x00000020

#define _DSGPR6_DSGPR_POSITION                   0x00000000
#define _DSGPR6_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR6_DSGPR_LENGTH                     0x00000020

#define _DSGPR7_DSGPR_POSITION                   0x00000000
#define _DSGPR7_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR7_DSGPR_LENGTH                     0x00000020

#define _DSGPR8_DSGPR_POSITION                   0x00000000
#define _DSGPR8_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR8_DSGPR_LENGTH                     0x00000020

#define _DSGPR9_DSGPR_POSITION                   0x00000000
#define _DSGPR9_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR9_DSGPR_LENGTH                     0x00000020

#define _DSGPR10_DSGPR_POSITION                  0x00000000
#define _DSGPR10_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR10_DSGPR_LENGTH                    0x00000020

#define _DSGPR11_DSGPR_POSITION                  0x00000000
#define _DSGPR11_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR11_DSGPR_LENGTH                    0x00000020

#define _DSGPR12_DSGPR_POSITION                  0x00000000
#define _DSGPR12_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR12_DSGPR_LENGTH                    0x00000020

#define _DSGPR13_DSGPR_POSITION                  0x00000000
#define _DSGPR13_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR13_DSGPR_LENGTH                    0x00000020

#define _DSGPR14_DSGPR_POSITION                  0x00000000
#define _DSGPR14_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR14_DSGPR_LENGTH                    0x00000020

#define _DSGPR15_DSGPR_POSITION                  0x00000000
#define _DSGPR15_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR15_DSGPR_LENGTH                    0x00000020

#define _DSGPR16_DSGPR_POSITION                  0x00000000
#define _DSGPR16_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR16_DSGPR_LENGTH                    0x00000020

#define _DSGPR17_DSGPR_POSITION                  0x00000000
#define _DSGPR17_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR17_DSGPR_LENGTH                    0x00000020

#define _DSGPR18_DSGPR_POSITION                  0x00000000
#define _DSGPR18_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR18_DSGPR_LENGTH                    0x00000020

#define _DSGPR19_DSGPR_POSITION                  0x00000000
#define _DSGPR19_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR19_DSGPR_LENGTH                    0x00000020

#define _DSGPR20_DSGPR_POSITION                  0x00000000
#define _DSGPR20_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR20_DSGPR_LENGTH                    0x00000020

#define _DSGPR21_DSGPR_POSITION                  0x00000000
#define _DSGPR21_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR21_DSGPR_LENGTH                    0x00000020

#define _DSGPR22_DSGPR_POSITION                  0x00000000
#define _DSGPR22_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR22_DSGPR_LENGTH                    0x00000020

#define _DSGPR23_DSGPR_POSITION                  0x00000000
#define _DSGPR23_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR23_DSGPR_LENGTH                    0x00000020

#define _DSGPR24_DSGPR_POSITION                  0x00000000
#define _DSGPR24_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR24_DSGPR_LENGTH                    0x00000020

#define _DSGPR25_DSGPR_POSITION                  0x00000000
#define _DSGPR25_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR25_DSGPR_LENGTH                    0x00000020

#define _DSGPR26_DSGPR_POSITION                  0x00000000
#define _DSGPR26_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR26_DSGPR_LENGTH                    0x00000020

#define _DSGPR27_DSGPR_POSITION                  0x00000000
#define _DSGPR27_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR27_DSGPR_LENGTH                    0x00000020

